Dynamo.PythonServices.PythonEngineManager.GetEvaluatorInfo(PythonNodeModels.PythonEngineVersion,System.String@,System.String@)
The shared logic for Python node evaluation
engine:
evaluatorClass:
evaluationMethod: