Dynamo.Interfaces.IRenderPrecisionPreference
Temporary interface to avoid breaking changes.
TODO: Merge with IPreferences for 3.0 (DYN-1699)

Dynamo.Interfaces.IRenderPrecisionPreference.RenderPrecision
Indicate which render precision will be used