Dynamo.Linting.Rules.LinterRule
Base class for all linting rules

Dynamo.Linting.Rules.LinterRule.Id
Unique id of this rule

Dynamo.Linting.Rules.LinterRule.SeverityCode
Severity code of this rule.
This code will define how the rule is displayed in the UI

Dynamo.Linting.Rules.LinterRule.Description
Description of the rule

Dynamo.Linting.Rules.LinterRule.CallToAction
Description of how to solve issues related to this rule

Dynamo.Linting.Rules.LinterRule.EvaluationTriggerEvents
List of Property names that this rule should react to changes on

Dynamo.Linting.Rules.LinterRule.InitializeRule(Dynamo.Graph.Workspaces.WorkspaceModel)
Uses the init function to evaluate this rule and return a collection of evaluation results
workspaceModel:
Returns:

Dynamo.Linting.Rules.LinterRule.CleanupRule(Dynamo.Graph.Workspaces.WorkspaceModel)
Uses the cleanup function to allow a rule to get rid of any transient data
it might have stored before the workspace model is disposed
muribundWorkspaceModel:
Returns:

Dynamo.Linting.Rules.LinterRule.InitializeBase(Dynamo.Graph.Workspaces.WorkspaceModel)
Initializes this rule using the InitFunction(WorkspaceModel)
workspaceModel:
Returns: