Dynamo.Models.IEngineControllerManager
This class creates an interface for Engine controller.

Dynamo.Models.IEngineControllerManager.EngineController
A controller to coordinate the interactions between some DesignScript
sub components like library management, live runner and so on.