Dynamo.Models.DynamoModel.OpenFileCommand
A command to open a file.

Dynamo.Models.DynamoModel.OpenFileCommand.#ctor(System.String,System.Boolean)
filePath: The path to the file.
forceManualExecutionMode: Should the file be opened in manual execution mode?