Dynamo.Linting.Rules.GraphRuleEvaluationResult
Rule evaluation result for graph linter rules

Dynamo.Linting.Rules.GraphRuleEvaluationResult.RuleId
Id of the rule this evaluation result belongs to

Dynamo.Linting.Rules.GraphRuleEvaluationResult.Status
Evaluation status

Dynamo.Linting.Rules.GraphRuleEvaluationResult.NodeIds
List of nodes involved in the evaluation of this rule