Dynamo.Extensions.EnumDescription
Extension class, that allows adding description to Enum members.

Dynamo.Extensions.EnumDescription.GetDescription(System.Enum)
Extension method. Allows getting description of Enum member provided by EnumDescriptionAttribute.
enumValue: Enum member.
Returns: Description