Dynamo.Core.NotificationObject
This class notifies the View when there is a change.

Dynamo.Core.NotificationObject.PropertyChanged
Raised when a property on this object has a new value.

Dynamo.Core.NotificationObject.RaisePropertyChanged(System.String)
Raises this object's PropertyChanged event.
propertyName: The property that has a new value.

Dynamo.Core.NotificationObject.RaisePropertyChanged(System.String[])
Raises this object's PropertyChanged event for each of the properties.
propertyNames: The properties that have a new value.