Dynamo.Graph.Presets.PresetModel
This class references a set of nodemodels, and a set of serialized versions of those nodemodels
a client can use this class to store the state of a set of nodes from a graph

Dynamo.Graph.Presets.PresetModel.Name
Returns name of the preset

Dynamo.Graph.Presets.PresetModel.Description
Returns description of the preset

Dynamo.Graph.Presets.PresetModel.Nodes
Returns list of nodemodels that this state serializes

Dynamo.Graph.Presets.PresetModel.SerializedNodes
Returns list of serialized nodes

Dynamo.Graph.Presets.PresetModel.GuidAttributeName
Guid attribute name used during serialization

Dynamo.Graph.Presets.PresetModel.StateNameAttributeName
Name attribute name used during serialization

Dynamo.Graph.Presets.PresetModel.DescriptionAttributeName
Description attribute name used during serialization

Dynamo.Graph.Presets.PresetModel.NodeNameAttributeName
NodeName attribute name used during serialization

Dynamo.Graph.Presets.PresetModel.#ctor(System.String,System.String,System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
Create a new presetsState, this will serialize all the referenced nodes
by calling their serialize method, the resulting XML elements will be used
to save this state when the presetModel is saved on workspace save
name: Name for the state, must not be null
description: Description of the state, can be null
inputsToSave: Set of nodeModels, must be not null

Dynamo.Graph.Presets.PresetModel.#ctor(System.String,System.String,System.Collections.Generic.List{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.List{System.Xml.XmlElement},System.Guid)
this overload is used for loading

Dynamo.Graph.Presets.PresetModel.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
this overload is used for loading with deserializeCore, we must pass the nodesInTheGraph to the instance of the Preset so that
we can detect missing nodes
nodesInGraph: