Dynamo.Graph.UpdateValueParams
This class encapsulates the input parameters that need to be passed into nodes
when they are updated in the UI.

Dynamo.Graph.UpdateValueParams.#ctor(System.String,System.String,ProtoCore.Namespace.ElementResolver)
propertyName: Name of the property whose value is to be updated.
This parameter cannot be empty or null.
propertyValue: Value of the named property whose value is to be
updated. This parameter can either be null or empty if the targeted property
allows such values.This value comes directly
from DynamoTextBox after user commits it. Overridden methods then use
a specific IValueConverter to turn this string into another data type
that it expects.
elementResolver: Responsible for resolving class namespaces.

Dynamo.Graph.UpdateValueParams.PropertyName
Returns name of the property whose value needs to be updated.

Dynamo.Graph.UpdateValueParams.PropertyValue
Returns string representation of value to update specified node property

Dynamo.Graph.UpdateValueParams.ElementResolver
Returns Dynamo.Graph.UpdateValueParams.ElementResolver object responsible for resolving class namespaces