Dynamo.Engine.CodeGeneration.AstBuilder
AstBuilder is a factory class to create different kinds of AST nodes.

Dynamo.Engine.CodeGeneration.AstBuilder.#ctor(Dynamo.Engine.CodeGeneration.IAstNodeContainer)
Construct a AstBuilder with AST node contiainer.
nodeContainer:

Dynamo.Engine.CodeGeneration.AstBuilder.TopologicalSort(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
Sort nodes in topological order.
nodes:
Returns:

Dynamo.Engine.CodeGeneration.AstBuilder.BfsTraverse(Dynamo.Graph.Nodes.NodeModel,System.Collections.Generic.Dictionary{Dynamo.Graph.Nodes.NodeModel,Dynamo.Engine.CodeGeneration.AstBuilder.MarkFlag},System.Collections.Generic.Queue{Dynamo.Graph.Nodes.NodeModel})
Starts from the input node as root, do breadth-first and post-order
traversal of the graph (inputs nodes as children nodes). Breadth-first
traversal ensures all inputs nodes are visited in their input order
and post-order traversal ensures all upstream nodes are visited
firstly.
node: Root node
nodeFlags: Dictionary to record if a node has been visited or not
sortedNodes: Record all visited nodes

Dynamo.Engine.CodeGeneration.AstBuilder.TopologicalSortForGraph(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
Topological sort *the whole graph*. If the input nodes are part of a
graph, it does not promise to generate a good topological order. For
example, for the following graph:
+---+
| A | -----+
+---+      +----> +---+
| C |
+----> +---+
+---+      |
| B | -----+
+---+
Their ideal topological order is A -> B -> C. If the input is only {A, B},
it may return {B, A} which is not OK in node to code.
Note it is much slower than TopologicalSort().
nodes:
Returns:

Dynamo.Engine.CodeGeneration.AstBuilder.CompileToAstNodes(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},Dynamo.Engine.CodeGeneration.CompilationContext,System.Boolean)
Compile a collection of NodeModel to AST nodes in different contexts.
If the context is ForNodeToCode, nodes should already be sorted in
topological order.
nodes:
context:
verboseLogging:
Returns:

Dynamo.Engine.CodeGeneration.AstBuilder.CompileCustomNodeDefinition(System.Guid,System.Collections.Generic.IEnumerable{System.String},System.String,System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{ProtoCore.AST.AssociativeAST.AssociativeNode},System.Collections.Generic.IEnumerable{Dynamo.Library.TypedParameter},System.Boolean)
Compiles a collection of Dynamo nodes into a function definition for a custom node.
functionId:
returnKeys:
functionName:
funcBody:
outputNodes:
parameters:
verboseLogging:

Dynamo.Engine.CodeGeneration.AstBuilder.OnAstNodeBuilding(System.Guid)
Notify IAstNodeContainer that starts building AST nodes.
nodeGuid:

Dynamo.Engine.CodeGeneration.AstBuilder.OnAstNodeBuilt(System.Guid,System.Collections.Generic.IEnumerable{ProtoCore.AST.AssociativeAST.AssociativeNode})
Notify IAstNodeContainer that AST nodes have been built.
nodeGuid:
astNodes: