Dynamo.Engine.CodeCompletion.CompletionData
Code completion data that typically gets displayed on a list as part of
the auto-completion feature. This class represents a common currency that
is view-independent.

Dynamo.Engine.CodeCompletion.CompletionData.Text
Displayed text in completion list
Class name or fully qualified name
Method, property name or keyword

Dynamo.Engine.CodeCompletion.CompletionData.Stub
Method signatures or any stub description for classes etc.

Dynamo.Engine.CodeCompletion.CompletionData.Description
Description of completion item - class, method or property

Dynamo.Engine.CodeCompletion.CompletionData.Type
Type of completion item