Dynamo.Extensions.IExtensionLoader
Handles loading extensions given an extension definition files path

Dynamo.Extensions.IExtensionLoader.Load(System.String)
Extension method for loading assembly from the path. Returns Dynamo.Extensions.IExtension.

Dynamo.Extensions.IExtensionLoader.LoadDirectory(System.String)
Extension method for loading assembly from a directory. Returns Dynamo.Extensions.IExtension.

Dynamo.Extensions.IExtensionLoader.ExtensionLoading
An event that is raised when an extension starts loading.