Dynamo.Configuration.PreferenceSettings
PreferenceSettings is a class for GUI to persist certain settings.
Upon running of the GUI, those settings that are persistent will be loaded
from a XML file from DYNAMO_SETTINGS_FILE.
When GUI is closed, the settings are saved back into the XML file.

Dynamo.Configuration.PreferenceSettings.DefaultMaxNumRecentFiles
Indicates the maximum number of files shown in Recent Files

Dynamo.Configuration.PreferenceSettings.DefaultRenderPrecision
Indicates the default render precision, i.e. the maximum number of tessellation divisions

Dynamo.Configuration.PreferenceSettings.DynamoTestPath
Temp PreferenceSetting Location for testing

Dynamo.Configuration.PreferenceSettings.DefaultDateFormat
Default date format

Dynamo.Configuration.PreferenceSettings.DynamoDefaultTime
Default time

Dynamo.Configuration.PreferenceSettings.IsFirstRun
Indicates first run

Dynamo.Configuration.PreferenceSettings.IsUsageReportingApproved
Indicates whether usage reporting is approved or not.

Dynamo.Configuration.PreferenceSettings.IsAnalyticsReportingApproved
Indicates whether Google analytics reporting is approved or not.

Dynamo.Configuration.PreferenceSettings.IsADPAnalyticsReportingApproved
Indicates whether ADP analytics reporting is approved or not.

Dynamo.Configuration.PreferenceSettings.LibraryWidth
The width of the library pane.

Dynamo.Configuration.PreferenceSettings.ConsoleHeight
The height of the console display.

Dynamo.Configuration.PreferenceSettings.ShowPreviewBubbles
Indicates if preview bubbles should be displayed on nodes.

Dynamo.Configuration.PreferenceSettings.ShowCodeBlockLineNumber
Indicates if code block node line numbers should  be displayed.

Dynamo.Configuration.PreferenceSettings.ShowConnector
Should connectors be visible?

Dynamo.Configuration.PreferenceSettings.ShowConnectorToolTip
Should connector tooltip be visible?

Dynamo.Configuration.PreferenceSettings.ConnectorType
The types of connector: Bezier or Polyline.

Dynamo.Configuration.PreferenceSettings.BackgroundPreviews
Collection of pairs [BackgroundPreviewName;isActive]

Dynamo.Configuration.PreferenceSettings.GetIsBackgroundPreviewActive(System.String)
Returns active state of specified background preview
name: Background preview name
Returns: The active state

Dynamo.Configuration.PreferenceSettings.SetIsBackgroundPreviewActive(System.String,System.Boolean)
Sets active state of specified background preview
name: Background preview name
value: Active state

Dynamo.Configuration.PreferenceSettings.IsBackgroundGridVisible
Should the background grid be shown?

Dynamo.Configuration.PreferenceSettings.IsBackgroundPreviewActive
Indicates whether background preview is active or not.

Dynamo.Configuration.PreferenceSettings.RenderPrecision
Indicate which render precision will be used

Dynamo.Configuration.PreferenceSettings.ShowDetailedLayout
Indicates whether show detailed or compact layout during search.

Dynamo.Configuration.PreferenceSettings.WindowX
The last X coordinate of the Dynamo window.

Dynamo.Configuration.PreferenceSettings.WindowY
The last Y coordinate of the Dynamo window.

Dynamo.Configuration.PreferenceSettings.WindowW
The last width of the Dynamo window.

Dynamo.Configuration.PreferenceSettings.WindowH
The last height of the Dynamo window.

Dynamo.Configuration.PreferenceSettings.UseHardwareAcceleration
Should Dynamo use hardware acceleration if it is supported?

Dynamo.Configuration.PreferenceSettings.NumberFormat
The decimal precision used to display numbers.

Dynamo.Configuration.PreferenceSettings.MaxNumRecentFiles
The maximum number of recent file paths to be saved.

Dynamo.Configuration.PreferenceSettings.RecentFiles
A list of recently opened file paths.

Dynamo.Configuration.PreferenceSettings.BackupFiles
A list of backup file paths.

Dynamo.Configuration.PreferenceSettings.CustomPackageFolders
A list of folders packages, custom nodes or direct paths to .dll and .ds files.

Dynamo.Configuration.PreferenceSettings.PackageDirectoriesToUninstall
A list of packages used by the Package Manager to determine
which packages are marked for deletion.

Dynamo.Configuration.PreferenceSettings.PythonTemplateFilePath
Path to the Python (.py) file to use as a starting template when creating a new PythonScript Node.

Dynamo.Configuration.PreferenceSettings.pythonTemplateFilePath
The backing store for the Python template file path. Required as static property cannot implement an interface member.

Dynamo.Configuration.PreferenceSettings.BackupInterval
This defines how long (in milliseconds) will the graph be automatically saved.

Dynamo.Configuration.PreferenceSettings.BackupFilesCount
This defines how many files will be backed up.

Dynamo.Configuration.PreferenceSettings.PackageDownloadTouAccepted
Indicates if the user has accepted the terms of
use for downloading packages from package manager.

Dynamo.Configuration.PreferenceSettings.OpenFileInManualExecutionMode
Indicates the default state of the "Open in Manual Mode"
checkbox in OpenFileDialog

Dynamo.Configuration.PreferenceSettings.IsIronPythonDialogDisabled
This defines if user wants to see the Iron Python Extension Dialog box on every new session.

Dynamo.Configuration.PreferenceSettings.ShowTabsAndSpacesInScriptEditor
This defines if user wants to see the whitespaces and tabs in python script editor.

Dynamo.Configuration.PreferenceSettings.EnableNodeAutoComplete
This defines if user wants to see the enabled node Auto Complete feature for port interaction.

Dynamo.Configuration.PreferenceSettings.DefaultPythonEngine
Engine used by default for new Python script and string nodes. If not empty, this takes precedence over any system settings.

Dynamo.Configuration.PreferenceSettings.defaultPythonEngine
Static field backing the DefaultPythonEngine setting property.

Dynamo.Configuration.PreferenceSettings.SelectedPackagePathForInstall
Currently selected package path where all packages downloaded from the Package Manager
will be installed. The default package path for install is the user data directory
currently used by the Dynamo environment.

Dynamo.Configuration.PreferenceSettings.NamespacesToExcludeFromLibrary
Indicates (if any) which namespaces should not be displayed in the Dynamo node library.
String format: "[library name]:[fully qualified namespace]"

Dynamo.Configuration.PreferenceSettings.NamespacesToExcludeFromLibrarySpecified
True if the NamespacesToExcludeFromLibrary element is found in DynamoSettings.xml.

Dynamo.Configuration.PreferenceSettings.ViewExtensionSettings
Settings that apply to view extensions.

Dynamo.Configuration.PreferenceSettings.DisableBuiltinPackages
If enabled Dynamo Built-In Packages will not be loaded.

Dynamo.Configuration.PreferenceSettings.DisableCustomPackageLocations
If enabled user's custom package locations will not be loaded.

Dynamo.Configuration.PreferenceSettings.DefaultRunType
Defines the default run type when opening a workspace

Dynamo.Configuration.PreferenceSettings.ShowRunPreview
Show Run Preview flag.

Dynamo.Configuration.PreferenceSettings.NodeSearchTagSizeLimitValue
Limits the size of the tags used by the SearchDictionary
This static property is not serialized and is assigned NodeSearchTagSizeLimit's value
if found at deserialize time.

Dynamo.Configuration.PreferenceSettings.NodeSearchTagSizeLimit
Limits the size of the tags used by the SearchDictionary

Dynamo.Configuration.PreferenceSettings.IronPythonResolveVersion
The Version of the IronPython package that Dynamo will download when it is found as missing in graphs.
This static property is not serialized and is assigned IronPythonResolveTargetVersion's value
if found at deserialize time.

Dynamo.Configuration.PreferenceSettings.IronPythonResolveTargetVersion
The Version of the IronPython package that Dynamo will download when it is found as missing in graphs.

Dynamo.Configuration.PreferenceSettings.#ctor
Initializes a new instance of the Dynamo.Configuration.PreferenceSettings class.

Dynamo.Configuration.PreferenceSettings.Save(System.String)
Saves PreferenceSettings to XML, given a file path.
filePath: Path of the XML File to save to.
Returns: True if file is saved successfully, false if an error occurred.

Dynamo.Configuration.PreferenceSettings.SaveInternal(System.String)
Saves PreferenceSettings in a default directory when no path is
specified.
preferenceFilePath: The file path to save preference
settings to. If this parameter is null or empty string, preference
settings will be saved to the default path.
Returns: True if file is saved successfully, false if an error occurred.

Dynamo.Configuration.PreferenceSettings.Load(System.String)
Loads PreferenceSettings from specified XML file if possible,
else initialises PreferenceSettings with default values.
filePath: Path of the XML File
Returns:
Stored PreferenceSettings from xml file or
Default PreferenceSettings if xml file is not found.

Dynamo.Configuration.PreferenceSettings.GetPythonTemplateFilePath
Returns the static Python template file path.
When the file exists and is not empty, its contents are used to populate new Python Script nodes added to the Dynamo workspace.
Returns:

Dynamo.Configuration.PreferenceSettings.GetDefaultPythonEngine
Provides access to the DefaultPythonEngine setting in a static context. Used from PythonNodeBase.
Returns: DefaultPythonEngine setting value