Dynamo.Search.BrowserItem
Base class for all browser items in search area.

Dynamo.Search.BrowserItem.Items
Returns items inside of the browser item

Dynamo.Search.BrowserItem.GetVisibleLeaves(System.Collections.Generic.List{Dynamo.Search.BrowserItem}@)
If this is a leaf and visible, add to items, otherwise, recurse on children
items: The accumulator

Dynamo.Search.BrowserItem.Name
A name (title) field for the BrowserItem

Dynamo.Search.BrowserItem.Height
The height of the element in search

Dynamo.Search.BrowserItem.AddChild(Dynamo.Search.BrowserInternalElement)
Adds an element as a child of this one, while updating its parent and oldparent field
elem: The element in question

Dynamo.Search.BrowserItem.CollapseToLeaves
Collapse element and all its children

Dynamo.Search.BrowserItem.SetVisibilityToLeaves(System.Boolean)
Hide element and all its children

Dynamo.Search.BrowserItem.Visibility
Whether the item is visible or not

Dynamo.Search.BrowserItem.IsSelected
Whether the item is selected or not

Dynamo.Search.BrowserItem.IsExpanded
Is the element expanded in the browser

Dynamo.Search.BrowserItem.Executed
Occurs when corresponding node is created