Dynamo.Selection.SmartCollection`1
A resetable observable collection
See: http://stackoverflow.com/questions/13302933/how-to-avoid-firing-observablecollection-collectionchanged-multiple-times-when-r

Dynamo.Selection.SmartCollection`1.AddUnique(`0)
Adds an item only if the sequence does not have it yet
item: Item to add