Dynamo.Models.DynamoModel.AddModelToGroupCommand
A command to add a model object to a group.

Dynamo.Models.DynamoModel.AddModelToGroupCommand.#ctor(System.String)
modelGuid:

Dynamo.Models.DynamoModel.AddModelToGroupCommand.#ctor(System.Guid)
modelGuid:

Dynamo.Models.DynamoModel.AddModelToGroupCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid})
modelGuid: