Dynamo.Graph.Workspaces.WorkspaceModel.PopulateJSONWorkspaceHandler
This handler handles the workspaceModel's request to populate a JSON with view data.
This is used to construct a full workspace for instrumentation.