Dynamo.Core.PathManagerParams.MajorFileVersion
Major version number to be used to form various data file paths.
If both this and MinorFileVersion are 0, then version information
is retrieved from DynamoCore.dll.

Dynamo.Core.PathManagerParams.MinorFileVersion
Minor version number to be used to form various data file paths.
If both this and MajorFileVersion are 0, then version information
is retrieved from DynamoCore.dll.

Dynamo.Core.PathManagerParams.CorePath
The full path of the directory that contains DynamoCore.dll.

Dynamo.Core.PathManagerParams.HostPath
The full path of the host application such as DynamoRevit or DynamoStudio

Dynamo.Core.PathManagerParams.PathResolver
Reference of an IPathResolver object that supplies
additional path information. This argument is optional.