Dynamo.Visualization.RenderPackageCache
This class controls the collection and distribution of render packages

Dynamo.Visualization.RenderPackageCache.#ctor
Create an empty RenderPackageCache object

Dynamo.Visualization.RenderPackageCache.#ctor(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Interfaces.IRenderPackage})
Create a RenderPackageCache object containing the given render packages
otherPackages: The packages to fill the new cache object.

Dynamo.Visualization.RenderPackageCache.Packages
Get the render packages in this cache

Dynamo.Visualization.RenderPackageCache.GetPortPackages(System.Guid)
Get the RenderPackageCache object for the given port ID
portId: The port ID used to get the sub-cache.

Dynamo.Visualization.RenderPackageCache.IsEmpty
Returns true if the cache is empty

Dynamo.Visualization.RenderPackageCache.Add(Dynamo.Visualization.RenderPackageCache)
Concatenates the other cache into this cache
other: The cache to add to this cache.

Dynamo.Visualization.RenderPackageCache.Add(Autodesk.DesignScript.Interfaces.IRenderPackage)
Adds a render package to this cache
package: The package to add to this cache.

Dynamo.Visualization.RenderPackageCache.Add(Autodesk.DesignScript.Interfaces.IRenderPackage,System.Guid)
Adds a render package to this cache, including a reference to
the output port that the package originated from
package: The package to add to this cache.
outputPortId: The output port to associate the package with.