Dynamo.Configuration.ExecutionSession.#ctor(Dynamo.Scheduler.UpdateGraphAsyncTask,Dynamo.Models.DynamoModel,System.String)
Constructs a new execution session.

Dynamo.Configuration.ExecutionSession.CurrentWorkspacePath
File path for the current workspace in execution. Could be null or
empty string if workspace is not yet saved.

Dynamo.Configuration.ExecutionSession.GetParameterValue(System.String)
Returns session parameter value for the given parameter name.
parameter: Name of session parameter
Returns: Session parameter value as object

Dynamo.Configuration.ExecutionSession.GetParameterKeys
Returns list of session parameter keys available in the session.
Returns:

Dynamo.Configuration.ExecutionSession.ResolveFilePath(System.String@)
A helper method to resolve the given file path. The given file path
will be resolved by searching into the current workspace, core and
host application installation folders etc.
filepath: Input file path
Returns: True if the file is found