Dynamo.Migration.MigrationManager.Decision
Enumerator to determine if migration should proceed or abort. This
enumerator is to be used with MigrationManager.ShouldMigrateFile().

Dynamo.Migration.MigrationManager.Decision.Abort
The migration should not proceed and the file open operation
should be aborted. This can be used to indicate that a version
of file that is no longer supported and no migration path is
provided.

Dynamo.Migration.MigrationManager.Decision.Migrate
File migration should proceed to migrate the older file version
to a newer one.

Dynamo.Migration.MigrationManager.Decision.Retain
The file version is up-to-date and the file can be used as-is
without migration.