Dynamo.Extensions.EnumDescriptionAttribute
Provides description for enum member.

Dynamo.Extensions.EnumDescriptionAttribute.#ctor(System.String,System.Type)
Creates EnumDescriptionAttribute.
resourceKey: Resource name.
resourceType: Resource type, i.e. type of resource class. E.g. typeof(Resources)

Dynamo.Extensions.EnumDescriptionAttribute.Description
Description of enum item.