Dynamo.Migration.PortId
This structure uniquely identifies a given port in the graph.

Dynamo.Migration.PortId.#ctor(System.String,System.Int32,Dynamo.Graph.Nodes.PortType)
Creates PortId.
owningNode: Node GUID
portIndex: Index
type: Port type

Dynamo.Migration.PortId.OwningNode
Node GUID.

Dynamo.Migration.PortId.PortIndex
Index of the port.

Dynamo.Migration.PortId.PortType
PortType.
The port can be incoming or outcoming.