Dynamo.Models.DynamoModel.UpdateModelValueCommand
A command used to update the value of a property on a model object.
Throws System.InvalidOperationException: This exception is
thrown if the node model is not found in the workspace.
///
Throws System.ArgumentNullException: This exception is
thrown if the node model or list of node models passed is null or empty.

Dynamo.Models.DynamoModel.UpdateModelValueCommand.#ctor(System.Guid,System.Guid,System.String,System.String)
workspaceGuid: Guid of the target workspace. Guid.Empty means current workspace
modelGuid: Guid of node model
name:
value:

Dynamo.Models.DynamoModel.UpdateModelValueCommand.#ctor(System.String,System.String,System.String)
modelGuid:
name:
value:

Dynamo.Models.DynamoModel.UpdateModelValueCommand.#ctor(System.Guid,System.String,System.String)
modelGuid:
name:
value:

Dynamo.Models.DynamoModel.UpdateModelValueCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid},System.String,System.String)
modelGuid:
name:
value:

Dynamo.Models.DynamoModel.UpdateModelValueCommand.#ctor(System.Guid,System.Collections.Generic.IEnumerable{System.Guid},System.String,System.String)
workspaceGuid: Guid of the target workspace. Guid.Empty means current workspace
modelGuid:
name:
value:

Dynamo.Models.DynamoModel.UpdateModelValueCommand.ModelGuids
A collection of System.Guid which identify the model objects to update.

Dynamo.Models.DynamoModel.UpdateModelValueCommand.Name
The name of the property to update.

Dynamo.Models.DynamoModel.UpdateModelValueCommand.Value
The new value to apply to the property.