Dynamo.Extensions.ICommandExecutive
Interface to Dynamo's recordable command framework

Dynamo.Extensions.ICommandExecutive.ExecuteCommand(Dynamo.Models.DynamoModel.RecordableCommand,System.String,System.String)
Endpoint method to execute any commands deriving from RecordableCommand
command:
uniqueId:
extensionName: