Dynamo.Interfaces.IPathManager
This interface provides the most common paths.
E.g. core directory, package directory etc.

Dynamo.Interfaces.IPathManager.DynamoCoreDirectory
The directory in which DynamoCore.dll is guaranteed to be found.

Dynamo.Interfaces.IPathManager.HostApplicationDirectory
The directory in which the host application such as DynamoRevit or
DynamoStudio could be found.

Dynamo.Interfaces.IPathManager.UserDataDirectory
The local directory that contains user specific data files.

Dynamo.Interfaces.IPathManager.CommonDataDirectory
The local directory that contains common data files among users.

Dynamo.Interfaces.IPathManager.DefaultUserDefinitions
The default directory that contains custom nodes created by the user.

Dynamo.Interfaces.IPathManager.DefinitionDirectories
Directories from where custom nodes are to be loaded. The implementor
of this interface method should always guarantee that a non-empty
list is returned, and that the first entry represents the default
custom node directory. Custom nodes created are stored in the
default directory, which is specific to the current user. Changes to
custom nodes may or may not be saved to their current location depending
on write access.

Dynamo.Interfaces.IPathManager.CommonDefinitions
The local directory that contains custom nodes created by all users.

Dynamo.Interfaces.IPathManager.LogDirectory
The local directory where log files are generated. This directory is
specific to the current user.

Dynamo.Interfaces.IPathManager.DefaultPackagesDirectory
The default directory for saving packages downloaded through
the package manager. This directory is specific to the current user.

Dynamo.Interfaces.IPathManager.PackagesDirectories
Directories from where packages are to be loaded. The implementor
of this interface method should always guarantee that a non-empty
list is returned, and that the first entry represents the default
package directory. Packages downloaded through package manager are
stored in the default package directory, which is specific to the
current user.

Dynamo.Interfaces.IPathManager.ExtensionsDirectories
The directories, which contains ExtensionDefinition .xml files

Dynamo.Interfaces.IPathManager.ViewExtensionsDirectories
The directories, which contains ViewExtensionDefinition.xml files

Dynamo.Interfaces.IPathManager.SamplesDirectory
The root directory where all sample files are stored. This directory
is common to all users on the machine.

Dynamo.Interfaces.IPathManager.BackupDirectory
The directory where the automatically saved files will be stored.

Dynamo.Interfaces.IPathManager.PreferenceFilePath
Full path to the preference xml file. This setting file is specific
to the current user.

Dynamo.Interfaces.IPathManager.PythonTemplateFilePath
Full path to the python template py file. This setting file is specific
to the current user.

Dynamo.Interfaces.IPathManager.GalleryFilePath
Full path to the GalleryContent xml file. The file is located in
the AppData/Dynamo/[version]/gallery/

Dynamo.Interfaces.IPathManager.NodeDirectories
Folders in which node assemblies can be located.

Dynamo.Interfaces.IPathManager.PreloadedLibraries
A list of node assembly names to be preloaded with Dynamo.

Dynamo.Interfaces.IPathManager.MajorFileVersion
Major version of assembly file

Dynamo.Interfaces.IPathManager.MinorFileVersion
Minor version of assembly file

Dynamo.Interfaces.IPathManager.AddResolutionPath(System.String)
Call this method to add additional path for consideration when path
resolution take place.
path: The full path to be considered when PathManager
attempts to resolve a file path. If this argument does not represent
a valid directory path, this method throws an exception.

Dynamo.Interfaces.IPathManager.ResolveLibraryPath(System.String@)
Given an initial file path with the file name, resolve the full path
to the target file.
library: The initial library file path. This argument
can optionally include the full path with a target file name. If a
full path is given and it represents an invalid file path, the file
name will be searched for in additional resolution paths.
Returns: Returns true if the requested file can be located, or false
otherwise.

Dynamo.Interfaces.IPathManager.ResolveDocumentPath(System.String@)
Given an initial RTF document file name, this method returns the
absolute path of the file, if one exists.
document: The name of the RTF file. This argument cannot
be null or empty.
Returns: Returns true if the requested document can be located, or
false otherwise.