Dynamo.Graph.Workspaces.INodeLibraryDependencyInfo
An interface that describes a dependency a workspace can have on other code.

Dynamo.Graph.Workspaces.INodeLibraryDependencyInfo.ReferenceType
The type of reference this dependency is.

Dynamo.Graph.Workspaces.INodeLibraryDependencyInfo.Nodes
Guids of nodes in the workspace that are dependent on this reference.

Dynamo.Graph.Workspaces.INodeLibraryDependencyInfo.Name
Name of the Reference.

Dynamo.Graph.Workspaces.INodeLibraryDependencyInfo.Version
Version of this reference. This may be null.

Dynamo.Graph.Workspaces.INodeLibraryDependencyInfo.AddDependent(System.Guid)
Add the Guid of a dependent node
guid:

Dynamo.Graph.Workspaces.INodeLibraryDependencyInfo.IsLoaded
Indicates whether this dependency is loaded in the current session

Dynamo.Graph.Workspaces.INodeLibraryDependencyInfo.State
The state of this dependency