Dynamo.Graph.Workspaces.LayoutExtensions
Layout class contains methods for organizing graphs.

Dynamo.Graph.Workspaces.LayoutExtensions.DoGraphAutoLayout(Dynamo.Graph.Workspaces.WorkspaceModel,System.Boolean,System.Boolean,System.Nullable{System.Guid})
This function wraps a few methods on the workspace model layer
to set up and run the graph layout algorithm.
workspace: Workspace on which graph layout will be performed.
reuseUndoRedoGroup: If true, skip initializing new undo action group.

Dynamo.Graph.Workspaces.LayoutExtensions.GenerateCombinedGraph(Dynamo.Graph.Workspaces.WorkspaceModel,System.Boolean,System.Collections.Generic.List{GraphLayout.Graph}@,System.Collections.Generic.List{System.Collections.Generic.List{GraphLayout.Node}}@)
workspace: A Dynamo.Graph.Workspaces.WorkspaceModel.
This method extracts all models from the workspace and puts them
into the combined graph object, LayoutSubgraphs.First()
isGroupLayout: True if all the selected models are groups.
layoutSubgraphs:
subgraphClusters:

Dynamo.Graph.Workspaces.LayoutExtensions.AddConnectorEdgesIncludingPinEdges(GraphLayout.Graph,Dynamo.Graph.Connectors.ConnectorModel,System.Nullable{System.Guid},System.Nullable{System.Guid})
If a connector has connectorPins, their edges get added to the combined graph.
combinedGraph:
connector:

Dynamo.Graph.Workspaces.LayoutExtensions.RecordUndoGraphLayout(Dynamo.Graph.Workspaces.WorkspaceModel,System.Boolean,System.Boolean)
This method adds relevant models to the undo recorder.
workspace: A Dynamo.Graph.Workspaces.WorkspaceModel.
isGroupLayout: True if all the selected models are groups.
reuseUndoRedoGroup: Skip creating new undo action group, reuse existing group if true.

Dynamo.Graph.Workspaces.LayoutExtensions.GenerateSeparateSubgraphs(System.Collections.Generic.HashSet{GraphLayout.Node},System.Collections.Generic.List{GraphLayout.Graph})
This method repeatedly takes a selected node in the combined graph and
uses breadth-first search to find all other nodes in the same subgraph
until all selected nodes have been processed.
nodes: A cluster of nodes to be separated into subgraphs.
layoutSubgraphs: A collection of layout subgraphs.

Dynamo.Graph.Workspaces.LayoutExtensions.RunLayoutSubgraph(GraphLayout.Graph,System.Boolean)
This function calls the graph layout algorithm methods.
graph: The subgraph to be processed.
isGroupLayout: True if all selected models are groups.

Dynamo.Graph.Workspaces.LayoutExtensions.AvoidSubgraphOverlap(System.Collections.Generic.List{GraphLayout.Graph})
This method repeatedly shifts subgraphs away vertically from each other
when there are any two nodes from different subgraphs overlapping.

Dynamo.Graph.Workspaces.LayoutExtensions.SaveLayoutGraph(Dynamo.Graph.Workspaces.WorkspaceModel,System.Collections.Generic.List{GraphLayout.Graph})
This method pushes changes from the GraphLayout.Graph objects
back to the workspace models.

Dynamo.Graph.Workspaces.LayoutExtensions.SaveLayoutGraphForNodeAutoComplete(Dynamo.Graph.Workspaces.WorkspaceModel,System.Collections.Generic.List{GraphLayout.Graph},System.Nullable{System.Guid})
This method pushes changes from the GraphLayout.Graph objects
back to the workspace models, but only for nodes placed by NodeAutocomplete.