Dynamo.Scheduler.TaskStateChangedEventHandler
Represents the method that will handle Dynamo.Scheduler.DynamoScheduler.TaskStateChanged events.
sender: The object where the event handler is attached.
e: The event data.