Dynamo.Graph.Nodes.DummyNode
DummyNode is used for tests or in case if node couldn't be loaded.

Dynamo.Graph.Nodes.DummyNode.#ctor
This function creates DummyNode.
DummyNode is used for tests or in case if node couldn't be loaded.

Dynamo.Graph.Nodes.DummyNode.#ctor(System.Int32,System.Int32,System.String,System.Xml.XmlElement,System.String,Dynamo.Graph.Nodes.DummyNode.Nature)
This function creates DummyNode with specified number of ports.
inputCount: Number of input ports
outputCount: Number of output ports
legacyName: Name of the node
originalElement: Xml node
legacyAssembly: Assembly of the node
nodeNature: Node can be Deprecated or Unresolved

Dynamo.Graph.Nodes.DummyNode.#ctor(System.String,System.Int32,System.Int32,System.String,Newtonsoft.Json.Linq.JObject)
This function creates DummyNode with specified number of ports.
id: Id of the original node
inputCount: Number of input ports
outputCount: Number of output ports
legacyAssembly: Assembly of the node
originalElement: Original JSON description of the node

Dynamo.Graph.Nodes.DummyNode.#ctor(System.String,System.Int32,System.Int32,System.String,System.String,Newtonsoft.Json.Linq.JObject)
This function creates DummyNode with specified number of ports.
id: Id of the original node
inputCount: Number of input ports
outputCount: Number of output ports
legacyAssembly: Assembly of the node
functionName: Function name of the node
originalElement: Original JSON description of the node

Dynamo.Graph.Nodes.DummyNode.#ctor(System.String,System.Int32,System.Int32,System.String,System.String,System.String,Newtonsoft.Json.Linq.JObject)
This function creates DummyNode with specified number of ports.
id: Id of the original node
inputCount: Number of input ports
outputCount: Number of output ports
legacyAssembly: Assembly of the node
functionName: Function name of the node
typeName: Type of the node
originalElement: Original JSON description of the node

Dynamo.Graph.Nodes.DummyNode.InputCount
Returns the number of input ports

Dynamo.Graph.Nodes.DummyNode.OutputCount
Returns the number of output ports

Dynamo.Graph.Nodes.DummyNode.LegacyNodeName
Returns the node name

Dynamo.Graph.Nodes.DummyNode.LegacyAssembly
Returns the node assembly

Dynamo.Graph.Nodes.DummyNode.TypeName
Type name of the node. This is property is only valid for NodeModel dummy nodes

Dynamo.Graph.Nodes.DummyNode.FunctionName
Returns the node's function name. This property is only valid for ZeroTouch dummy nodes

Dynamo.Graph.Nodes.DummyNode.LegacyFullName
Returns the original node DSFunction description or UI node type

Dynamo.Graph.Nodes.DummyNode.NodeNature
Node can be Deprecated or Unresolved

Dynamo.Graph.Nodes.DummyNode.OriginalNodeContent
Xml node

Dynamo.Graph.Nodes.DummyNode.OriginalXmlNodeContent
This property returns the originalXmlContent if it exists or returns null.

Dynamo.Graph.Nodes.DummyNode.GetNodeModelForDummyNode(System.String,Dynamo.Engine.LibraryServices,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,System.Boolean,Dynamo.Core.CustomNodeManager)
Deserializes and returns the nodeModel that is represented by the original content of this DummyNode.
If this node cannot be resolved, returns a new DummyNode
json:
libraryServices:
factory:
isTestMode:
manager:

Dynamo.Graph.Nodes.DummyNode.SetNodeViewDataOnResolvedNode(Dynamo.Graph.Nodes.NodeModel,Dynamo.Graph.Nodes.NodeModel)
This will set the dummy node's node view properties to the resolved node
dummyNode:
resolvedNode: