Dynamo.Graph.Connectors.ConnectorModel
Represents a connector between nodes. Connector can be a bezier or polyline Dynamo.Graph.Connectors.ConnectorType.

Dynamo.Graph.Connectors.ConnectorModel.IsHidden
IsHidden flag controlling the visibility of a connector

Dynamo.Graph.Connectors.ConnectorModel.Start
Returns start port model.

Dynamo.Graph.Connectors.ConnectorModel.End
Returns end port model.

Dynamo.Graph.Connectors.ConnectorModel.ConnectorPinModels
Collection of ConnectorPinModels associated with this Connector.

Dynamo.Graph.Connectors.ConnectorModel.AddPin(System.Double,System.Double)
Handles adding a new ConnectorPin to the collection of CollectorPins associated with this connector.
This function is called after deserializing and is responsible for reconstructing the pins corresponding
to each connector.
x: 'x' location on the canvas where this new pin will be added.
y: 'y' location on the canvas where this new pin will be added.

Dynamo.Graph.Connectors.ConnectorModel.AddPin(Dynamo.Graph.ConnectorPinModel)
Handles adding a new ConnectorPin to the collection of ConnectorPins associated with this connector.
This function is called after placing a new watch node in a connector and preserving pin locations during
the re-wire of affected connectors. It is also called during undo/redo operations.
to each connector.
connectorPinModel:  Previous ConnectorPinModel to be re-added to the collection of pins corresponding
to a connector.

Dynamo.Graph.Connectors.ConnectorModel.GUID
ID of the Connector, which is unique within the graph.

Dynamo.Graph.Connectors.ConnectorModel.Make(Dynamo.Graph.Nodes.NodeModel,Dynamo.Graph.Nodes.NodeModel,System.Int32,System.Int32,System.Nullable{System.Guid})
Factory method to create a connector.  Checks to make sure that the start and end ports are valid,
otherwise returns null.
start: The node having port where the connector starts
end: The node having port where the connector ends
startIndex: Port index in start
endIndex: Port index in end
guid: Identifier of the new connector
Returns: The valid connector model or null if the connector is invalid

Dynamo.Graph.Connectors.ConnectorModel.#ctor(Dynamo.Graph.Nodes.PortModel,Dynamo.Graph.Nodes.PortModel,System.Guid)
Constructor used when only the start and end Dynamo.Graph.Nodes.PortModel are known.
start: The start Dynamo.Graph.Nodes.PortModel.
end: The end Dynamo.Graph.Nodes.PortModel.
guid: The unique identifier for the Dynamo.Graph.Connectors.ConnectorModel.

Dynamo.Graph.Connectors.ConnectorModel.op_Equality(Dynamo.Graph.Connectors.ConnectorModel,Dynamo.Graph.Connectors.ConnectorModel)
Overload for EQUAL operator.

Dynamo.Graph.Connectors.ConnectorModel.op_Inequality(Dynamo.Graph.Connectors.ConnectorModel,Dynamo.Graph.Connectors.ConnectorModel)
Overload for NOT EQUAL operator.

Dynamo.Graph.Connectors.ConnectorModel.Delete
Delete the connector without raising port disconnection events.

Dynamo.Graph.Connectors.ConnectorModel.Deleted
Occurs when deleting connector.