Dynamo.Scheduler.Disposable
Implements IDisposable functionality.

Dynamo.Scheduler.Disposable.Create(System.Action)
Constructs a new disposable that calls the delegate when disposed
disposeAction: An action that runs when this object is disposed
Returns: New disposable object