Dynamo.Models.DynamoModel.MakeConnectionCommand
A command used to create a connection.

Dynamo.Models.DynamoModel.MakeConnectionCommand.#ctor(System.String,System.Int32,Dynamo.Graph.Nodes.PortType,Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode)
nodeId:
portIndex:
portType:
mode:

Dynamo.Models.DynamoModel.MakeConnectionCommand.#ctor(System.Guid,System.Int32,Dynamo.Graph.Nodes.PortType,Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode)
nodeId:
portIndex:
portType:
mode:

Dynamo.Models.DynamoModel.MakeConnectionCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid},System.Int32,Dynamo.Graph.Nodes.PortType,Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode)
nodeId:
portIndex:
portType:
mode: