Dynamo.Models.DynamoModel.ForceRunCancelCommand
A command used to force cancellation of execution.

Dynamo.Models.DynamoModel.ForceRunCancelCommand.#ctor(System.Boolean,System.Boolean)
showErrors: Should errors be shown?
cancelRun: True to cancel execution. False to execute.