Dynamo.Scheduler.DynamoScheduler
This class represents Dynamo scheduler. All the tasks are scheduled on the scheduler. Also, these tasks runs async.

Dynamo.Scheduler.DynamoScheduler.TaskStateChanged
Event that is raised when the state of an AsyncTask is changed.
The state of an AsyncTask changes when it is scheduled, discarded,
executed or completed. Note that this event is raised in the context
of ISchedulerThread, any access to UI components or collections in
WorkspaceModel (e.g. Nodes, Connectors, etc.) should be dispatched
for execution on the UI thread.

Dynamo.Scheduler.DynamoScheduler.NextTimeStamp
AsyncTask base class calls this to obtain the new time-stamp value.

Dynamo.Scheduler.DynamoScheduler.Shutdown
Call this method to properly shutdown the scheduler and its associated
ISchedulerThread. This call will be blocked until the ISchedulerThread
terminates. Note that the implementation of ISchedulerThread may or may
not choose to handle all the remaining AsyncTask in queue when shutdown
happens -- DynamoScheduler ensures the tasks in queue are cleared when
this call returns.

Dynamo.Scheduler.DynamoScheduler.ScheduleForExecution(Dynamo.Scheduler.AsyncTask)
Callers of this method create an instance of AsyncTask derived
class and call this method to schedule the task for execution.
asyncTask: The task to execute asynchronously.

Dynamo.Scheduler.DynamoScheduler.ProcessMode
Flag determining whether or not the scheduled task will be
processed immediately or not.

Dynamo.Scheduler.DynamoScheduler.ProcessNextTask(System.Boolean)
An ISchedulerThread implementation calls this method so scheduler
starts to process the next task in the queue, if there is any. Note
that this method is meant to process only one task in queue. The
implementation of ISchedulerThread is free to call this method again
in a fashion that matches its task fetching behavior.
waitIfTaskQueueIsEmpty: This parameter is only used if
the task queue is empty at the time this method is invoked. When the
task queue becomes empty, setting this to true will cause this call
to block until either the next task becomes available, or when the
scheduler is requested to shutdown.
Returns: This method returns true if the task queue is not empty, or
false otherwise. Note that this method returns false when scheduler
begins to shutdown, even when the task queue is not empty.

Dynamo.Scheduler.DynamoScheduler.HasPendingTasks
Returns true if task queue is not empty.

Dynamo.Scheduler.DynamoScheduler.CompactTaskQueue
This method is called when ISchedulerThread calls ProcessNextTask
method to process next available task in queue. It is only called
if the task queue was updated (one or more AsyncTask scheduled)
before ISchedulerThread picks up the next task.
Returns: Returns a list of AsyncTask objects that were dropped, if
any, during task queue compact. The return list can be empty but it
will never be null.