Dynamo.Graph.Nodes.ZeroTouch.DSFunction
DesignScript function node. All functions from DesignScript share the
same function node but internally have different procedure.

Dynamo.Graph.Nodes.ZeroTouch.DSFunction.NodeType
The NodeType property provides a name which maps to the
server type for the node. This property should only be
used for serialization.

Dynamo.Graph.Nodes.ZeroTouch.DSFunction.IsInputNode
Indicates whether Node is input or not.
Used to bind visibility of UI for user selection.

Dynamo.Graph.Nodes.ZeroTouch.DSFunction.#ctor(Dynamo.Engine.FunctionDescriptor)
Initializes a new instance of the Dynamo.Graph.Nodes.ZeroTouch.DSFunction class.
description: Function descritor.