Dynamo.Graph.Nodes.DoNotLoadOnPlatformsAttribute
The DoNotLoadOnPlatforms attribute allows the node implementer
to define an array of contexts.

Dynamo.Graph.Nodes.DoNotLoadOnPlatformsAttribute.#ctor(System.String[])
Creates DoNotLoadOnPlatformsAttribute with restricted contexts.
values:

Dynamo.Graph.Nodes.DoNotLoadOnPlatformsAttribute.Values
Restricted contexts, i.e. contexts in which node won't be loaded.
E.g. Revit 2014