Dynamo.Graph.Nodes.VariableInputNodeController
This is a helper class that processess inputs of VariableInputNode.

Dynamo.Graph.Nodes.VariableInputNodeController.GetInputIndexFromModel
Fetches the index number to use for the next port.

Dynamo.Graph.Nodes.VariableInputNodeController.RemoveInputFromModel
Removes an input from this node. Called when the '-' button is clicked.

Dynamo.Graph.Nodes.VariableInputNodeController.AddInputToModel
Adds an input to this node. Called when the '+' button is clicked.

Dynamo.Graph.Nodes.VariableInputNodeController.SetNumInputs(System.Int32)
Set the number of inputs.
numInputs:

Dynamo.Graph.Nodes.VariableInputNodeController.OnBuilt
This is called when a node is built.

Dynamo.Graph.Nodes.VariableInputNodeController.SerializeInputCount(System.Xml.XmlElement,System.Int32)
Serializes the input count of a VariableInputNode to Xml.
nodeElement:
amount:

Dynamo.Graph.Nodes.VariableInputNodeController.SerializeCore(System.Xml.XmlElement,Dynamo.Graph.SaveContext)
Serializes object
element: xml node
context: save context

Dynamo.Graph.Nodes.VariableInputNodeController.DeserializeCore(System.Xml.XmlElement,Dynamo.Graph.SaveContext)
Deserializes object
element: xml node
context: save context