Dynamo.Graph.Workspaces.WorkspaceModel.DelayedGraphExecution
This class enables the delay of graph execution.
Use instances of this class to specify a code scope in which you want graph execution to be delayed.
Class is thread safe, although behavior is not well defined.
Nested instance of this class do not have a well defined behavior.