Dynamo.Logging.DynamoAnalyticsClient
Dynamo specific implementation of IAnalyticsClient

Dynamo.Logging.DynamoAnalyticsClient.ReportingAnalytics
Return if Analytics Client is allowed to send any analytics information (Google, ADP etc.)

Dynamo.Logging.DynamoAnalyticsClient.ReportingGoogleAnalytics
Return if Google Analytics Client is allowed to send analytics info

Dynamo.Logging.DynamoAnalyticsClient.ReportingADPAnalytics
Return if ADP Analytics Client is allowed to send analytics info

Dynamo.Logging.DynamoAnalyticsClient.ReportingUsage
Return if Analytics Client is allowed to send instrumentation info

Dynamo.Logging.DynamoAnalyticsClient.#ctor(Dynamo.Models.DynamoModel)
Constructs DynamoAnalyticsClient with given DynamoModel
dynamoModel: DynamoModel

Dynamo.Logging.DynamoAnalyticsClient.Start
Starts the client when DynamoModel is created. This method initializes
the Analytics service and application life cycle start is tracked.