Dynamo.Graph.Nodes.Utilities
Service class for formatting node text data

Dynamo.Graph.Nodes.Utilities.Ellipsis(System.String,System.Int32)
Returns cut version of a given System.String value
value: System.String value to cut
desiredLength: Max allowed number of symbols
Returns: Cut version of a given System.String value

Dynamo.Graph.Nodes.Utilities.PreprocessTypeName(System.String)
This method patches the fullyQualifiedName of a given type. It
updates the given name to its newer form (i.e. "Dynamo.Graph.Nodes.Xyz")
if it matches the older form (e.g. "Dynamo.Elements.Xyz").
The method also attempts to update "XYZ/UV" convention to
"Xyz/Uv" to comply with the new Dynamo naming convention.
fullyQualifiedName: A fully qualified name. An example
of this would be "Dynamo.Elements.dynNode".
Returns: The processed fully qualified name. For an example, the
name "Dynamo.Elements.UV" will be returned as "Dynamo.Graph.Nodes.Uv".

Dynamo.Graph.Nodes.Utilities.TypedParametersToString(Dynamo.Engine.FunctionDescriptor,System.String)
This method returns a name for the icon based on name of the node.
descriptor: Function descriptor, that contains all info about node.
overridePrefix:
overridePrefix is used as default value for generating node icon name.
If overridePrefix is empty, it uses QualifiedName property.
e.g. Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin

Dynamo.Graph.Nodes.Utilities.ShortenCategoryName(System.String)
Returns formatted category name replacing delimeters and
if category is too long leaving only first and last subcategories.
fullCategoryName: Full category name
including all parent categories up to root one.
Returns: Formatted category name.

Dynamo.Graph.Nodes.Utilities.SetDocumentXmlPath(System.Xml.XmlDocument,System.String)
Call this method to associate/remove the target file path with/from
the given XmlDocument object.
document: The XmlDocument with which the target file
path is to be associated. This parameter cannot be null.
targetFilePath: The target file path to be associated
with the given XmlDocument. If this parameter is null or an empty
string, then any target file path that was previously associated
will be removed.

Dynamo.Graph.Nodes.Utilities.GetDocumentXmlPath(System.Xml.XmlDocument)
Call this method to retrieve the associated target file path from
the given XmlDocument object. An exception will be thrown if such
target file path was never associated with the XmlDocument object.
document: The XmlDocument object from which the
associated target file path is to be retrieved.
Returns: Returns the associated target file path.

Dynamo.Graph.Nodes.Utilities.LoadTraceDataFromXmlDocument(System.Xml.XmlDocument)
Call this method to load serialized node-data-list pairs (through a
prior call to SaveTraceDataToXmlDocument) from a given XmlDocument.
document: The XmlDocument from which serialized node-
data-list pairs are to be deserialized.
Returns: Returns a dictionary of deserialized node-data-list pairs
loaded from the given XmlDocument.

Dynamo.Graph.Nodes.Utilities.MakeRelativePath(System.String,System.String)
Call this method to compute the relative path of a subject path
relative to the given base path.
basePath: The base path which relative path is to be
computed from. This base path does not need to point to a valid file
on disk, but it cannot be an empty string.
subjectPath: The subject path of which the relative
path is to be computed. If this path is not empty but does not
represent a valid path string, a UriFormatException is thrown.
Returns: Returns the path of the subject relative to the given base
path.

Dynamo.Graph.Nodes.Utilities.MakeAbsolutePath(System.String,System.String)
Call this method to form the absolute path to target pointed to by
relativePath parameter. The absolute path is formed by computing both
base path and the relative path.
basePath: The base path from which the absolute path is
to be computed. This argument cannot be null or empty.
relativePath: The relative path to the target. This
argument cannot be null or empty.
Returns: Returns the absolute path.

Dynamo.Graph.Nodes.Utilities.WrapText(System.String,System.Int32)
Returns words from text, e.g. ImportFromCSV to ("Import","From","CSV")
text: incoming string
maxCharacters: Max number of characters per row

Dynamo.Graph.Nodes.Utilities.ReduceRowCount(System.Collections.Generic.List{System.String},System.Int32)
Reduces the number of rows, based on the entries inside rows parameter.
E.g. rows = { "Insert", "Day", "Of", "Week", "Here" }, maxRows == 3
Result { "Insert", "Day", "Of Week Here" }
rows: Incoming rows
maxRows: Max number of rows

Dynamo.Graph.Nodes.Utilities.TruncateRows(System.Collections.Generic.IEnumerable{System.String},System.Int32)
Truncate each entry in the given "rows" to a maximum of "maxCharacters".
For examples, given that "maxCharacters" equals to "8":
{ "Surface", "Analysis Data" } => { "Surface", "..s Data" }
{ "By", "Geometry", "Coordinate", "System" } => { "By", "Geometry", "Coordi..", "System" }
{ "By Geometry", "Coordinate System" } => { "By Geo..", "..System" }
rows: Incomming rows
maxCharacters: Max number characters per row

Dynamo.Graph.Nodes.Utilities.NormalizeAsResourceName(System.String)
Returns formatted System.String value
leaving only letters, numbers, dots and dashes.
resource: System.String value to format
Returns: Formatted System.String value

Dynamo.Graph.Nodes.Utilities.GetFunctionDescriptorIconName(Dynamo.Engine.FunctionDescriptor)
Returns the icon path for a ZeroTouch node
Returns: