Dynamo.Properties.Resources
A strongly-typed resource class, for looking up localized strings, etc.

Dynamo.Properties.Resources.ResourceManager
Returns the cached ResourceManager instance used by this class.

Dynamo.Properties.Resources.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Dynamo.Properties.Resources.ArggOKButton
Looks up a localized string similar to Arrrrg, ok.

Dynamo.Properties.Resources.ArgumentNullException
Looks up a localized string similar to Value cannot be null.
Parameter name: {0}.

Dynamo.Properties.Resources.Autocomplete
Looks up a localized string similar to Autocomplete.

Dynamo.Properties.Resources.AutocompleteSearchTextBlockText
Looks up a localized string similar to Search Autocomplete Results.

Dynamo.Properties.Resources.BackUpOriginalFileMessage
Looks up a localized string similar to Original file '{0}' gets backed up at '{1}'.

Dynamo.Properties.Resources.BackupSavedMsg
Looks up a localized string similar to Backup file is saved.

Dynamo.Properties.Resources.BadIdentifierSyntax
Looks up a localized string similar to Bad identifier syntax: "{0}".

Dynamo.Properties.Resources.BadRangeSyntax
Looks up a localized string similar to Bad range syntax: not of format \"start..end[..(increment|#count)]\".

Dynamo.Properties.Resources.BuildSublistsDescription
Looks up a localized string similar to Build sublists from a list using DesignScript range syntax..

Dynamo.Properties.Resources.ButtonDownloadLastest
Looks up a localized string similar to Download latest version.

Dynamo.Properties.Resources.ButtonProcess
Looks up a localized string similar to Proceed anyway.

Dynamo.Properties.Resources.CancelButton
Looks up a localized string similar to Cancel.

Dynamo.Properties.Resources.CannotHave0Step
Looks up a localized string similar to Can't have 0 step..

Dynamo.Properties.Resources.CannotOpenFile
Looks up a localized string similar to Your file cannot be opened.

Dynamo.Properties.Resources.ClearingWorkflow
Looks up a localized string similar to Clearing workflow....

Dynamo.Properties.Resources.ClearingWorkSpace
Looks up a localized string similar to Clearing workspace....

Dynamo.Properties.Resources.CodeBlockDescription
Looks up a localized string similar to Allows for DesignScript code to be authored directly.

Dynamo.Properties.Resources.CodeBlockNodeDescription
Looks up a localized string similar to Allows for DesignScript code to be authored directly.

Dynamo.Properties.Resources.CodeBlockSearchTags
Looks up a localized string similar to codeblock;.

Dynamo.Properties.Resources.CodeBlockTempIdentifierOutputLabel
Looks up a localized string similar to Value of expression at line {0}.

Dynamo.Properties.Resources.ComposeFunctionNodeDescription
Looks up a localized string similar to Composes two single parameter functions into one function..

Dynamo.Properties.Resources.ComposeFunctionPortDataFunctionToolTip
Looks up a localized string similar to A Function.

Dynamo.Properties.Resources.ComposeFunctionPortDataResultToolTip
Looks up a localized string similar to Composed function: g(f(x)).

Dynamo.Properties.Resources.CoreLibraryLoadFailureForBlockedAssembly
Looks up a localized string similar to {0}
This assembly is likely blocked. Try restarting Dynamo after unblocking this assembly and all other core assemblies that might be blocked. If you are running a downloaded DynamoSandbox build that is extracted from a .zip file, try using 7zip to extract the Dynamo binaries and try again..

Dynamo.Properties.Resources.CoreLibraryLoadFailureMessageBoxTitle
Looks up a localized string similar to Core library load failure.

Dynamo.Properties.Resources.CouldNotCompressFile
Looks up a localized string similar to Could not compress file.  Is the file in use?.

Dynamo.Properties.Resources.CouldNotGetLatestBuild
Looks up a localized string similar to Couldn't get the latest build from S3.

Dynamo.Properties.Resources.CouldNotGetUpdateData
Looks up a localized string similar to Couldn't get update data from {0}.

Dynamo.Properties.Resources.CouldNotLoadTypes
Looks up a localized string similar to Could not load types..

Dynamo.Properties.Resources.CouldNotRepairOneNodeHoles
Looks up a localized string similar to Could not repair 1-node holes.

Dynamo.Properties.Resources.CreatingConnectorError
Looks up a localized string similar to ERROR : Could not create connector between {0} and {1}..

Dynamo.Properties.Resources.CustomNodeCouldNotBeInitialized
Looks up a localized string similar to Custom node \"{0}\" could not be initialized..

Dynamo.Properties.Resources.CustomNodeDesciption
Looks up a localized string similar to Instance of a Custom Node.

Dynamo.Properties.Resources.CustomNodeFolderLoadFailure
Looks up a localized string similar to Failed to load custom node directory. Do you have permission to access {0}?.

Dynamo.Properties.Resources.CustomNodeNotLoaded
Looks up a localized string similar to Custom node definition is not loaded! href=CustomNodeNotLoaded.html.

Dynamo.Properties.Resources.DefaultCustomNodeCategory
Looks up a localized string similar to Custom nodes.

Dynamo.Properties.Resources.DefaultHomeWorkspaceName
Looks up a localized string similar to Home.

Dynamo.Properties.Resources.DefaultValue
Looks up a localized string similar to Default value.

Dynamo.Properties.Resources.DefaultValueDisabled
Looks up a localized string similar to (disabled).

Dynamo.Properties.Resources.DescriptionResource1
Looks up a localized string similar to some description.

Dynamo.Properties.Resources.DirectoryNotFound
Looks up a localized string similar to Directory not found : {0}.

Dynamo.Properties.Resources.DisplayEngineFailureMessageDescription
Looks up a localized string similar to The virtual machine that powers Dynamo is experiencing some unexpected errors internally and is likely having great difficulties pulling itself together. It is recommended that you save your work now and reload the file. Giving the Dynamo VM a new lease of life can potentially make it feel happier and behave better.
If you don't mind, it would be helpful for you to send us your file. That will make it quicker for us to get these issues fixed..

Dynamo.Properties.Resources.DllLoadException
Looks up a localized string similar to Dll Load Exception:.

Dynamo.Properties.Resources.DownloadLatestButton
Looks up a localized string similar to Download latest version.

Dynamo.Properties.Resources.DSFunctionNodeDescription
Looks up a localized string similar to DesignScript Builtin Functions.

Dynamo.Properties.Resources.DulicatedPackage
Looks up a localized string similar to A duplicate of the package called {0} was found at {1}.  Ignoring it..

Dynamo.Properties.Resources.DummyNodeDescription
Looks up a localized string similar to This is an obsolete node.

Dynamo.Properties.Resources.DuplicatedModelGuidError
Looks up a localized string similar to The map already contains a model with this id, the id must be unique for the workspace that is currently being deserialized: {0}.

Dynamo.Properties.Resources.DuplicatedNewerPackage
Looks up a localized string similar to A newer version of the package called {0} version {2} was found at {1} with version {3}. The newer version has been ignored..

Dynamo.Properties.Resources.DuplicatedOlderPackage
Looks up a localized string similar to An older version of the package called {0} version {2} was found at {1} with version {3}. The older version has been ignored..

Dynamo.Properties.Resources.DuplicateMigrationTypeRegistered
Looks up a localized string similar to Duplicate migration type registered for {0}.

Dynamo.Properties.Resources.DynamoUpToDate
Looks up a localized string similar to Dynamo is up to date..

Dynamo.Properties.Resources.ElapsedWhenLoadingXml
Looks up a localized string similar to {0} elapsed for loading xml..

Dynamo.Properties.Resources.EvaluationCompleted
Looks up a localized string similar to Evaluation completed in {0}.

Dynamo.Properties.Resources.ExceptionEncountered
Looks up a localized string similar to Exception encountered scanning the package directory at {0}.

Dynamo.Properties.Resources.FailedToGetMirrorVariable
Looks up a localized string similar to Failed to get mirror for variable:  {0}; reason: {1}..

Dynamo.Properties.Resources.FailedToHandleReadyEvent
Looks up a localized string similar to Failed to call Ready() in extension: .

Dynamo.Properties.Resources.FailedToLoad
Looks up a localized string similar to Failed to load {0}\n, Exception: {1}.

Dynamo.Properties.Resources.FailedToLoadCustomNode
Looks up a localized string similar to Failed to load custom node: {0}.  Replacing with proxy custom node..

Dynamo.Properties.Resources.FailedToLoadHeader
Looks up a localized string similar to ERROR: The header for the custom node at {0} failed to load.  It will be left out of search..

Dynamo.Properties.Resources.FailedToLoadLibrary
Looks up a localized string similar to Failed to load library: {0}.

Dynamo.Properties.Resources.FailedToLoadType
Looks up a localized string similar to Failed to load type from {0}. The type was {1}..

Dynamo.Properties.Resources.FailedToSave
Looks up a localized string similar to Failed to save {0}\n, Exception: {1}.

Dynamo.Properties.Resources.FileBackUpLocation
Looks up a localized string similar to Original file '{0}' gets backed up at '{1}'.

Dynamo.Properties.Resources.FileCannotBeOpened
Looks up a localized string similar to Your file cannot be opened..

Dynamo.Properties.Resources.FileNotOpenedCorrectly
Looks up a localized string similar to Your file may not open correctly.

Dynamo.Properties.Resources.FunctionDefinitionOverwrittenMessage
Looks up a localized string similar to Attempting to load customNode {0} loaded by package {1}, but a previous definition named {2} exists with no associated package. The new customNode definition has been loaded, but Dynamo may be in an unstable state, please avoid loading multiple custom nodes with the id..

Dynamo.Properties.Resources.FunctionDescription
Looks up a localized string similar to Instance of a Custom Node.

Dynamo.Properties.Resources.FunctionNodeDescription
Looks up a localized string similar to DesignScript Builtin Functions.

Dynamo.Properties.Resources.FutureFileDescription
Looks up a localized string similar to Your file '{0}' was created in future version '{1}' and may not open correctly in your installed version of Dynamo '{2}'.

Dynamo.Properties.Resources.FutureFileSummary
Looks up a localized string similar to Your file may not open correctly.

Dynamo.Properties.Resources.FutureFileTitle
Looks up a localized string similar to Future File.

Dynamo.Properties.Resources.GoodByeLog
Looks up a localized string similar to Goodbye.

Dynamo.Properties.Resources.GroupDefaultText
Looks up a localized string similar to <Double click here to edit group description>.

Dynamo.Properties.Resources.GroupNameDefaultText
Looks up a localized string similar to <Double click here to edit group title>.

Dynamo.Properties.Resources.HeaderAction
Looks up a localized string similar to ACTIONS.

Dynamo.Properties.Resources.HeaderCreate
Looks up a localized string similar to CREATE.

Dynamo.Properties.Resources.HeaderQuery
Looks up a localized string similar to QUERY.

Dynamo.Properties.Resources.IdentifiersNotFound
Looks up a localized string similar to No identifiers found..

Dynamo.Properties.Resources.IncompatibleOfFileAndDynamo
Looks up a localized string similar to Your file '{0}' of version '{1}' cannot be opened by this version of Dynamo ({2}).

Dynamo.Properties.Resources.IncorrectlyFormattedNodeLibraryDisplay
Looks up a localized string similar to This is the incorrectly formatted library name:.

Dynamo.Properties.Resources.IncorrectlyFormattedNodeLibraryWarning
Looks up a localized string similar to Incorrectly formatted package node library encountered, this may result in a package assembly not being loaded!.

Dynamo.Properties.Resources.IncorrectVersionToOpenFile
Looks up a localized string similar to Your file '{0}' was created in future version '{1}' and may not open correctly in your installed version of Dynamo '{2}'.

Dynamo.Properties.Resources.InputLabel
Looks up a localized string similar to INPUT.

Dynamo.Properties.Resources.InputNodeDescription
Looks up a localized string similar to A function parameter, use with custom nodes.

Dynamo.Properties.Resources.InputNodeSearchTags
Looks up a localized string similar to variable;argument;parameter.

Dynamo.Properties.Resources.InputPortAlternativeName
Looks up a localized string similar to input.

Dynamo.Properties.Resources.InvalidCustomNodeFolderWarning
Looks up a localized string similar to The folder '{0}' does not exist.

Dynamo.Properties.Resources.InvalidInputSymbolCustomNodeWarning
Looks up a localized string similar to This custom node contains an invalid input. Please fix the input before saving the custom node..

Dynamo.Properties.Resources.InvalidInputSymbolErrorMessage
Looks up a localized string similar to This input symbol is not currently valid, and cannot be saved until it is fixed. Valid inputs take the form:
name : type = defaultValue
The input name should be a valid variable name, without spaces. An input type and default value are optional..

Dynamo.Properties.Resources.InvalidInputSymbolWarningMessage
Looks up a localized string similar to This custom node currently contains some invalid inputs, and cannot be saved until the inputs are fixed. If the custom node is saved using SaveAs, the invalid inputs will revert to generic inputs. Valid inputs take the form:
name : type = defaultValue
The input name should be a valid variable name, without spaces. An input type and default value are optional..

Dynamo.Properties.Resources.InvalidInputSymbolWarningShortMessage
Looks up a localized string similar to This custom node cannot be saved until invalid inputs are removed or fixed..

Dynamo.Properties.Resources.InvalidInputSymbolWarningTitle
Looks up a localized string similar to Custom Node Contains Invalid Inputs and Cannot Be Saved..

Dynamo.Properties.Resources.InvalidLibraryFormat
Looks up a localized string similar to Invalid library format..

Dynamo.Properties.Resources.InvalidPackageVersion
Looks up a localized string similar to The version of the package called {0} found at {1} is invalid (version: "{2}"). Ignoring it..

Dynamo.Properties.Resources.InvalidStartOrEndOfRange
Looks up a localized string similar to The start or end of a range is greater than the number of available elements in the list..

Dynamo.Properties.Resources.LibraryBuildError
Looks up a localized string similar to Build error for library: {0}.

Dynamo.Properties.Resources.LibraryHasBeenLoaded
Looks up a localized string similar to Library {0} has been loaded..

Dynamo.Properties.Resources.LibraryIsDumped
Looks up a localized string similar to Library is dumped to \"{0}\"..

Dynamo.Properties.Resources.LibraryLoadFailureForBlockedAssembly
Looks up a localized string similar to {0}
This assembly is likely blocked. Try importing it again after unblocking the assembly..

Dynamo.Properties.Resources.LibraryLoadFailureMessageBoxTitle
Looks up a localized string similar to Library load failure.

Dynamo.Properties.Resources.LibraryPathCannotBeFound
Looks up a localized string similar to Cannot find library path: {0}..

Dynamo.Properties.Resources.LoadingNodeDefinition
Looks up a localized string similar to Loading node definition for "{0}" from: {1}.

Dynamo.Properties.Resources.LocateInDisk
Looks up a localized string similar to Locate in Disk...

Dynamo.Properties.Resources.MalformedHeaderPackage
Looks up a localized string similar to {0} contains a package with a malformed header.  Ignoring it..

Dynamo.Properties.Resources.MessageCustomNodePackageFailedToLoad
Looks up a localized string similar to {1} cannot be loaded.
Installing it will conflict with one or more node definitions that already exist in {0}, which is currently loaded.
To install {1}, Dynamo needs to first uninstall {0}.
Restart Dynamo to complete the uninstall..

Dynamo.Properties.Resources.MissingXmlTagConsoleMessage
Looks up a localized string similar to {0} is missing some XML documentation tags..

Dynamo.Properties.Resources.ModelNotFoundError
Looks up a localized string similar to UpdateModelValue: Model not found.

Dynamo.Properties.Resources.MoreButtonTextFormat
Looks up a localized string similar to SHOW MORE ({0}).

Dynamo.Properties.Resources.MoveLabel
Looks up a localized string similar to Move.

Dynamo.Properties.Resources.NewNoteString
Looks up a localized string similar to New Note.

Dynamo.Properties.Resources.NodeDeprecatedMsg
Looks up a localized string similar to Node '{0}' is now deprecated..

Dynamo.Properties.Resources.NodeInformationalStateShowAllErrors
Looks up a localized string similar to Show all errors.

Dynamo.Properties.Resources.NodeNotResolvedMsg
Looks up a localized string similar to Node '{0}' cannot be resolved..

Dynamo.Properties.Resources.NodeOfTypeDeprecatedMsg
Looks up a localized string similar to Node of type '{0}',from assembly '{1}', is now deprecated..

Dynamo.Properties.Resources.NodeOfTypeNotResolvedMsg
Looks up a localized string similar to Node of type '{0}', from assembly '{1}', cannot be resolved..

Dynamo.Properties.Resources.NodeProblemEncountered
Looks up a localized string similar to Whilst preparing to run, this node encountered a problem. Please talk to the creators of the node, and give them this message:.

Dynamo.Properties.Resources.NoDescriptionAvailable
Looks up a localized string similar to No description available.

Dynamo.Properties.Resources.NodeUnhandledMsg
Looks up a localized string similar to Unhandled 'DummyNode.NodeNature' value: {0}.

Dynamo.Properties.Resources.NoHeaderPackage
Looks up a localized string similar to {0} contains a package without a header.  Ignoring it..

Dynamo.Properties.Resources.NoMatchesFound
Looks up a localized string similar to No matches found.

Dynamo.Properties.Resources.NoneLinterDescriptorName
Looks up a localized string similar to None.

Dynamo.Properties.Resources.NoneString
Looks up a localized string similar to none.

Dynamo.Properties.Resources.NothingIsSelectedWarning
Looks up a localized string similar to Nothing is selected. href=NothingIsSelectedWarning.html.

Dynamo.Properties.Resources.NumberNodeDescription
Looks up a localized string similar to Creates a number..

Dynamo.Properties.Resources.ObsoleteFileDescription
Looks up a localized string similar to Your file '{0}' of version '{1}' cannot be opened by this version of Dynamo ({2}).

Dynamo.Properties.Resources.ObsoleteFileTitle
Looks up a localized string similar to Obsolete File.

Dynamo.Properties.Resources.OKButton
Looks up a localized string similar to OK.

Dynamo.Properties.Resources.OpeningHomeWorkspace
Looks up a localized string similar to Opening home workspace {0}....

Dynamo.Properties.Resources.OpenWorkbenchError
Looks up a localized string similar to There was an error opening the workbench..

Dynamo.Properties.Resources.OpenWorkspaceError
Looks up a localized string similar to There was an error opening the workspace..

Dynamo.Properties.Resources.OutputLabel
Looks up a localized string similar to OUTPUT.

Dynamo.Properties.Resources.OutputNodeDescription
Looks up a localized string similar to A function output, use with custom nodes.

Dynamo.Properties.Resources.OutputPortAlternativeName
Looks up a localized string similar to output.

Dynamo.Properties.Resources.PackageEmpty
Looks up a localized string similar to The package was found to be empty and was not installed..

Dynamo.Properties.Resources.PackageLoadFailureForBlockedAssembly
Looks up a localized string similar to {0}
This package likely contains an assembly that is blocked. You will need to load the package again after unblocking the assembly. Restart Dynamo to reload the package..

Dynamo.Properties.Resources.PackageManagerPackageAlreadyExists
Looks up a localized string similar to A package with the given name already exists..

Dynamo.Properties.Resources.PackageManagerUserIsNotAMaintainer
Looks up a localized string similar to The current user, '{0}', is not a maintainer of the package '{1}'..

Dynamo.Properties.Resources.PackageStateError
Looks up a localized string similar to Error.

Dynamo.Properties.Resources.PackageStateErrorTooltip
Looks up a localized string similar to Unloaded.
This package has not been loaded due to an unexpected error..

Dynamo.Properties.Resources.PackageStateLoaded
Looks up a localized string similar to Loaded.

Dynamo.Properties.Resources.PackageStateLoadedTooltip
Looks up a localized string similar to Loaded.
This package is loaded and ready to be used..

Dynamo.Properties.Resources.PackageStatePendingUnload
Looks up a localized string similar to Scheduled to be unloaded.

Dynamo.Properties.Resources.PackageStatePendingUnloadTooltip
Looks up a localized string similar to Scheduled to be unloaded.
This package will be unloaded after the next Dynamo restart..

Dynamo.Properties.Resources.PackageStateUnloaded
Looks up a localized string similar to Unloaded.

Dynamo.Properties.Resources.PackageStateUnloadedTooltip
Looks up a localized string similar to Unloaded.
This package has not been loaded because another conflicting package was loaded before it..

Dynamo.Properties.Resources.PackageTooLarge
Looks up a localized string similar to The package is too large!  The package must be less than 15 MB!.

Dynamo.Properties.Resources.PathNotRegconizableAsStableOrDailyBuild
Looks up a localized string similar to The specified file path is not recognizable as a stable or a daily build.

Dynamo.Properties.Resources.PortDataFunctionOutputToolTip
Looks up a localized string similar to function output.

Dynamo.Properties.Resources.PortDataInputToolTip
Looks up a localized string similar to Input #{0}.

Dynamo.Properties.Resources.PortDataOutputToolTip
Looks up a localized string similar to Output #{0}.

Dynamo.Properties.Resources.PortDataParameterToolTip
Looks up a localized string similar to parameter.

Dynamo.Properties.Resources.PortDataPathToFileToolTip
Looks up a localized string similar to Path to the file.

Dynamo.Properties.Resources.PortDataReturnValueToolTip
Looks up a localized string similar to return value.

Dynamo.Properties.Resources.PortDataSymbolToolTip
Looks up a localized string similar to Symbol.

Dynamo.Properties.Resources.PortDataVariableToolTip
Looks up a localized string similar to variable.

Dynamo.Properties.Resources.PortsNameDescriptionDoNotEqualWarningMessage
Looks up a localized string similar to Number of port names does not equal number of port descriptions..

Dynamo.Properties.Resources.Preview3DOutageTitle
Looks up a localized string similar to 3D preview has been deactivated.

Dynamo.Properties.Resources.ProceedButton
Looks up a localized string similar to Proceed anyway.

Dynamo.Properties.Resources.PythonTemplateAppData
Looks up a localized string similar to Python template loaded from AppData.

Dynamo.Properties.Resources.PythonTemplateDefaultFile
Looks up a localized string similar to Python template set to default..

Dynamo.Properties.Resources.PythonTemplateDefinedByHost
Looks up a localized string similar to Python template set by host integrator.

Dynamo.Properties.Resources.PythonTemplateUserFile
Looks up a localized string similar to Python template loaded from DynamoSettings.xml path.

Dynamo.Properties.Resources.RangeEndCouldNotBeParsed
Looks up a localized string similar to Range end could not be parsed..

Dynamo.Properties.Resources.RangeOrApprIdentifierAlrUsed
Looks up a localized string similar to Cannot use range or approx. identifier on increment field when one has already been used to specify a count..

Dynamo.Properties.Resources.RangePortDataAmountToolTip
Looks up a localized string similar to Amount of numbers or letters in the sequence
Default value: 10.

Dynamo.Properties.Resources.RangePortDataEndToolTip
Looks up a localized string similar to Number or letter to end the sequence at
Default value: 9.

Dynamo.Properties.Resources.RangePortDataSeqToolTip
Looks up a localized string similar to New list of type: var[]..[].

Dynamo.Properties.Resources.RangePortDataStartToolTip
Looks up a localized string similar to Number or letter to start the sequence at
Default value: 0.

Dynamo.Properties.Resources.RangePortDataStepToolTip
Looks up a localized string similar to Space between numbers or letters
Default value: 1.

Dynamo.Properties.Resources.RangeStepCouldNotBeParsed
Looks up a localized string similar to Range step could not be parsed..

Dynamo.Properties.Resources.RangeValuesGreaterThanZero
Looks up a localized string similar to Range values must be greater than zero..

Dynamo.Properties.Resources.RemoveLabel
Looks up a localized string similar to Remove.

Dynamo.Properties.Resources.RequestingVersionUpdate
Looks up a localized string similar to Requesting version update info....

Dynamo.Properties.Resources.ResourcePropertyIsNotStringTypeMessage
Looks up a localized string similar to Resource Property is not String Type.

Dynamo.Properties.Resources.ResourceTypeDoesNotHavePropertyMessage
Looks up a localized string similar to Resource Type does not have Property.

Dynamo.Properties.Resources.RunTypeToolTipAutomatically
Looks up a localized string similar to Run whenever an input to the graph is updated..

Dynamo.Properties.Resources.RunTypeToolTipManually
Looks up a localized string similar to Run when you click the Run button..

Dynamo.Properties.Resources.RunTypeToolTipPeriodicallyDisabled
Looks up a localized string similar to Run Periodic is only available when there are nodes in the graph that support periodic update..

Dynamo.Properties.Resources.RunTypeToolTipPeriodicallyEnabled
Looks up a localized string similar to Run at the specified interval..

Dynamo.Properties.Resources.SavingInProgress
Looks up a localized string similar to Saving {0} ....

Dynamo.Properties.Resources.SearchTextBlockText
Looks up a localized string similar to Search.

Dynamo.Properties.Resources.StringNodeDescription
Looks up a localized string similar to Creates a string..

Dynamo.Properties.Resources.SublistPortDataResultToolTip
Looks up a localized string similar to The sublists..

Dynamo.Properties.Resources.SublistsPortDataListToolTip
Looks up a localized string similar to The list from which to create sublists..

Dynamo.Properties.Resources.SublistsPortDataOffsetToolTip
Looks up a localized string similar to The offset to apply to the sub-list. Ex. The range "0..2" with an offset of 1 will yield sublists {0,1,2}{1,2,3}{2,3,4}....

Dynamo.Properties.Resources.SubmitBugButton
Looks up a localized string similar to Submit Bug To Github.

Dynamo.Properties.Resources.SubmitBugToGithub
Looks up a localized string similar to Submit Bug To Github.

Dynamo.Properties.Resources.SymbolNodeDescription
Looks up a localized string similar to A function parameter, use with custom nodes.
You can specify the type and default value for parameter. E.g.,
input : var[]..[]
value : bool = false.

Dynamo.Properties.Resources.SymbolSearchTags
Looks up a localized string similar to variable;argument;parameter.

Dynamo.Properties.Resources.ToolTipForTempVar
Looks up a localized string similar to Statement Output.

Dynamo.Properties.Resources.ToolTipFunctionOutput
Looks up a localized string similar to function output.

Dynamo.Properties.Resources.ToolTipInput
Looks up a localized string similar to Input #.

Dynamo.Properties.Resources.ToolTipOutput
Looks up a localized string similar to Output #.

Dynamo.Properties.Resources.ToolTipReturnValue
Looks up a localized string similar to return value.

Dynamo.Properties.Resources.ToolTipSymbol
Looks up a localized string similar to Symbol.

Dynamo.Properties.Resources.TopResult
Looks up a localized string similar to Top Result.

Dynamo.Properties.Resources.UnableToCreateCustomNodeID
Looks up a localized string similar to Unable to create instance of custom node with id: \".

Dynamo.Properties.Resources.UnhandledExceptionInDynamoEngine
Looks up a localized string similar to Unhandled exception in Dynamo engine.

Dynamo.Properties.Resources.UnhandledExceptionSummary
Looks up a localized string similar to Unhandled exception in Dynamo engine.

Dynamo.Properties.Resources.UnhandledExceptionTitle
Looks up a localized string similar to Unhandled Exception.

Dynamo.Properties.Resources.UnknownVersion
Looks up a localized string similar to Unknown.

Dynamo.Properties.Resources.UnresolvedNodesWarningMessage
Looks up a localized string similar to This graph currently contains some unresolved nodes, and cannot be saved until the nodes are resolved. If the graph is saved using SaveAs - the unresolved nodes will be removed from the file..

Dynamo.Properties.Resources.UnresolvedNodesWarningShortMessage
Looks up a localized string similar to This graph cannot be saved until unresolved nodes are removed or resolved..

Dynamo.Properties.Resources.UnresolvedNodesWarningTitle
Looks up a localized string similar to Graph Contains Unresolved Nodes and Cannot Be Saved..

Dynamo.Properties.Resources.UpdateAvailable
Looks up a localized string similar to Update available: {0}.

Dynamo.Properties.Resources.UpdateDownloadComplete
Looks up a localized string similar to Update download complete..

Dynamo.Properties.Resources.UpdateDownloadProgress
Looks up a localized string similar to Update download progress: {0}%.

Dynamo.Properties.Resources.UpdateDownloadStarted
Looks up a localized string similar to Update download started....

Dynamo.Properties.Resources.UsageReportingErrorMessage
Looks up a localized string similar to Uh oh...
We're sorry - we tried to save your decisions, but something went wrong. The decision probably hasn't been saved. This really shouldn't have happened. Please get in touch via GitHub and send us this information.
You can also try deleting [FILEPATH] and trying again.
Depending on your previous choice, analytics may still be running, if you're worried about this, please consider not using Dynamo until we've got back to you to solve the problem.
Sorry about that..

Dynamo.Properties.Resources.WarningCannotFindType
Looks up a localized string similar to Cannot find type '{0}'.

Dynamo.Properties.Resources.WarningInvalidInput
Looks up a localized string similar to Invalid input.
The name of parameter should start with alphabetic character. You can specify its type and default value. E.g.,
input : var[]..[]
value: bool = false.

Dynamo.Properties.Resources.WarningInvalidOutput
Looks up a localized string similar to Only comments and single variable are allowed in output node..

Dynamo.Properties.Resources.WatermarkLabelText
Looks up a localized string similar to Enter code here.

Dynamo.Properties.Resources.WelcomeMessage
Looks up a localized string similar to Welcome to Dynamo!.

Dynamo.Properties.Resources.WorkbenchNotOpen
Looks up a localized string similar to Workbench could not be opened..