Dynamo.Configuration.WindowSettings
Settings that define how to display an extension control in floating window mode.

Dynamo.Configuration.WindowSettings.Status
Status of the window, i.e. whether it is maximized.

Dynamo.Configuration.WindowSettings.Left
Coordinates of the leftmost side of the window.

Dynamo.Configuration.WindowSettings.Top
Coordinates of the topmost side of the window.

Dynamo.Configuration.WindowSettings.Width
Width of the window.

Dynamo.Configuration.WindowSettings.Height
Height of the window.