Dynamo.Visualization.IRenderPackageSource`1
This interface has events that is fired when the render packages are changed.

Dynamo.Visualization.IRenderPackageSource`1.RenderPackagesUpdated
An event raised then the source has updated IRenderPackages.