Dynamo.Search.SearchElements.SearchElementBase
A base class for elements found in search

Dynamo.Search.SearchElements.SearchElementBase.CreationName
The name that is used during node creation

Dynamo.Search.SearchElements.SearchElementBase.Searchable
Searchable property
A bool indicating if the object will appear in searches

Dynamo.Search.SearchElements.SearchElementBase.Type
Type property
A string describing the type of object

Dynamo.Search.SearchElements.SearchElementBase.Description
Description property
A string describing what the node does

Dynamo.Search.SearchElements.SearchElementBase.Keywords
Keywords property
A set of keywords for the object, joined by spaces

Dynamo.Search.SearchElements.SearchElementBase.Weight
Weight property
Number defining the relative importance of the element in search.
Higher = closer to the top of search results