Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchVarArgNodeController`1
Controller that extends Zero Touch synchronization with VarArg function compilation.

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchVarArgNodeController`1.#ctor(`0)
Initializes a new instance of
the ZeroTouchVarArgNodeController class with FunctionDescriptor.
zeroTouchDef: FunctionDescriptor describing the function
that this controller will call.