Dynamo.Linting.Interfaces.IRuleEvaluationResult.RuleId
Id of the rule that created this result

Dynamo.Linting.Interfaces.IRuleEvaluationResult.SeverityCode
Severity code of the rule that created this result

Dynamo.Linting.Interfaces.IRuleEvaluationResult.Status
Status of the evaluation (Passed or Failed)