Dynamo.Scheduler.TaskStateChangedEventArgs.State
Describes the state that a task can be in.

Dynamo.Scheduler.TaskStateChangedEventArgs.State.Scheduled
Task is added to the scheduler

Dynamo.Scheduler.TaskStateChangedEventArgs.State.Discarded
Task is dropped from the scheduler due to compacting process

Dynamo.Scheduler.TaskStateChangedEventArgs.State.ExecutionStarting
Task is about to be executed

Dynamo.Scheduler.TaskStateChangedEventArgs.State.ExecutionFailed
Task execution is completed with errors

Dynamo.Scheduler.TaskStateChangedEventArgs.State.ExecutionCompleted
Task execution is completed successfully

Dynamo.Scheduler.TaskStateChangedEventArgs.State.CompletionHandled
Post-execute action of task is completed and
registered event handlers of task completion are notified.