Dynamo.Migration.NodeMigrationAttribute
Marks methods on a NodeModel to be used for version migration.

Dynamo.Migration.NodeMigrationAttribute.Version
Version specifies the latest workspace version to which this migration will be applied.