Dynamo.Core.PulseMaker.#ctor
An internal constructor to ensure PulseMaker object can only
be instantiated from within DynamoModel (i.e. DynamoCore.dll).

Dynamo.Core.PulseMaker.Start(System.Int32)
Call this method to start the PulseMaker.
milliseconds: The interval between two pulses in
milliseconds.

Dynamo.Core.PulseMaker.Stop
Call this method to stop the PulseMaker. Note that any existing
scheduled evaluation will still proceed, but this call guarantees
that no further evaluation will take place after that.