Dynamo.Extensions.StartupParams
Application-level handles provided to an extension when
Dynamo is starting up and is not yet ready for interaction.

Dynamo.Extensions.StartupParams.AuthProvider
Returns Greg.IAuthProvider for DynamoModel

Dynamo.Extensions.StartupParams.Preferences
Returns Dynamo.Interfaces.IPreferences for DynamoModel

Dynamo.Extensions.StartupParams.PathManager
Returns Dynamo.Interfaces.IPathManager for DynamoModel

Dynamo.Extensions.StartupParams.LibraryLoader
Returns Dynamo.Library.ILibraryLoader for DynamoModel

Dynamo.Extensions.StartupParams.CustomNodeManager
Returns Dynamo.Graph.Nodes.CustomNodes.ICustomNodeManager for DynamoModel

Dynamo.Extensions.StartupParams.DynamoVersion
Defines version of Dynamo

Dynamo.Extensions.StartupParams.LinterManager
Returns Sessions Linter Manager

Dynamo.Extensions.StartupParams.#ctor(Greg.IAuthProvider,Dynamo.Interfaces.IPathManager,Dynamo.Library.ILibraryLoader,Dynamo.Graph.Nodes.CustomNodes.ICustomNodeManager,System.Version,Dynamo.Interfaces.IPreferences)
Initializes a new instance of the Dynamo.Extensions.StartupParams class.
provider: Greg.IAuthProvider for DynamoModel
pathManager: Dynamo.Interfaces.IPathManager for DynamoModel
libraryLoader: Dynamo.Library.ILibraryLoader for DynamoModel
customNodeManager: Dynamo.Graph.Nodes.CustomNodes.ICustomNodeManager for DynamoModel
dynamoVersion: System.Version for DynamoModel
preferences: Dynamo.Interfaces.IPreferences for DynamoModel

Dynamo.Extensions.StartupParams.#ctor(Greg.IAuthProvider,Dynamo.Interfaces.IPathManager,Dynamo.Library.ILibraryLoader,Dynamo.Graph.Nodes.CustomNodes.ICustomNodeManager,System.Version,Dynamo.Interfaces.IPreferences,Dynamo.Linting.LinterManager)
Initializes a new instance of the Dynamo.Extensions.StartupParams class.
provider: Greg.IAuthProvider for DynamoModel
pathManager: Dynamo.Interfaces.IPathManager for DynamoModel
libraryLoader: Dynamo.Library.ILibraryLoader for DynamoModel
customNodeManager: Dynamo.Graph.Nodes.CustomNodes.ICustomNodeManager for DynamoModel
dynamoVersion: System.Version for DynamoModel
preferences: Dynamo.Interfaces.IPreferences for DynamoModel
linterManager: Dynamo.Extensions.StartupParams.LinterManager for DynamoModel>