Dynamo.Visualization.DefaultRenderPackageFactory
Example implementation of IRenderPackageFactory.
DefaultRenderPackageFactory produces DefaultRenderPackages.

Dynamo.Visualization.DefaultRenderPackageFactory.TessellationParameters
Sets or Returns Tessellation parameters.
MaxTessellationDivisions equals 32.

Dynamo.Visualization.DefaultRenderPackageFactory.CreateRenderPackage
Creates DefaultRenderPackage.
Returns: DefaultRenderPackage