Dynamo.Graph.Nodes.ZeroTouch.UnresolvedFunctionException
The exception that is thrown when definition for a custom node cannot be found

Dynamo.Graph.Nodes.ZeroTouch.UnresolvedFunctionException.#ctor(System.String)
Initializes a new instance of the Dynamo.Graph.Nodes.ZeroTouch.UnresolvedFunctionException class
with the name of the custom node that causes this exception.
functionName: User friendly name of custom node on UI.

Dynamo.Graph.Nodes.ZeroTouch.UnresolvedFunctionException.FunctionName
Returns user friendly name of not found custom node.