Dynamo.Graph.Workspaces.IdReferenceResolver
The IdReferenceResolver class allows us to use the Guid of
an object as the reference id during serialization.

Dynamo.Graph.Workspaces.IdReferenceResolver.AddToReferenceMap(System.Guid,System.Object)
Add a reference to a newly created object, referencing
an old id.
oldid: The old id of the object.
newObject: The new object which maps to the old id.

Dynamo.Graph.Workspaces.IdReferenceResolver.ResolveReferenceFromMap(System.Object,System.String)
Resolve a reference to a newly created object, given
the original id for the object.
context:
reference:
Returns: