Dynamo.Models.DynamoModel.CreateNoteCommand
A command to create a note.

Dynamo.Models.DynamoModel.CreateNoteCommand.#ctor(System.Guid,System.String,System.Double,System.Double,System.Boolean)
nodeId:
noteText:
x:
y:
defaultPosition:

Dynamo.Models.DynamoModel.CreateNoteCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid},System.String,System.Double,System.Double,System.Boolean)
nodeIds:
noteText:
x:
y:
defaultPosition:

Dynamo.Models.DynamoModel.CreateNoteCommand.#ctor(System.String,System.String,System.Double,System.Double,System.Boolean)
nodeId:
noteText:
x:
y:
defaultPosition: