Dynamo.Graph.Nodes.CustomNodes.CustomNodeController`1
Controller that synchronizes a custom node with a node definition.

Dynamo.Graph.Nodes.CustomNodes.CustomNodeController`1.SyncNodeWithDefinition(Dynamo.Graph.Nodes.NodeModel)
Synchronizes custom node with its definition.
model: Custom node model

Dynamo.Graph.Nodes.CustomNodes.CustomNodeController`1.SerializeCore(System.Xml.XmlElement,Dynamo.Graph.SaveContext)
Serializes CustomNode.
nodeElement: Xml node
saveContext: SaveContext is used in base class.

Dynamo.Graph.Nodes.CustomNodes.CustomNodeController`1.IsInSyncWithNode(Dynamo.Graph.Nodes.NodeModel)
Return if the custom node instance is in sync with its definition.
It may be out of sync if .dyf file is opened and updated and then
.dyn file is opened.