Dynamo.Graph.Nodes.InPortTypesAttribute
Indicates input ports' types

Dynamo.Graph.Nodes.InPortTypesAttribute.#ctor(System.Type,System.String[])
Loads ports types from resource.
resourceType: resource type, i.e. type of resource class specified in .resx file
resourceNames: resource names

Dynamo.Graph.Nodes.InPortTypesAttribute.#ctor(System.String[])
Loads ports types, that are specified directly in Attribute.
types:

Dynamo.Graph.Nodes.InPortTypesAttribute.PortTypes
Port types, that are shown in Dynamo tooltips.