Dynamo.Models.DynamoModel.AddPresetCommand
A command to add a preset.

Dynamo.Models.DynamoModel.AddPresetCommand.#ctor(System.String,System.String,System.Collections.Generic.IEnumerable{System.Guid})
name:
description:
currentSelectionIds: