Dynamo.Extensions.IExtensionSource
An object which may request extensions to be loaded and added to the extensionsManager.

Dynamo.Extensions.IExtensionSource.RequestLoadExtension
Event that is raised when the ExtensionSource requests an Extension be loaded.

Dynamo.Extensions.IExtensionSource.RequestAddExtension
Event that is raised when ExtensionSource requests an Extension to be added to
list of currently loaded extensions.

Dynamo.Extensions.IExtensionSource.RequestedExtensions
Collection of Extensions this ExtensionSource has requested be loaded.