Dynamo.Graph.NodeGraph
This class is used to load workspace from xml file.

Dynamo.Graph.NodeGraph.Nodes
Dynamo.Graph.Nodes.NodeModel loaded from xml.

Dynamo.Graph.NodeGraph.Connectors
Dynamo.Graph.Connectors.ConnectorModel loaded from xml.

Dynamo.Graph.NodeGraph.Notes
Dynamo.Graph.Notes.NoteModel loaded from xml.

Dynamo.Graph.NodeGraph.Annotations
Dynamo.Graph.Annotations.AnnotationModel loaded from xml.

Dynamo.Graph.NodeGraph.ElementResolver
Partial class name nodes loaded from xml.
E.g. Range turns into DSCoreNodesUI.Range.

Dynamo.Graph.NodeGraph.Presets
Dynamo.Graph.Presets.PresetModel loaded from xml.

Dynamo.Graph.NodeGraph.LoadNodeFromXml(System.Xml.XmlElement,Dynamo.Graph.SaveContext,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,ProtoCore.Namespace.ElementResolver)
Creates and initializes a NodeModel from its Xml representation.
elNode: XmlElement for a NodeModel.
context: The serialization context for initialization.
nodeFactory: A NodeFactory, to be used to create the node.
resolver:
Returns:

Dynamo.Graph.NodeGraph.LoadConnectorFromXml(System.Xml.XmlElement,System.Collections.Generic.IDictionary{System.Guid,Dynamo.Graph.Nodes.NodeModel})
Creates and initializes a ConnectorModel from its Xml representation.
connEl: XmlElement for a ConnectorModel.
nodes: Dictionary to be used for looking up a NodeModel by it's Guid.
Returns: Returns the new instance of ConnectorModel loaded from XmlElement.

Dynamo.Graph.NodeGraph.LoadNoteFromXml(System.Xml.XmlNode)
Creates and initializes a NoteModel from its Xml representation.
note:
Returns:

Dynamo.Graph.NodeGraph.LoadPinFromXml(System.Xml.XmlElement)
Method used to reconstruct a pin from xml when it has been deleted (undo/redo operations).
pin: The xml representation of a ConnectorPinModel
Returns: A reconstructed instance of type ConnectorPinModel

Dynamo.Graph.NodeGraph.LoadPresetsFromXml(System.Xml.XmlDocument,System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
Loads presets from xml file.
xmlDoc: xml file
nodesInNodeGraph: node models
Returns: list of presets

Dynamo.Graph.NodeGraph.LoadGraphFromXml(System.Xml.XmlDocument,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory)
Loads NodeModels, ConnectorModels, and NoteModels from an XmlDocument.
xmlDoc: An XmlDocument representing a serialized Dynamo workspace.
nodeFactory: A NodeFactory, used to load and instantiate nodes.
Returns: