Dynamo.Graph.Nodes.PortData
PortData stores information for port. It's used for constructing PortModel.

Dynamo.Graph.Nodes.PortData.Name
Name of the port.

Dynamo.Graph.Nodes.PortData.ToolTipString
Tooltip of the port.

Dynamo.Graph.Nodes.PortData.DefaultValue
Default value of the port.

Dynamo.Graph.Nodes.PortData.LineIndex
This property is used in code block nodes.

Dynamo.Graph.Nodes.PortData.Height
Height of the port.

Dynamo.Graph.Nodes.PortData.#ctor(System.String,System.String)
Creates PortData.
name: name of the port
toolTipString: Tooltip of the port

Dynamo.Graph.Nodes.PortData.#ctor(System.String,System.String,ProtoCore.AST.AssociativeAST.AssociativeNode)
Creates PortData.
name: name of the port
toolTipString: Tooltip of the port
defaultValue: Default value of the port