Dynamo.Search.SearchDictionary`1
A dictionary of objects for search

Dynamo.Search.SearchDictionary`1.#ctor(Dynamo.Logging.ILogger)
Construct a SearchDictionary object
logger:  (Optional) A logger to use to log search data

Dynamo.Search.SearchDictionary`1.entryDictionary
Dictionary of searchElement:(tag, weight)

Dynamo.Search.SearchDictionary`1.tagDictionary
Dictionary of tag:(list(searchelement, weight)) which contains all nodes that share a tag

Dynamo.Search.SearchDictionary`1.SearchEntries
All the current entries in search.

Dynamo.Search.SearchDictionary`1.NumTags
The number of tags in the dictionary

Dynamo.Search.SearchDictionary`1.NumElements
The number of elements in the dictionary

Dynamo.Search.SearchDictionary`1.EntryAdded
Event is fired when an entry is added.

Dynamo.Search.SearchDictionary`1.EntryRemoved
Event is fired when an entry is removed.

Dynamo.Search.SearchDictionary`1.EntryUpdated
Event is fired when an entry is updated.

Dynamo.Search.SearchDictionary`1.Add(`0,System.String,System.Double)
Add a single element with a single tag
value:  The object to add
tag:  The string to identify it in search
weight:

Dynamo.Search.SearchDictionary`1.Add(System.Collections.Generic.IEnumerable{`0},System.String,System.Double)
Add a list of elements with a single tag
values:  List of objects to add
tag:  The string to identify it in search
weight:

Dynamo.Search.SearchDictionary`1.Add(`0,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Double})
Add a single element with a number of tags
value:  The object to add
tags:  The list of strings to identify it in search
weights: The list of corresponding weights coefficients

Dynamo.Search.SearchDictionary`1.Add(System.Collections.Generic.IEnumerable{`0},System.Collections.Generic.IEnumerable{System.String},System.Double)
Add a coordinated list of objects and strings.
values:  The objects to add. Must have the same cardinality as the second parameter
tags:  The list of strings to identify it in search. Must have the same cardinality as the first parameter
weight:

Dynamo.Search.SearchDictionary`1.Remove(`0,System.String)
Remove an element from the search
value:  The object to remove
tag: The tag to remove for the given value

Dynamo.Search.SearchDictionary`1.Remove(`0)
Remove an element from the search
value:  The object to remove

Dynamo.Search.SearchDictionary`1.Remove(System.Func{`0,System.Boolean})
Remove elements from search based on a predicate
removeCondition:  The predicate with which to test.  True results in removal.

Dynamo.Search.SearchDictionary`1.Remove(System.Func{`0,System.Boolean},System.Func{System.String,System.Boolean})
Removes elements from search, based on separate predicates for values and tags.
valueCondition:
removeTagCondition:
Returns:

Dynamo.Search.SearchDictionary`1.Remove(`0,System.Collections.Generic.IEnumerable{System.String})
Remove elements from search
value:  The object to remove
tags:  The list of tags to remove.

Dynamo.Search.SearchDictionary`1.ByTag(System.String)
Returns the elements with a given tag
tag:  The tag to match
Returns:  The elements with the given tag

Dynamo.Search.SearchDictionary`1.Contains(`0)
Determines if this SearchDictionary contains a specific element.
a:
Returns:

Dynamo.Search.SearchDictionary`1.MatchWithQueryString(System.String,System.String[])
Check if key matches with query string. The query string could
contains multiple sub query strings which are separated with
space character. The function returns true if the key sequentially
matches with each sub query strings. E.g.,
"Autodesk.Geometry.Point.ByCoordinate" matches with query string
"geometry point by".
key:
subPatterns:
Returns:

Dynamo.Search.SearchDictionary`1.MatchWithSubset(System.Collections.Generic.Dictionary{`0,System.Double},System.Collections.Generic.IEnumerable{Dynamo.Search.SearchElements.NodeSearchElement})
Check if any element in the given subset
matches any element in the tagDictionary.
subset: The subset that will be used to match elements in tagDictionary.
Returns:

Dynamo.Search.SearchDictionary`1.RebuildTagDictionary
Converts entryDictionary from a dictionary of searchElement:(tag,weight)
to a dictionary of tag:(list(searchelement,weight))
which contains all nodes which share a tag

Dynamo.Search.SearchDictionary`1.Search(System.String,System.Int32,System.Collections.Generic.IEnumerable{Dynamo.Search.SearchElements.NodeSearchElement})
Search for elements in the dictionary or subset based on the query. PLEASE NOTE - this method is called using reflection from the
MSLibraryWebBrowserUIExtension - if its signature is modified, please update its use in that extension.
query:  The query
minResultsForTolerantSearch: Minimum number of results in the original search strategy to justify doing more tolerant search
subset: Subset of nodes that should be used for the search instead of the complete set of nodes

Dynamo.Search.SearchDictionary`1.GetTags(`0)
Returns all tags for search specified element
element: The element to match
Returns: All tags of the given element

Dynamo.Search.SearchDictionary`1.GetWeights(`0)
Returns all weights for search specified element
element: The element to match
Returns: All tags of the given element