Dynamo.Core.PathManager.BuiltinPackagesDirectory
The Built-In Packages directory is located in the same directory as the DynamoCore.dll
Property should only be set during testing. During testing, keep in mind that previous tests
may have altered this static property, and it may need to be restored.

Dynamo.Core.PathManager.CommonPackageDirectory
The local directory that contains package directory created by all users.

Dynamo.Core.PathManager.DefaultPackagesDirectory
Default directory where new packages are downloaded to.
This directory path is user configurable and if set to something other than the default,
the currently selected path can be obtained from preference settings.

Dynamo.Core.PathManager.ResolveLibraryPath(System.String@)
Given an initial file path with the file name, resolve the full path
to the target file. The search happens in the following order:
1. If the provided file path is valid and points to an existing file,
the file path is return as-is.
2. The file is searched alongside DynamoCore.dll for a match.
3. The file is searched within AdditionalResolutionPaths.
4. The search is left to system path resolution.
library: The initial library file path.
Returns: Returns true if the requested file can be located, or false
otherwise.

Dynamo.Core.PathManager.#ctor(Dynamo.Core.PathManagerParams)
Constructs an instance of PathManager object.
pathManagerParams: Parameters to configure the new
instance of PathManager. See PathManagerParams for details of each
field.

Dynamo.Core.PathManager.EnsureDirectoryExistence(System.Collections.Generic.List{System.Exception})
Call this method to force PathManager to create folders that it
is referring to. This method call throws exception if any creation
fails.
exceptions: The output list of exception, if any of
the target directories cannot be created during this call.

Dynamo.Core.PathManager.GetBackupFilePath(Dynamo.Graph.Workspaces.WorkspaceModel)
Returns the backup file path for a workspace
workspace:
Returns:

Dynamo.Core.PathManager.BackupXMLFile(System.Xml.XmlDocument,System.String)
Backup the XML file.
xmlDoc: The XML document.
filePath: The file path.
Returns: