Dynamo.Logging.IAnalyticsSession
Defines analytics session interface. This interface is defined for
internal use and mocking the tests only.

Dynamo.Logging.IAnalyticsSession.UserId
Get unique user id.

Dynamo.Logging.IAnalyticsSession.SessionId
Gets unique session id.

Dynamo.Logging.IAnalyticsSession.Start(Dynamo.Models.DynamoModel)
Starts the session for the given DynamoModel.
The Session is closed when Dispose() is called.
model: DynamoModel

Dynamo.Logging.IAnalyticsSession.Logger
Returns a logger to record usage.