Dynamo.Configuration.DebugSettings
This class is used for setting debug settings through Dynamo UI.
E.g. turn on/off logging; show/hide compiled node values.

Dynamo.Configuration.DebugSettings.VerboseLogging
Enable verbose logging this is a lot of data

Dynamo.Configuration.DebugSettings.ShowDebugASTs
Shows near node view its AST compiled node.