Dynamo.Engine.CodeGeneration.CompilationContext
The context of AST compilation

Dynamo.Engine.CodeGeneration.CompilationContext.None
No specific context.

Dynamo.Engine.CodeGeneration.CompilationContext.DeltaExecution
Compiled AST nodes finally will be executed.

Dynamo.Engine.CodeGeneration.CompilationContext.NodeToCode
Compiled AST nodes used in node to code.

Dynamo.Engine.CodeGeneration.CompilationContext.PreviewGraph
Compiled AST nodes used in previwing graph.