Dynamo.Graph.Nodes.FunctionCallBase`2
Node base class for all nodes that produce a DS function call.

Dynamo.Graph.Nodes.FunctionCallBase`2.Controller
Controller used to sync node with a function definition.

Dynamo.Graph.Nodes.FunctionCallBase`2.#ctor(`0)
Default constructor

Dynamo.Graph.Nodes.FunctionCallBase`2.CreationName
The unique name that the node was created by