Dynamo.Visualization.DefaultRenderPackage
Example implementation of IRenderPackage.
DefaultRenderPackage can be used as package for your visualization.

Dynamo.Visualization.DefaultRenderPackage.AddPointVertex(System.Double,System.Double,System.Double)
Add a point vertex to the render package.

Dynamo.Visualization.DefaultRenderPackage.AddPointVertexColor(System.Byte,System.Byte,System.Byte,System.Byte)
Add a point color to the render package.

Dynamo.Visualization.DefaultRenderPackage.AddTriangleVertex(System.Double,System.Double,System.Double)
Add a triangle vertex location to the render package.

Dynamo.Visualization.DefaultRenderPackage.AddTriangleVertexNormal(System.Double,System.Double,System.Double)
Add a triangle vertex normal to the render package.

Dynamo.Visualization.DefaultRenderPackage.AddTriangleVertexUV(System.Double,System.Double)
Add a triangle texture coordinate to the render package.

Dynamo.Visualization.DefaultRenderPackage.AddTriangleVertexColor(System.Byte,System.Byte,System.Byte,System.Byte)
Add a triangle vertex color to the render package.

Dynamo.Visualization.DefaultRenderPackage.AddLineStripVertex(System.Double,System.Double,System.Double)
Add a line vertex to the render package.

Dynamo.Visualization.DefaultRenderPackage.AddLineStripVertexCount(System.Int32)
Add a line strip vertex count to the render package.

Dynamo.Visualization.DefaultRenderPackage.AddLineStripVertexColor(System.Byte,System.Byte,System.Byte,System.Byte)
Add a line strip vertex color to the render package.

Dynamo.Visualization.DefaultRenderPackage.ApplyPointVertexColors(System.Byte[])
Apply a color to each point vertex.
colors: A buffer of R,G,B,A values corresponding to each vertex.

Dynamo.Visualization.DefaultRenderPackage.ApplyLineVertexColors(System.Byte[])
Apply a color to a sequence of line vertices.

Dynamo.Visualization.DefaultRenderPackage.ApplyMeshVertexColors(System.Byte[])
Apply a color to each mesh vertex.
colors: A buffer of R,G,B,A values corresponding to each vertex.

Dynamo.Visualization.DefaultRenderPackage.SetColors(System.Byte[])
Sets an array of bytes that is used as a color map.
colors:

Dynamo.Visualization.DefaultRenderPackage.Clear
Clear all render data from the render package.

Dynamo.Visualization.DefaultRenderPackage.Description
A tag used to store information about the render package.

Dynamo.Visualization.DefaultRenderPackage.IsSelected
Returns true if the render package is selected.

Dynamo.Visualization.DefaultRenderPackage.HasRenderingData
Returns true if the render package has data.

Dynamo.Visualization.DefaultRenderPackage.DisplayLabels
Returns true if the render package is displaying labels.

Dynamo.Visualization.DefaultRenderPackage.RequiresPerVertexColoration
Returns true if the render package requires per vertex coloration

Dynamo.Visualization.DefaultRenderPackage.PointVertexCount
Returns the number of point vertices in the package divided by 3.

Dynamo.Visualization.DefaultRenderPackage.LineVertexCount
Returns the number of line vertices in the package divided by 3.

Dynamo.Visualization.DefaultRenderPackage.MeshVertexCount
Returns the number of mesh vertices in the package divided by 3.

Dynamo.Visualization.DefaultRenderPackage.LineStripVertexCounts
Returns the collection of int values representing how many vertices
comprise each line segment in the package.

Dynamo.Visualization.DefaultRenderPackage.LineStripVertices
Returns the collection containing all line strip vertices as x1,y1,z1,x2,y2,z2...

Dynamo.Visualization.DefaultRenderPackage.LineStripVertexColors
Returns the collection containing all line strip colors as r1,g1,b1,a1,r2,g2,b2,a2...

Dynamo.Visualization.DefaultRenderPackage.LineStripIndices
Returns the collection containing all line strip indices.

Dynamo.Visualization.DefaultRenderPackage.MeshVertices
Returns the collection containing all mesh vertices as x1,y1,z1,x2,y2,z2...

Dynamo.Visualization.DefaultRenderPackage.MeshVertexColors
Returns the collection containing all mesh vertex colors as r1,g1,b1,a1,r2,g2,b2,a2...

Dynamo.Visualization.DefaultRenderPackage.MeshIndices
Returns the collection containing all mesh vertex indices.

Dynamo.Visualization.DefaultRenderPackage.MeshNormals
Returns the collection containing all mesh normals as x1,y1,z1,x2,y2,z2...

Dynamo.Visualization.DefaultRenderPackage.MeshTextureCoordinates
Returns the collection containing all mesh texture coordinates as u1,v1,u2,v2...

Dynamo.Visualization.DefaultRenderPackage.PointVertices
Returns the collection containing all point vertices as x1,y1,z1,x2,y2,z2...

Dynamo.Visualization.DefaultRenderPackage.PointVertexColors
Returns the collection containing all mesh vertex colors as r1,g1,b1,a1,r2,g2,b2,a2...

Dynamo.Visualization.DefaultRenderPackage.PointIndices
Returns the collection containing all mesh vertex indices.

Dynamo.Visualization.DefaultRenderPackage.Colors
Returns the collection of bytes representing RGBA colors. This field can be used to populate textures
for mapping onto surfaces. Use the ColorsStride property to define the
size of one dimension of the collection.

Dynamo.Visualization.DefaultRenderPackage.ColorsStride
The size of one dimension of the Colors collection.

Dynamo.Visualization.DefaultRenderPackage.PointVertexColorCount
The number of point vertices colors in the package (Optimized for speed).

Dynamo.Visualization.DefaultRenderPackage.LineVertexColorCount
The number of line vertices colors in the package (Optimized for speed).

Dynamo.Visualization.DefaultRenderPackage.MeshVertexColorCount
The number of mesh vertices colors in the package (Optimized for speed).

Dynamo.Visualization.DefaultRenderPackage.UpdatePointVertexColorForRange(System.Int32,System.Int32,System.Byte,System.Byte,System.Byte,System.Byte)
Update a color to a range of point vertices.
startIndex: The index associated with the first vertex in PointVertices we want to associate with a color
endIndex: The index associated with the last vertex in PointVertices we want to associate with a color
red: byte for the red RGB value
green: byte for the green RGB value
blue: byte for the blue RGB value
alpha: byte for the alpha RGB value

Dynamo.Visualization.DefaultRenderPackage.AppendPointVertexColorRange(System.Byte[])
Append a color range for point vertices.
colors: A buffer of R,G,B,A values corresponding to each vertex.

Dynamo.Visualization.DefaultRenderPackage.UpdateLineVertexColorForRange(System.Int32,System.Int32,System.Byte,System.Byte,System.Byte,System.Byte)
Update a color to a range of line vertices.
startIndex: The index associated with the first vertex in LineVertices we want to associate with a color
endIndex: The index associated with the last vertex in LineVertices we want to associate with a color
red: byte for the red RGB value
green: byte for the green RGB value
blue: byte for the blue RGB value
alpha: byte for the alpha RGB value

Dynamo.Visualization.DefaultRenderPackage.AppendLineVertexColorRange(System.Byte[])
Append a color range for line vertices.
colors: A buffer of R,G,B,A values corresponding to each vertex.

Dynamo.Visualization.DefaultRenderPackage.UpdateMeshVertexColorForRange(System.Int32,System.Int32,System.Byte,System.Byte,System.Byte,System.Byte)
Update a color to a range of of mesh vertices.
startIndex: The index associated with the first vertex in MeshVertices we want to associate with a color
endIndex: The index associated with the last vertex in MeshVertices we want to associate with a color
red: byte for the red RGB value
green: byte for the green RGB value
blue: byte for the blue RGB value
alpha: byte for the alpha RGB value

Dynamo.Visualization.DefaultRenderPackage.AppendMeshVertexColorRange(System.Byte[])
Append a color range for mesh vertex.
colors: A buffer of R,G,B,A values corresponding to each vertex.

Dynamo.Visualization.DefaultRenderPackage.TextureMapsList
A List containing arrays of bytes representing RGBA colors.
These arrays can be used to populate textures for mapping onto specific meshes

Dynamo.Visualization.DefaultRenderPackage.TextureMapsStrideList
A list containing the size of one dimension of the associated texture map array in TextureMapsList.

Dynamo.Visualization.DefaultRenderPackage.MeshVerticesRangesAssociatedWithTextureMaps
A list of mesh vertices ranges that have associated texture maps

Dynamo.Visualization.DefaultRenderPackage.AddTextureMapForMeshVerticesRange(System.Int32,System.Int32,System.Byte[],System.Int32)
Set a color map for a range of mesh vertices
startIndex: The index associated with the first vertex in MeshVertices we want to associate with the texture map
endIndex: The index associated with the last vertex in MeshVertices we want to associate with the texture map
textureMap: An array of bytes representing RGBA colors to be used as a color texture map
stride: The size of one dimension of the colors array

Dynamo.Visualization.DefaultRenderPackage.AllowLegacyColorOperations
Allow legacy usage of the color methods in IRenderPackage
This flag is used by the UpdateRenderPackageAsyncTask implementation to flag
any third party usage of deprecated color methods in IRenderPackage API