Dynamo.Search.SearchElements.ZeroTouchSearchElement
Search element for a Zero Touch node (DSFunction / DSVarArgFunction)

Dynamo.Search.SearchElements.ZeroTouchSearchElement.CreationName
The name that is used during node creation

Dynamo.Search.SearchElements.ZeroTouchSearchElement.FullName
The full name of entry which consists of assembly name and qualified name for function descriptor.

Dynamo.Search.SearchElements.ZeroTouchSearchElement.Descriptor
Retrieve underlying Function Descriptor.

Dynamo.Search.SearchElements.ZeroTouchSearchElement.#ctor(Dynamo.Engine.FunctionDescriptor)
Initializes a new instance of the Dynamo.Search.SearchElements.ZeroTouchSearchElement class
with the DesignScript function description
functionDescriptor: Dynamo.Engine.FunctionDescriptor object
describing DesignScript function.