Dynamo.Models.NodeModelAssemblyLoader.AssemblyLoadedEventArgs
This class holds the reference for the loaded assembly.

Dynamo.Models.NodeModelAssemblyLoader.AssemblyLoadedEventArgs.Assembly
Loaded assembly.

Dynamo.Models.NodeModelAssemblyLoader.AssemblyLoadedEventArgs.#ctor(System.Reflection.Assembly)
Creates AssemblyLoadedEventArgs
assembly: loaded assembly