Dynamo.Graph.Nodes.NodeSearchTagsAttribute
The NodeCategoryAttribute attribute allows the node implementer
to define search tags.

Dynamo.Graph.Nodes.NodeSearchTagsAttribute.#ctor(System.String,System.Type)
Creates NodeSearchTagsAttribute with tags from resx file.
tagsID: Tag name
resourceType: Type of Resource. E.g. typeof(Resource)

Dynamo.Graph.Nodes.NodeSearchTagsAttribute.#ctor(System.String[])
Creates NodeSearchTagsAttribute with string tags.
tags:

Dynamo.Graph.Nodes.NodeSearchTagsAttribute.Tags
Search tags used in library search.