Dynamo.Graph.Nodes.NodeModel.isFrozenExplicitly
A flag indicating whether the node has been explicitly frozen.

Dynamo.Graph.Nodes.NodeModel.cachedValue
The cached value of this node. The cachedValue object is protected by the cachedValueMutex
as it may be accessed from multiple threads concurrently.
However, generally access to the cachedValue property should be protected by usage
of the Scheduler.

Dynamo.Graph.Nodes.NodeModel.CreationName
The unique name that was created the node by

Dynamo.Graph.Nodes.NodeModel.UpstreamCache
This property queries all the Upstream Nodes  for a given node, ONLY after the graph is loaded.
This property is computed in ComputeUpstreamOnDownstreamNodes function

Dynamo.Graph.Nodes.NodeModel.NodeType
The NodeType property provides a name which maps to the
server type for the node. This property should only be
used for serialization.

Dynamo.Graph.Nodes.NodeModel.DispatchOnUIThread(System.Action)
Called by nodes for behavior that they want to dispatch on the UI thread
Triggers event to be received by the UI. If no UI exists, behavior will not be executed.
a:

Dynamo.Graph.Nodes.NodeModel.PortConnected
Event triggered when a port is connected.

Dynamo.Graph.Nodes.NodeModel.PortDisconnected
Event triggered when a port is disconnected.

Dynamo.Graph.Nodes.NodeModel.NodeExecutionBegin
Event triggered before a node is executed.
Note: This event will only be triggered when profiling is active.

Dynamo.Graph.Nodes.NodeModel.NodeMessagesClearing
Event triggered whenever the node re-executes to clear its warnings and errors.

Dynamo.Graph.Nodes.NodeModel.OnNodeMessagesClearing
Fires on each node that is modified when the graph executes.

Dynamo.Graph.Nodes.NodeModel.NodeExecutionEnd
Event triggered after a node is executed.
Note: This event will only be triggered when profiling is active.

Dynamo.Graph.Nodes.NodeModel.GUID
Id for this node, must be unique within the graph.

Dynamo.Graph.Nodes.NodeModel.AllConnectors
All of the connectors entering and exiting the NodeModel.

Dynamo.Graph.Nodes.NodeModel.IsCustomFunction
Returns whether this node represents a built-in or custom function.

Dynamo.Graph.Nodes.NodeModel.IsVisible
Returns whether the node is to be included in visualizations.

Dynamo.Graph.Nodes.NodeModel.IsInputNode
Input nodes are used in Customizer and Presets. Input nodes can be numbers, number sliders,
strings, bool, code blocks, custom nodes and color palette node. This property
is true for nodes that are potential inputs for Customizers and Presets.

Dynamo.Graph.Nodes.NodeModel.IsSetAsInput
This property is user-controllable via a checkbox and is set to true when a user wishes to include
this node in a Customizer as an interactive control.

Dynamo.Graph.Nodes.NodeModel.IsOutputNode
Output nodes are used by applications that consume graphs outside of Dynamo such as Optioneering, Optimization,
and Dynamo Player. Output nodes can be any node that returns a single output or a dictionary. Code block nodes and
Custom nodes are specifically excluded at this time even though they can return a single output for sake of clarity.

Dynamo.Graph.Nodes.NodeModel.IsSetAsOutput
This property is user-controllable via a checkbox and is set to true when a user wishes to include
this node in the OutputData block of the Dyn file.

Dynamo.Graph.Nodes.NodeModel.State
The Node's state, which determines the coloring of the Node in the canvas.

Dynamo.Graph.Nodes.NodeModel.IsInErrorState
If the state of node is Error or AstBuildBroken

Dynamo.Graph.Nodes.NodeModel.PreviewPinned
Indicates if node preview is pinned

Dynamo.Graph.Nodes.NodeModel.ToolTipText
Text that is displayed as this Node's tooltip.

Dynamo.Graph.Nodes.NodeModel.Name
The name that is displayed in the UI for this NodeModel.

Dynamo.Graph.Nodes.NodeModel.InPorts
Collection of PortModels representing all Input ports.

Dynamo.Graph.Nodes.NodeModel.OutPorts
Collection of PortModels representing all Output ports.

Dynamo.Graph.Nodes.NodeModel.ArgumentLacing
Control how arguments lists of various sizes are laced.

Dynamo.Graph.Nodes.NodeModel.Category
Category property
If the node has a category, return it.  Other wise return empty string.

Dynamo.Graph.Nodes.NodeModel.DictionaryLink
Dictionary Link property
If the node has a name and a category, convert them into a link going to the node's help page on
Dynamo Dictionary, and return the link.
Otherwise, return the Dynamo Dictionary home page.

Dynamo.Graph.Nodes.NodeModel.ObtainURL(System.String)
This method converts the character '.' in the node's category to '/', and append
another '/' at the end, to be used as a URL.
e.g. Core.Input.Action is converted to Core/Input/Action/

Dynamo.Graph.Nodes.NodeModel.CachedValue
The value of this node after the most recent computation
As this property could be modified by the virtual machine, it's dangerous
to access this value without using the active Scheduler. Use the Scheduler to
remove the possibility of race conditions.

Dynamo.Graph.Nodes.NodeModel.WasInvolvedInExecution
This flag is used to determine if a node was involved in a recent execution.
The primary purpose of this flag is to determine if the node's render packages
should be returned to client browser when it requests for them. This is mainly
to avoid returning redundant data that has not changed during an execution.

Dynamo.Graph.Nodes.NodeModel.WasRenderPackageUpdatedAfterExecution
This flag indicates if render packages of a NodeModel has been updated
since the last execution. UpdateRenderPackageAsyncTask will always be
generated for a NodeModel that took part in the evaluation, if this flag
is false.

Dynamo.Graph.Nodes.NodeModel.Tags
Search tags for this Node.

Dynamo.Graph.Nodes.NodeModel.UserDescription
Node description that can be customized by the user.

Dynamo.Graph.Nodes.NodeModel.AstIdentifierForPreview
ProtoAST Identifier for result of the node before any output unpacking has taken place.
If there is only one output for the node, this is equivalent to GetAstIdentifierForOutputIndex(0).

Dynamo.Graph.Nodes.NodeModel.IsConvertible
If this node is allowed to be converted to AST node in nodes to code conversion.

Dynamo.Graph.Nodes.NodeModel.AstIdentifierBase
Return a variable whose value will be displayed in preview window.
Derived nodes may overwrite this function to display default value
of this node. E.g., code block node may want to display the value
of the left hand side variable of last statement.

Dynamo.Graph.Nodes.NodeModel.AstIdentifierGuid
A unique ID that will be appended to all identifiers of this node.

Dynamo.Graph.Nodes.NodeModel.DisplayLabels
Enable or disable label display. Default is false.

Dynamo.Graph.Nodes.NodeModel.IsPartiallyApplied
Is this node being applied partially, resulting in a partial function?

Dynamo.Graph.Nodes.NodeModel.GetDescriptionStringFromAttributes
Returns the description from type information
Returns: The value or "No description provided"

Dynamo.Graph.Nodes.NodeModel.GetAstIdentifierForOutputIndex(System.Int32)
Fetches the ProtoAST Identifier for a given output port.
outputIndex: Index of the output port.
Returns: Identifier corresponding to the given output port.

Dynamo.Graph.Nodes.NodeModel.GetTypeHintForOutput(System.Int32)
The possible type of output at specified port. This
type information is not necessary to be accurate.
Returns:

Dynamo.Graph.Nodes.NodeModel.IsFrozen
A flag indicating whether the node is frozen.
When a node is frozen, the node, and all nodes downstream will not participate in execution.
This will return true if any upstream node is frozen or if the node was explicitly frozen.
true if this node is frozen; otherwise, false.

Dynamo.Graph.Nodes.NodeModel.ShouldSerializeX
The default behavior for ModelBase objects is to not serialize the X and Y
properties. This overload allows the serialization of the X property
for NodeModel.
Returns: True.

Dynamo.Graph.Nodes.NodeModel.ShouldSerializeY
The default behavior for ModelBase objects is to not serialize the X and Y
properties. This overload allows the serialization of the Y property
for NodeModel.
Returns: True

Dynamo.Graph.Nodes.NodeModel.DismissedAlerts
A collection of error/warning/info messages, dismissed via a sub-menu in the node Context Menu.

Dynamo.Graph.Nodes.NodeModel.IsAnyUpstreamFrozen
Determines whether any of the upstream node is frozen.
Returns:

Dynamo.Graph.Nodes.NodeModel.ComputeUpstreamCache
For a given node, this function computes all the upstream nodes
by gathering the cached upstream nodes on this node's immediate parents.

Dynamo.Graph.Nodes.NodeModel.ComputeUpstreamOnDownstreamNodes
For a given node, this function computes all the upstream nodes
by gathering the cached upstream nodes on this node's immediate parents.
If a node has any downstream nodes, then for all those downstream nodes, upstream
nodes will be computed. Essentially this method propogates the UpstreamCache down.
Also this function gets called only after the workspace is added.

Dynamo.Graph.Nodes.NodeModel.GetDownstreamNodes(Dynamo.Graph.Nodes.NodeModel,System.Collections.Generic.HashSet{Dynamo.Graph.Nodes.NodeModel})
Returns the downstream nodes for the given node.
node: The node.
gathered: The gathered.

Dynamo.Graph.Nodes.NodeModel.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel})
Protected constructor used during deserialization.
inPorts:
outPorts:

Dynamo.Graph.Nodes.NodeModel.FindPortData(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel})
Here we try to find the correct port names and tooltips.
ideally we'd use the runtime information to correctly update or localize
the port info, if we can't find it for any of the ports of the current node we fallback to the deserialized data
for all the ports.
Other strategies for port data lookup can be added here in the future.
inPorts:
outPorts:

Dynamo.Graph.Nodes.NodeModel.GetValue(System.Int32,Dynamo.Engine.EngineController)
Returns the most recent value of this node stored in an EngineController that has evaluated it.
outPortIndex:
engine:
Returns:

Dynamo.Graph.Nodes.NodeModel.SetNameFromNodeNameAttribute
Sets the name of this node from the attributes on the class definining it.

Dynamo.Graph.Nodes.NodeModel.RaisesModificationEvents
Indicate if the node should respond to NodeModified event. It
always should be true, unless is temporarily set to false to
avoid flood of Modified event.

Dynamo.Graph.Nodes.NodeModel.Modified
Event fired when the node's DesignScript AST should be recompiled

Dynamo.Graph.Nodes.NodeModel.UpdateASTCollection
Event fired when the node's DesignScript AST should be updated.
This event deletes the frozen nodes from AST collection.

Dynamo.Graph.Nodes.NodeModel.RequestSilenceNodeModifiedEvents
Called when a node is requesting that the workspace's node modified events be
silenced. This is particularly critical for code block nodes, whose modification can
mutate the workspace.
As opposed to RaisesModificationEvents, this modifies the entire parent workspace

Dynamo.Graph.Nodes.NodeModel.BuildOutputAst(System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Override this to declare the outputs for each of this Node's output ports.
inputAstNodes: Ast for inputs indexed by input port index.
Returns: Sequence of AssociativeNodes representing this Node's code output.

Dynamo.Graph.Nodes.NodeModel.BuildAst(System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode},Dynamo.Engine.CodeGeneration.CompilationContext)
Wraps the publically overrideable `BuildOutputAst` method so that it works with Preview.
inputAstNodes:
context: Compilation context

Dynamo.Graph.Nodes.NodeModel.OnBuilt
Callback for when this NodeModel has been compiled.

Dynamo.Graph.Nodes.NodeModel.UseLevelAndReplicationGuide(System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Apppend replication guide to the input parameter based on lacing
strategy.
inputs:
Returns:

Dynamo.Graph.Nodes.NodeModel.ConnectorAdded
Event fired when a new ConnectorModel has been attached to one of this node's inputs.

Dynamo.Graph.Nodes.NodeModel.IsTopMostNode
If node is connected to some other node(other than Output) then it is not a 'top' node

Dynamo.Graph.Nodes.NodeModel.TryGetInput(System.Int32,System.Tuple{System.Int32,Dynamo.Graph.Nodes.NodeModel}@)
Attempts to get the input for a certain port.
data: PortData to look for an input for.
input: If an input is found, it will be assigned.
Returns: True if there is an input, false otherwise.

Dynamo.Graph.Nodes.NodeModel.TryGetOutput(System.Int32,System.Collections.Generic.HashSet{System.Tuple{System.Int32,Dynamo.Graph.Nodes.NodeModel}}@)
Attempts to get the output for a certain port.
output: Index to look for an output for.
newOutputs: If an output is found, it will be assigned.
Returns: True if there is an output, false otherwise.

Dynamo.Graph.Nodes.NodeModel.ClearErrorsAndWarnings
Clears the errors/warnings that are generated when running the graph,
the State will be set to ElementState.Dead.

Dynamo.Graph.Nodes.NodeModel.ClearTransientWarning(System.String)
Clears the transient warning only if the current state is ElementState.Warning.
If an argument is specified, then the transient warning will be cleared only if it matches the argument value.
If no argument is specified (i.e null or empty value), then the transient warning will be cleared no matter its value.
PersistentWarning warnings will be kept. If no persistent warnings are found, then the default state will be assigned.

Dynamo.Graph.Nodes.NodeModel.SelectDownstreamNeighbours
Recursively selects all nodes downstream to this node

Dynamo.Graph.Nodes.NodeModel.SelectUpstreamNeighbours
Recursively selects all nodes upstream to this node

Dynamo.Graph.Nodes.NodeModel.SelectUpstreamAndDownstreamNeighbours
Recursively selects all nodes upstream and downstream to this node

Dynamo.Graph.Nodes.NodeModel.SetNodeStateBasedOnConnectionAndDefaults
Sets the Dynamo.Graph.Nodes.ElementState for the node based on
the port's default value status and connectivity.

Dynamo.Graph.Nodes.NodeModel.Warning(System.String,System.Boolean)
Set a warning on a node.
p: The warning text.
isPersistent: Is the warning persistent? If true, the warning will not be
cleared when the node is next evaluated and any additional warning messages will be concatenated
to the persistent error message. If false, the warning will be cleared on the next evaluation.

Dynamo.Graph.Nodes.NodeModel.NotifyAstBuildBroken(System.String)
Change the state of node to ElementState.AstBuildBroken and display
"p" in tooltip window.
p:

Dynamo.Graph.Nodes.NodeModel.GetPortVerticalOffset(Dynamo.Graph.Nodes.PortModel)
If a "PortModel.LineIndex" property isn't "-1", then it is a PortModel
meant to match up with a line in code block node. A code block node may
contain empty lines in it, resulting in one PortModel being spaced out
from another one. In such cases, the vertical position of PortModel is
dependent of its "LineIndex".
If a "PortModel.LineIndex" property is "-1", then it is a regular
PortModel. Regular PortModel stacks up on one another with equal spacing,
so their positions are based solely on "PortModel.Index".
portModel: The portModel whose vertical offset is to be computed.
Returns: Returns the offset of the given port from the top of the ports

Dynamo.Graph.Nodes.NodeModel.RegisterInputPorts(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortData})
Reads inputs list and adds ports for each input.

Dynamo.Graph.Nodes.NodeModel.RegisterOutputPorts(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortData})
Reads outputs list and adds ports for each output

Dynamo.Graph.Nodes.NodeModel.GetPortDataFromAttributes(Dynamo.Graph.Nodes.PortType)
Tries to load ports names and descriptions from attributes.
portType: Input or Output port type

Dynamo.Graph.Nodes.NodeModel.ConfigureSnapEdges(System.Collections.Generic.IList{Dynamo.Graph.Nodes.PortModel})
Configures the snap edges.
This class was made protected during refactoring for serialization. When
RegisterInputPorts and RegisterOutputPorts are finally removed, this method
should be called in a collection changed event handler on InPorts and OutPorts.
ports: The ports.

Dynamo.Graph.Nodes.NodeModel.RegisterAllPorts
Updates UI so that all ports reflect current state of node ports.

Dynamo.Graph.Nodes.NodeModel.AddPort(Dynamo.Graph.Nodes.PortType,Dynamo.Graph.Nodes.PortData,System.Int32)
Add a port to this node. If the port already exists, return that port.
portType:
data:
index:
Returns:

Dynamo.Graph.Nodes.NodeModel.PrintExpression
Creates a Scheme representation of this dynNode and all connected dynNodes.
Returns: S-Expression

Dynamo.Graph.Nodes.NodeModel.OnDeserializedMethod(System.Runtime.Serialization.StreamingContext)
The OnDeserializedMethod allows us to set this Node ports' Owner
property after deserialization is complete. This allows us to
avoid having to serialize the Owner property on the PortModel.
context:

Dynamo.Graph.Nodes.NodeModel.OnSave
Called when the node's Workspace has been saved.

Dynamo.Graph.Nodes.NodeModel.RequestValueUpdate(Dynamo.Engine.EngineController)
Call this method to update the cached MirrorData for this NodeModel.
Note this method should be called from scheduler thread.

Dynamo.Graph.Nodes.NodeModel.RequestVisualUpdateAsync(Dynamo.Scheduler.IScheduler,Dynamo.Engine.EngineController,Dynamo.Visualization.IRenderPackageFactory,System.Boolean)
Call this method to asynchronously regenerate render package for
this node. This method accesses core properties of a NodeModel and
therefore is typically called on the main/UI thread.
scheduler: An IScheduler on which the task will be scheduled.
engine: The EngineController which will be used to get MirrorData for the node.
factory: An IRenderPackageFactory which will be used to generate IRenderPackage objects.
forceUpdate: Normally, render packages are only generated when the node's IsUpdated parameter is true.
By setting forceUpdate to true, the render packages will be updated.
Returns: Flag which indicates if geometry update has been scheduled

Dynamo.Graph.Nodes.NodeModel.OnRenderPackageUpdateCompleted(Dynamo.Scheduler.AsyncTask)
This event handler is invoked when UpdateRenderPackageAsyncTask is
completed, at which point the render packages (specific to this node)
become available.
asyncTask: The instance of UpdateRenderPackageAsyncTask
that was responsible of generating the render packages.

Dynamo.Graph.Nodes.NodeModel.RequestRenderPackages


Dynamo.Graph.Nodes.NodeModel.OnRequestRenderPackages
This event handler is invoked when the render packages (specific to this node)
become available and in addition the node requests for associated render packages
if any for example, packages used for associated node manipulators

Dynamo.Graph.Nodes.NodeModel.GetDrawableIdMap
Returns a map of output port GUIDs and drawable Ids as registered
with visualization manager for all the output ports of the given node.
Returns: List of Drawable Ids

Dynamo.Graph.Nodes.NodeModel.GetDrawableId(System.Int32)
Returns the drawable Id as registered with visualization manager for
the given output port on the given node.
outPortIndex: Output port index
Returns: Drawable Id