Dynamo.Extensions.ExtensionLoader
Provides functionality for loading Dynamo's extensions.
This class loads formatted XMLs which contain information about
*Extension.dll and type name of IExtension inheritor.
Example:
..\ExtensionName.dll
Dynamo.ExtensionName.ExtensionTypeName

Dynamo.Extensions.ExtensionLoader.Load(System.String)
Loads Dynamo.Extensions.IExtension from assembly.
extensionPath: Assembly full path
Returns: Loaded Dynamo.Extensions.IExtension

Dynamo.Extensions.ExtensionLoader.LoadDirectory(System.String)
Loads a collection of Dynamo.Extensions.IExtension from given folder
extensionsPath: Assemblies location folder
Returns: Loaded collection of Dynamo.Extensions.IExtension

Dynamo.Extensions.ExtensionLoader.MessageLogged
This event is used for logging messages.

Dynamo.Extensions.ExtensionLoader.ExtensionLoading
An event that is raised when an extension starts loading.

Dynamo.Extensions.ExtensionLoader.DirectoriesToVerifyCertificates
A list of root directories which require extensions to have a signed entry point
File path locations from package definition xml's are validated against this collection