Dynamo.Graph.Nodes.CustomNodes.Function
DesignScript Custom Node instance.

Dynamo.Graph.Nodes.CustomNodes.Function.#ctor(Dynamo.CustomNodeDefinition,System.String,System.String,System.String)
Initializes a new instance of the Dynamo.Graph.Nodes.CustomNodes.Function class.
def: CustomNode definition.
name: Name.
description: Description.
category: Category.

Dynamo.Graph.Nodes.CustomNodes.Function.UpdatePortsForUnresolved(Dynamo.Graph.Nodes.PortModel[],Dynamo.Graph.Nodes.PortModel[])
Initializes ports with default information when the function is unresolved.
inputs: The input nodes for tis function node.
outputs: The output nodes for tis function node.

Dynamo.Graph.Nodes.CustomNodes.Function.FunctionSignature
The unique id of the underlying function.

Dynamo.Graph.Nodes.CustomNodes.Function.FunctionType
It indicates which of the three types of function calls this node represents,
a call to an external graph, a call to a function with a vararg argument,
or a standard function.

Dynamo.Graph.Nodes.CustomNodes.Function.NodeType
The type of node.

Dynamo.Graph.Nodes.CustomNodes.Function.Definition
Returns customNode definition.

Dynamo.Graph.Nodes.CustomNodes.Function.LoadNode(System.Guid,System.Int32,System.Int32)
Complete a definition for a proxy custom node instance
by adding input and output ports as far as we don't have
a corresponding custom node workspace
nodeId: Identifier of the custom node instance
inputs: Number of inputs
outputs: Number of outputs

Dynamo.Graph.Nodes.CustomNodes.Function.ResyncWithDefinition(Dynamo.CustomNodeDefinition)
Validates passed Custom Node definition and synchronizes node with it.
def: Custom Node definition.