Dynamo.Linting.Rules.GraphLinterRule
Base class for creating Graph related linter rules

Dynamo.Linting.Rules.GraphLinterRule.Evaluate(Dynamo.Graph.Workspaces.WorkspaceModel,System.String,Dynamo.Graph.Nodes.NodeModel)
Method to call when this rule needs to be evaluated.
This will use EvaluateFunction(WorkspaceModel, NodeModel) to evaluate the rule.
workspaceModel:
changedEvent:
modifiedNode:

Dynamo.Linting.Rules.GraphLinterRule.EvaluateFunction(Dynamo.Graph.Workspaces.WorkspaceModel,System.String,Dynamo.Graph.Nodes.NodeModel)
Function used to evaluate this rule
workspaceModel:
changedEvent:
modifiedNode:
Returns:

Dynamo.Linting.Rules.GraphLinterRule.InitFunction(Dynamo.Graph.Workspaces.WorkspaceModel)
The init function is used when the Linter extension implementing this Rule is initialized.
workspaceModel:
Returns: