Dynamo.Engine.NodeToCode.INamingProvider
Node to code will create some variables, and if it is able to know the
type of expression, it could give a more meaningful variable prefix.

Dynamo.Engine.NodeToCode.INamingProvider.GetTypeDependentName(ProtoCore.Type)
Returns a name for specified type. This name will be used as the prefix
for variable that created in node to code. It should return a empty
string if fails to generate one.
type:
Returns: