Dynamo.Graph.Nodes.NodeCategoryAttribute
The NodeCategoryAttribute attribute allows the node implementer
to define in which category node will appear.

Dynamo.Graph.Nodes.NodeCategoryAttribute.#ctor(System.String)
Creates NodeCategoryAttribute.
category: Full name of the category. E.g. Core.List.Create

Dynamo.Graph.Nodes.NodeCategoryAttribute.ElementCategory
Full name of the category. E.g. Core.List.Create