Dynamo.Updates.AppVersionInfo
This class returns Dynamo.Updates.BinaryVersion of Dynamo

Dynamo.Updates.AppVersionInfo.Version
Returns current Dynamo version

Dynamo.Updates.AppVersionInfo.VersionInfoURL
Returns URL where one can get information about
current Dynamo version

Dynamo.Updates.AppVersionInfo.InstallerURL
Returns URL where Dynamo installer can be downloaded from

Dynamo.Updates.AppVersionInfo.SignatureURL
Returns URL where signature file to validate the new installer can be downloaded from