Dynamo.Wpf.Interfaces.ILibraryViewCustomization
Provides methods to customize library view

Dynamo.Wpf.Interfaces.ILibraryViewCustomization.SpecificationUpdated
This event is raised when the specification is updated

Dynamo.Wpf.Interfaces.ILibraryViewCustomization.GetSpecification
Gets a copy of the current library layout specification

Dynamo.Wpf.Interfaces.ILibraryViewCustomization.SetSpecification(Dynamo.Wpf.Interfaces.LayoutSpecification)
Sets the given specification as the current library layout
specification by overwriting the current one.
specification: New layout specification

Dynamo.Wpf.Interfaces.ILibraryViewCustomization.ToJSONStream
Serializes the current specification to JSON stream

Dynamo.Wpf.Interfaces.ILibraryViewCustomization.AddSections(System.Collections.Generic.IEnumerable{Dynamo.Wpf.Interfaces.LayoutSection})
Allows clients to add a new section to the layout specification. This
operation will fail if the current specification already contains a
section with the same text as of the given section. The clients must
call AddElements method to add layout elements to a given section.
sections: A list of new sections.
Returns: True if the operation was successful

Dynamo.Wpf.Interfaces.ILibraryViewCustomization.AddElements(System.Collections.Generic.IEnumerable{Dynamo.Wpf.Interfaces.LayoutElement},System.String)
Allows clients to add a list of elements to a given section. This
operation will fail if the text property of any of the child elements
of the given section matches with the text property of the given
elements.
elements: List of layout elements to add
sectionText: The name of the section to be updated
Returns: True if the operation was successful

Dynamo.Wpf.Interfaces.ILibraryViewCustomization.AddIncludeInfo(System.Collections.Generic.IEnumerable{Dynamo.Wpf.Interfaces.LayoutIncludeInfo},System.String)
Allows clients to add a list of layout include info to a given section. This
operation will fail if the path property of any of the includes
of the given section conflicts with the path property of the given
includes.
includes: List of layout include info to add
sectionText: The name of the section to be updated
Returns: True if the operation was successful

Dynamo.Wpf.Interfaces.ILibraryViewCustomization.RegisterResourceStream(System.String,System.IO.Stream)
Registers a given resource stream for a given url. If registered
successfully the requested resource is returned from the given stream.
urlpath: relative path of url including
extension of the resource, e.g. /myicons/xicon.png
resource: resource data stream
Returns: True if the operation was successful

Dynamo.Wpf.Interfaces.ILibraryViewCustomization.OnAppShutdown
This method can be called by host application to notify the aplication
shutdown so that the customization service can do the cleanup of resources.