Dynamo.Graph.Workspaces.PackageDependencyInfo
Class containing info about a workspace package dependency

Dynamo.Graph.Workspaces.PackageDependencyInfo.PackageInfo
PackageInfo for this package

Dynamo.Graph.Workspaces.PackageDependencyInfo.Name
Name of the package

Dynamo.Graph.Workspaces.PackageDependencyInfo.Path
Package path.

Dynamo.Graph.Workspaces.PackageDependencyInfo.Version
Version of the package

Dynamo.Graph.Workspaces.PackageDependencyInfo.IsLoaded
Indicates whether this package is loaded in the current session

Dynamo.Graph.Workspaces.PackageDependencyInfo.State
State of Package Dependency

Dynamo.Graph.Workspaces.PackageDependencyInfo.Nodes
Guids of nodes in the workspace that are dependent on this package

Dynamo.Graph.Workspaces.PackageDependencyInfo.#ctor(System.String,System.Version)
Create a package dependency from the package name and version
name:
version:

Dynamo.Graph.Workspaces.PackageDependencyInfo.#ctor(Dynamo.Graph.Workspaces.PackageInfo)
Create a package dependency from its package info
packageInfo:

Dynamo.Graph.Workspaces.PackageDependencyInfo.AddDependent(System.Guid)
Add the Guid of a dependent node
guid:

Dynamo.Graph.Workspaces.PackageDependencyInfo.Equals(System.Object)
Checks whether two PackageDependencyInfo instances are equal
They are equal if their Name and Versions are equal
obj:
Returns:

Dynamo.Graph.Workspaces.PackageDependencyInfo.GetHashCode
Gets the hashcode for this PackageDependencyInfo
Returns:

Dynamo.Graph.Workspaces.PackageDependencyInfo.ToString
Get the string representing this PackageDependencyInfo
Returns: