Dynamo.Search.SearchElements.CustomNodeSearchElement
Search element for custom nodes.

Dynamo.Search.SearchElements.CustomNodeSearchElement.ID
Returns identifier of the custom node

Dynamo.Search.SearchElements.CustomNodeSearchElement.CreationName
Returns a name using which this node can be created

Dynamo.Search.SearchElements.CustomNodeSearchElement.Path
Path to this custom node in disk, used in the Edit context menu.

Dynamo.Search.SearchElements.CustomNodeSearchElement.#ctor(Dynamo.Graph.Nodes.CustomNodes.ICustomNodeSource,Dynamo.CustomNodeInfo)
Initializes a new instance of the Dynamo.Search.SearchElements.CustomNodeSearchElement class.
customNodeManager: Custom node manager
info: Custom node info

Dynamo.Search.SearchElements.CustomNodeSearchElement.SyncWithCustomNodeInfo(Dynamo.CustomNodeInfo)
Updates the properties of this search element.
info: Actual data of custom node