Dynamo.Engine.LibraryServices.LibraryLoadFailedEventArgs
Contains arguments to pass to a handler when a library load fails

Dynamo.Engine.LibraryServices.LibraryLoadFailedEventArgs.LibraryPath
The path to the library that failed to load

Dynamo.Engine.LibraryServices.LibraryLoadFailedEventArgs.Reason
The reason that the library failed to load

Dynamo.Engine.LibraryServices.LibraryLoadFailedEventArgs.ThrowOnFailure
Indicates if the failure should result in an exception being thrown