Dynamo.Configuration.Context
This specifies the Dynamo Context (RunTime). ex : Revit 2014, Revit 2015 etc.

Dynamo.Configuration.Context.IsUnix
Check if the operating system running Dynamo is
a Unix-based one or not.  This will return true
for both OS X and Linux.
https://stackoverflow.com/questions/5116977/how-to-check-the-os-version-at-runtime-e-g-windows-or-linux-without-using-a-con