Dynamo.Graph.Workspaces.WorkspaceInfo
Contains sufficient data to create a Dynamo.Graph.Workspaces.WorkspaceModel object

Dynamo.Graph.Workspaces.WorkspaceInfo.#ctor
Initializes a new instance of the Dynamo.Graph.Workspaces.WorkspaceInfo class
with default workspace data.

Dynamo.Graph.Workspaces.WorkspaceInfo.FromJsonDocument(System.String,System.String,System.Boolean,System.Boolean,Dynamo.Logging.ILogger,Dynamo.Graph.Workspaces.WorkspaceInfo@)
Return a boolean indicating if successfully deserialized workspace info object from Json file
jsonDoc: Target Josn
path: Target path
isTestMode: Boolean indicating if Dynamo is running in Test Mode
forceManualExecutionMode: Boolean indicating if forcing manual mode
logger: Dynamo logger
workspaceInfo: Return object
Returns: A boolean indicating success

Dynamo.Graph.Workspaces.WorkspaceInfo.Version
Returns version of Dynamo where the workspace was created

Dynamo.Graph.Workspaces.WorkspaceInfo.Description
Returns description of the workspace

Dynamo.Graph.Workspaces.WorkspaceInfo.Category
Returns full category name of custom node

Dynamo.Graph.Workspaces.WorkspaceInfo.X
Returns X coordinate of top left corner of visible workspace part

Dynamo.Graph.Workspaces.WorkspaceInfo.Y
Returns Y coordinate of top left corner of visible workspace part

Dynamo.Graph.Workspaces.WorkspaceInfo.Zoom
Returns zoom value of the workspace

Dynamo.Graph.Workspaces.WorkspaceInfo.ScaleFactor
Returns the scale factor for ProtoGeometry geometries

Dynamo.Graph.Workspaces.WorkspaceInfo.Name
Returns name of the workspace

Dynamo.Graph.Workspaces.WorkspaceInfo.ID
Returns System.Guid identifier string value of custom node workspace

Dynamo.Graph.Workspaces.WorkspaceInfo.FileName
Returns file name of the workspace

Dynamo.Graph.Workspaces.WorkspaceInfo.RunType
Returns run type of the home workspace

Dynamo.Graph.Workspaces.WorkspaceInfo.RunPeriod
Returns run period value of the home workspace if RunType is Periodic

Dynamo.Graph.Workspaces.WorkspaceInfo.HasRunWithoutCrash
Indicates if the workspace was executed successfully at last time

Dynamo.Graph.Workspaces.WorkspaceInfo.IsVisibleInDynamoLibrary
Indicates if the custom node is visible node library

Dynamo.Graph.Workspaces.WorkspaceInfo.IsCustomNodeWorkspace
Indicates whether the workspace is custom node or home workspace