Dynamo.Graph.Annotations.AnnotationModel
This class contains methods and properties used for creating groups in Dynamo.

Dynamo.Graph.Annotations.AnnotationModel.ModelBaseRequested
Triggers when it needs to get the model to add from Workspace

Dynamo.Graph.Annotations.AnnotationModel.InitialTop
Required to calculate the TOP position in a group

Dynamo.Graph.Annotations.AnnotationModel.InitialHeight
Required to calculate the HEIGHT of a group

Dynamo.Graph.Annotations.AnnotationModel.GroupBackground
Returns default background of the group

Dynamo.Graph.Annotations.AnnotationModel.DeletedModelBases
DeletedModelBases is used to keep track of deleted / ungrouped models.
During Undo operations this is used to get those models that are deleted from the group

Dynamo.Graph.Annotations.AnnotationModel.loadFromXML
Indicates if group properties should be read from xml data

Dynamo.Graph.Annotations.AnnotationModel.Width
Returns width of the group

Dynamo.Graph.Annotations.AnnotationModel.Height
Returns the full height of the group.
That means ModelAreaHeight + TextBlockHeight

Dynamo.Graph.Annotations.AnnotationModel.ModelAreaHeight
Returns the height of the area that all
model belonging to this group is encapsulated in.

Dynamo.Graph.Annotations.AnnotationModel.Text
Returns text of the group

Dynamo.Graph.Annotations.AnnotationModel.AnnotationText
Returns title of the group

Dynamo.Graph.Annotations.AnnotationModel.AnnotationDescriptionText
Group description text

Dynamo.Graph.Annotations.AnnotationModel.Background
Returns background of the group

Dynamo.Graph.Annotations.AnnotationModel.Nodes
Returns collection of models (nodes and notes) which the group contains

Dynamo.Graph.Annotations.AnnotationModel.GUID
ID of the AnnotationModel, which is unique within the graph.

Dynamo.Graph.Annotations.AnnotationModel.Rect
Overriding the Rect from Modelbase
This queries the actual RECT of the group.
This is required to make the group as ILocatable.

Dynamo.Graph.Annotations.AnnotationModel.TextBlockHeight
Returns height of the text area of the group

Dynamo.Graph.Annotations.AnnotationModel.TextMaxWidth
Returns the maxWidth of text area of the group

Dynamo.Graph.Annotations.AnnotationModel.FontSize
Returns font size of the text of the group

Dynamo.Graph.Annotations.AnnotationModel.PinnedNode
Optional reference to pinned node
This reference will be used in note serialization
as note is deserialized from an annotation model

Dynamo.Graph.Annotations.AnnotationModel.WidthAdjustment
Adjustment margin to be added to the width of the
group. When set the width of the group will always
be set to Width + widthAdjustment

Dynamo.Graph.Annotations.AnnotationModel.HeightAdjustment
Adjustment margin to be added to the height of the
group. When set the height of the group will always
be set to Height + heightAdjustment

Dynamo.Graph.Annotations.AnnotationModel.IsExpanded
Returns whether or not the group is expanded.

Dynamo.Graph.Annotations.AnnotationModel.GroupState
Indicates whether the group contains nodes that are in an info/warning/error state.
This includes the state of any nodes that are in nested groups.

Dynamo.Graph.Annotations.AnnotationModel.HasNestedGroups
Checks if this group contains any nested groups.

Dynamo.Graph.Annotations.AnnotationModel.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel})
Initializes a new instance of the Dynamo.Graph.Annotations.AnnotationModel class.
nodes: The nodes.
notes: The notes.

Dynamo.Graph.Annotations.AnnotationModel.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Annotations.AnnotationModel})
Initializes a new instance of the Dynamo.Graph.Annotations.AnnotationModel class.
nodes: The nodes that belongs to this group.
notes: The notes that belongs to this group.
groups: The groups that belongs to this group

Dynamo.Graph.Annotations.AnnotationModel.model_Disposed(Dynamo.Graph.ModelBase)
Recalculate the group when a node is disposed
model:

Dynamo.Graph.Annotations.AnnotationModel.UpdateBoundaryFromSelection
Updates the group boundary based on the nodes / notes selection.

Dynamo.Graph.Annotations.AnnotationModel.UpdateErrorAndWarningIconVisibility
Determines whether this group displays warning or error icons in its header.

Dynamo.Graph.Annotations.AnnotationModel.RemovedFromGroup
Fired when this group is removed from its parent group

Dynamo.Graph.Annotations.AnnotationModel.UpdateValueCore(Dynamo.Graph.UpdateValueParams)
Group the Models based on Height and Width
Returns:  the width and height of the last model

Dynamo.Graph.Annotations.AnnotationModel.AddToSelectedModels(Dynamo.Graph.ModelBase,System.Boolean)
This is called when a model is deleted from a group
and UNDO is clicked.
model: The model.
checkOverlap:  checkoverlap determines whether the selected model is
completely inside that group

Dynamo.Graph.Annotations.AnnotationModel.Select
Overriding the Select behavior
because selecting the  group should select the models
within that group

Dynamo.Graph.Annotations.AnnotationModel.Deselect
Overriding the Deselect behavior
because deselecting the  group should deselect the models
within that group

Dynamo.Graph.Annotations.AnnotationModel.ContainsModel(Dynamo.Graph.ModelBase)
Checks if the provided modelbase belongs
to this group.
modelBase: modelbase to check if belongs to this group
Returns:

Dynamo.Graph.Annotations.AnnotationModel.Dispose
Implementation of Dispose method