Dynamo.Wpf.Interfaces.LayoutElementType
Represents the type of the element. Possible values are section,
category, group, create, action, query and none.

Dynamo.Wpf.Interfaces.LayoutElementType.section
Section elements represent the root items on the library view

Dynamo.Wpf.Interfaces.LayoutElementType.category
Category elements represent the root library items contained in section elements.

Dynamo.Wpf.Interfaces.LayoutElementType.group
Groups comes directly under its parent category, it contains just text without icon

Dynamo.Wpf.Interfaces.LayoutElementType.create
Elements of this type result in library items that get clubbed under the Create cluster

Dynamo.Wpf.Interfaces.LayoutElementType.action
Elements of this type result in library items that get clubbed under the Action cluster

Dynamo.Wpf.Interfaces.LayoutElementType.query
Elements of this type result in library items that get clubbed under the Query cluster

Dynamo.Wpf.Interfaces.LayoutElementType.none
All other expandable library items that are not categories or groups

Dynamo.Wpf.Interfaces.LayoutElementType.classType
classType comes directly under its parent category, it contains just text without icon