Dynamo.Graph.Nodes.ZeroTouch.DSVarArgFunction
DesignScript var-arg function node. All functions from DesignScript share the
same function node but internally have different procedure.

Dynamo.Graph.Nodes.ZeroTouch.DSVarArgFunction.FunctionSignature
The function name with required parameters.

Dynamo.Graph.Nodes.ZeroTouch.DSVarArgFunction.FunctionType
It indicates which of the three types of function calls this node represents,
a call to an external graph, a call to a function with a vararg argument,
or a standard function.

Dynamo.Graph.Nodes.ZeroTouch.DSVarArgFunction.#ctor(Dynamo.Engine.FunctionDescriptor)
Initializes a new instance of the Dynamo.Graph.Nodes.ZeroTouch.DSVarArgFunction class.
descriptor: Function descritor.

Dynamo.Graph.Nodes.ZeroTouch.DSVarArgFunction.NodeType
The NodeType property provides a name which maps to the
server type for the node. This property should only be
used for serialization.

Dynamo.Graph.Nodes.ZeroTouch.DSVarArgFunction.defaultNumInputs
Returns the default number of inputs for the node

Dynamo.Graph.Nodes.ZeroTouch.DSVarArgFunction.VarInputController
Custom VariableInput controller for DSVarArgFunctions.