Dynamo.Logging.NotificationMessage
Class representing a notification that a host Application intends to send
to a Dynamo user.

Dynamo.Logging.NotificationMessage.Sender
The sender of this notification.

Dynamo.Logging.NotificationMessage.Title
The title of the notification message.

Dynamo.Logging.NotificationMessage.ShortMessage
A short message that is displayed to inform the user
briefly for the reason of the notification

Dynamo.Logging.NotificationMessage.DetailedMessage
a more detailed message that displayed

Dynamo.Logging.NotificationMessage.#ctor(System.String,System.String,System.String,System.String)
Constructor for a NotificationMessage
sender:
shortMessage:
detailedMessage:
title: