Dynamo.Interfaces.IDynamoModel
Interface contains definitions for core model of Dynamo.

Dynamo.Interfaces.IDynamoModel.Workspaces
Represents the Workspaces in Dynamo.

Dynamo.Interfaces.IDynamoModel.CurrentWorkspace
Represents the current workspace.

Dynamo.Interfaces.IDynamoModel.WorkspaceCleared
This event is fired when workspace is cleared.

Dynamo.Interfaces.IDynamoModel.ShutdownStarted
This event is fired when Dynamo is shutting down.

Dynamo.Interfaces.IDynamoModel.EvaluationCompleted
This event is fired when graph evaluation is completed.

Dynamo.Interfaces.IDynamoModel.WorkspaceAdded
This event is fired when a new workspace is added.

Dynamo.Interfaces.IDynamoModel.WorkspaceRemoved
This event is fired when a workspace is removed.

Dynamo.Interfaces.IDynamoModel.WorkspaceOpening
This event is fired when a workspace is opened.