Dynamo.Models.DynamoModel.CreateAndConnectNodeCommand
A command used to create a new upstream/downstream node and connect
it to an existing node in a single step

Dynamo.Models.DynamoModel.CreateAndConnectNodeCommand.#ctor(System.Guid,System.Guid,System.String,System.Int32,System.Int32,System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean)
Creates a new CreateAndConnectNodeCommand with the given inputs
newNodeGuid:
existingNodeGuid:
newNodeName: The name of node to create
outPortIndex:
inPortIndex:
x:
y:
createAsDownstreamNode:
new node to be created as downstream or upstream node wrt the existing node
addNewNodeToSelection: select the new node after it is created by default
reuseUndoRedoGroup: Skip creating new undo action group and reuse existing one if true.

Dynamo.Models.DynamoModel.CreateAndConnectNodeCommand.#ctor(System.Guid,System.Guid,System.String,System.Int32,System.Int32,System.Double,System.Double,System.Boolean,System.Boolean)
Creates a new CreateAndConnectNodeCommand with the given inputs
newNodeGuid:
existingNodeGuid:
newNodeName: The name of node to create
outPortIndex:
inPortIndex:
x:
y:
createAsDownstreamNode:
new node to be created as downstream or upstream node wrt the existing node
addNewNodeToSelection: select the new node after it is created by default