Dynamo.Engine.ILibraryCustomizationServices
Provides access to library customization objects

Dynamo.Engine.ILibraryCustomizationServices.GetLibraryCustomization(System.String)
Call this method to obtain the corresponding LibraryCustomization object
for a given assembly path.
assemblyPath: Path of assembly for which LibraryCustomization
object is to be obtained.
Returns: Returns the corresponding LibraryCustomization object if one is
found, or null otherwise.