Dynamo.Wpf.Interfaces.LayoutIncludeInfo
Represents the information about the data type that needs to be included
under a given LayoutElement.

Dynamo.Wpf.Interfaces.LayoutIncludeInfo.#ctor
Default constructor

Dynamo.Wpf.Interfaces.LayoutIncludeInfo.path
Partial or full namespace to be included under a given layout element

Dynamo.Wpf.Interfaces.LayoutIncludeInfo.iconUrl
Relative or absolute URL of the icon for the corresponding library item

Dynamo.Wpf.Interfaces.LayoutIncludeInfo.inclusive
Checks if a new category to be created for its path. If the include
path is "A.B.C" under an element say "Root" and for two nodes
fully qualified name is "A.B.C.D" and "A.B.C.E", then by default
inclusive is true that means there we will get a category "C" under
"Root" element as parent and "D" and "E" as children. If inclusive
is false then both "D" and "E" will be direct children of "Root" and
there won't be any intermediate element "C".