Dynamo.Graph.Nodes.NodeOutputData
Represents a node which acts as a UI output for the graph
- may also hold a value for that output

Dynamo.Graph.Nodes.NodeOutputData.Id
The id of the node.

Dynamo.Graph.Nodes.NodeOutputData.Name
Display name of the output node.

Dynamo.Graph.Nodes.NodeOutputData.Type
The type of output this node is.

Dynamo.Graph.Nodes.NodeOutputData.InitialValue
The value of the output when the graph was saved.
This should always be a string for all types.

Dynamo.Graph.Nodes.NodeOutputData.IntitialValue
Obsolete property due to typo in API.  Please use InitialValue.

Dynamo.Graph.Nodes.NodeOutputData.Description
Description displayed to user of this output node.