Dynamo.Library.ILibraryLoader
Exposes (use cref) LoadNodeLibrary method. Specify the usage of LoadNodeLibrary

Dynamo.Library.ILibraryLoader.LoadNodeLibrary(System.Reflection.Assembly)
Loads node's library