Dynamo.Graph.Workspaces.ConnectorConverter
The ConnectorConverter is used to serialize and deserialize ConnectorModels.
The Start and End of a ConnectorModel are references to PortModels, but
we want the serialized representation of a Connector to reference these
ports by Id. This converter resolves the reference to the correct NodeModel
instance by id, and constructs the ConnectorModel.

Dynamo.Graph.Workspaces.ConnectorConverter.#ctor(Dynamo.Logging.ILogger)
Constructs a ConnectorConverter.
logger: