Dynamo.Graph.Nodes.UIDispatcherEventArgs
This class represents the UIDIspatcher thread event arguments.

Dynamo.Graph.Nodes.UIDispatcherEventArgs.#ctor(System.Action)
Creates UIDispatcherEventArgs.
a: action to call on UI thread

Dynamo.Graph.Nodes.UIDispatcherEventArgs.ActionToDispatch
Action to call on UI thread.