Dynamo.Configuration.Configurations
This class contains properties that are used in Dynamo.

Dynamo.Configuration.Configurations.FallbackUiCulture
User interface culture

Dynamo.Configuration.Configurations.BackupFolderName
Name of backup folder

Dynamo.Configuration.Configurations.FilePathAttribName
Name of XML attribute which contains target file path.

Dynamo.Configuration.Configurations.DoubleSliderTextBoxWidth
Default width of Double Slider

Dynamo.Configuration.Configurations.IntegerSliderTextBoxWidth
Default width of Integer Slider

Dynamo.Configuration.Configurations.MaxWatchNodeWidth
Maximum width of Watch Node

Dynamo.Configuration.Configurations.MaxWatchNodeHeight
Maximum height of Watch Node

Dynamo.Configuration.Configurations.DynamoSiteLink
Link to Dynamo site

Dynamo.Configuration.Configurations.DynamoWikiLink
Link to Dynamo wiki

Dynamo.Configuration.Configurations.DynamoBimForum
Link to Dynamo forum

Dynamo.Configuration.Configurations.DynamoTeamEmail
DynamoTeam email

Dynamo.Configuration.Configurations.DynamoVideoTutorials
Link to Dynamo video tutorials

Dynamo.Configuration.Configurations.DynamoDictionary
Link to Dynamo dictionary

Dynamo.Configuration.Configurations.DynamoPrimer
Link to Dynamo primer

Dynamo.Configuration.Configurations.DynamoDownloadLink
Link to Dynamo download page

Dynamo.Configuration.Configurations.GitHubDynamoLink
Link to Dynamo's github repo

Dynamo.Configuration.Configurations.GitHubBugReportingLink
Link to Dynamo's issues on github

Dynamo.Configuration.Configurations.PortHeightInPixels
Generic Constants

Dynamo.Configuration.Configurations.ZoomIncrement
Canvas Control

Dynamo.Configuration.Configurations.MinTabsBeforeClipping
Count of tabs before clipping

Dynamo.Configuration.Configurations.TabControlMenuWidth
Default width of Tab control menu

Dynamo.Configuration.Configurations.TabDefaultWidth
Default width of tab

Dynamo.Configuration.Configurations.ExtensionsSideBarTabMinWidth
Minimum width of tab in the extensions side bar

Dynamo.Configuration.Configurations.MaxOpacity
Maximal opacity of bubble

Dynamo.Configuration.Configurations.CodeBlockPortHeightInPixels
Default height of CodeBlock's port. Now obsolete.
Inputs height are set in the normal way, outputs height is set to CodeBlockOutputPortHeightInPixels

Dynamo.Configuration.Configurations.CodeBlockOutputPortHeightInPixels
Code Block outputs have a condensed port height

Dynamo.Configuration.Configurations.CBNMaxPortNameLength
Maximal port name length of CodeBlock

Dynamo.Configuration.Configurations.HighlightingFile
Highlighting File

Dynamo.Configuration.Configurations.NodeStartZIndex
Start ZIndex for nodes is set to 3, because 1 is for groups, 2 is for connectors.

Dynamo.Configuration.Configurations.BackupFileNamePrefix
Default backup file name prefix