Dynamo.Graph.ModelBase
Base class for all objects with which user can interact in Dynamo.

Dynamo.Graph.ModelBase.Disposed
Fired when this Model is disposed.

Dynamo.Graph.ModelBase.DeletionStarted
Fired when this Model is about to be deleted. Operation can be cancelled by setting the Cancel flag on the args object to true.

Dynamo.Graph.ModelBase.CenterX
X coordinate of center point.

Dynamo.Graph.ModelBase.CenterY
Y coordinate of center point.

Dynamo.Graph.ModelBase.X
The X coordinate of the node in canvas space.

Dynamo.Graph.ModelBase.ShouldSerializeX
Override in derived classes to specify whether
to serialize the X property.

Dynamo.Graph.ModelBase.Y
The Y coordinate of the node in canvas space.

Dynamo.Graph.ModelBase.ShouldSerializeY
Override in derived classes to specify whether
to serialize the Y property.

Dynamo.Graph.ModelBase.Position
A position defined by the x and y components.
Used for notification in situations where you don't
want to have property notifications for X and Y

Dynamo.Graph.ModelBase.Height
The height of the object.

Dynamo.Graph.ModelBase.Width
The width of the object.

Dynamo.Graph.ModelBase.Rect
The bounds of the object.

Dynamo.Graph.ModelBase.IsSelected
Returns true if the object is selected otherwise false.

Dynamo.Graph.ModelBase.GUID
Unique ID.

Dynamo.Graph.ModelBase.#ctor
Protected constructor.

Dynamo.Graph.ModelBase.Select
This method sets the isSelected property on the object to true.
E.g. when user clicks on node.

Dynamo.Graph.ModelBase.Deselect
This method sets the isSelected property on the object to false.
E.g. when user clicks on canvas.

Dynamo.Graph.ModelBase.ReportPosition
Notifies listeners that the position of the object has changed,
then all dependant objects will also redraw themselves.

Dynamo.Graph.ModelBase.SetSize(System.Double,System.Double)
Set the width and the height of the node model
and report once.
w: Width
h: Height

Dynamo.Graph.ModelBase.Dispose
Invokes Dispose on the object.

Dynamo.Graph.ModelBase.OnDeletionStarted(System.ComponentModel.CancelEventArgs)
Invokes the DeletionStarted event on this object.

Dynamo.Graph.ModelBase.UpdateValue(Dynamo.Graph.UpdateValueParams)
Updates object properties.
UpdateValueCore is overridden in derived classes.
updateValueParams: Please see UpdateValueParams for details.
Returns: Returns true if the call has been handled, or false otherwise.

Dynamo.Graph.ModelBase.HandleModelEvent(System.String,System.Int32,Dynamo.Core.UndoRedoRecorder)
This method is currently used as a way to send an event to ModelBase
derived objects. Its primary use is in DynamoNodeButton class, which
sends this event when clicked, to change the number of ports in a
VariableInputNode.
eventName: The name of the event.
value: For the SetInPortCount event, the number of
ports desired.  Ignored for other events.
recorder:
Returns: Returns true if the call has been handled, or false otherwise.

Dynamo.Graph.ModelBase.UpdateValueCore(Dynamo.Graph.UpdateValueParams)
This method is supplied as a generic way for command framework to update
a given named-value in a ModelBase (which has to work under both user
and playback scenarios). During playback, the command framework issues
pre-recorded UpdateModelValueCommand that targets a model. Since there
is no data-binding at play here, there will not be IValueConverter. This
method takes only string input (the way they appear in DynamoTextBox),
which overridden method can use for value conversion.
updateValueParams: Please see UpdateValueParams for details.
Returns: Returns true if the call has been handled, or false otherwise.

Dynamo.Graph.ModelBase.Serialize(System.Xml.XmlDocument,Dynamo.Graph.SaveContext)
Serialize model into xml node.
xmlDocument: Xml document
context: Context in which object is saved
Returns: xml node

Dynamo.Graph.ModelBase.Deserialize(System.Xml.XmlElement,Dynamo.Graph.SaveContext)
Deserialize model from xml node.
element: Xml node
context: Save context. E.g. save in file, copy node etc.

Dynamo.Graph.ModelBase.MessageLogged
This event is fired when a message is logged.