Dynamo.Core.CustomNodeManager
Manages instantiation of custom nodes.  All custom nodes known to Dynamo should be stored
with this type.  This object implements late initialization of custom nodes by providing a
single interface to initialize custom nodes.

Dynamo.Core.CustomNodeManager.#ctor(Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,Dynamo.Migration.MigrationManager,Dynamo.Engine.LibraryServices)
This function creates CustomNodeManager
nodeFactory: NodeFactory
migrationManager: MigrationManager
libraryServices: LibraryServices

Dynamo.Core.CustomNodeManager.LoadedDefinitions
CustomNodeDefinitions for all loaded custom nodes, in load order.

Dynamo.Core.CustomNodeManager.NodeInfos
Registry of all NodeInfos corresponding to discovered custom nodes. These
custom nodes are not all necessarily initialized.

Dynamo.Core.CustomNodeManager.LoadedWorkspaces
All loaded custom node workspaces.

Dynamo.Core.CustomNodeManager.GetWorkspaceById(System.Guid)
Returns custom node workspace by a specified custom node ID
customNodeId: Custom node ID of a requested workspace
Returns: Custom node workspace by a specified ID

Dynamo.Core.CustomNodeManager.DefinitionUpdated
An event that is fired when a definition is updated

Dynamo.Core.CustomNodeManager.InfoUpdated
An event that is fired when new or updated info is available for
a custom node.

Dynamo.Core.CustomNodeManager.CustomNodeRemoved
An event that is fired when a custom node is removed from Dynamo.

Dynamo.Core.CustomNodeManager.CreateCustomNodeInstance(System.Guid,System.String,System.Boolean)
Creates a new Custom Node Instance.
id: Identifier referring to a custom node definition.
name:
Name for the custom node to be instantiated, used for error recovery if
the given id could not be found.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
Returns: Custom Node Instance

Dynamo.Core.CustomNodeManager.TryGetCustomNodeData(System.Guid,System.String,System.Boolean,Dynamo.CustomNodeDefinition@,Dynamo.CustomNodeInfo@)
Attempts to get custom node info and definition data.
id: Identifier referring to a custom node definition.
name:
Name for the custom node to be instantiated, used for error recovery if
the given id could not be found.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
def:
Custom node definition data
info:
Custom node information data

Dynamo.Core.CustomNodeManager.CreateCustomNodeInstance(System.Guid,System.String,System.Boolean,Dynamo.CustomNodeDefinition,Dynamo.CustomNodeInfo)
Creates a new Custom Node Instance.
id: Identifier referring to a custom node definition.
name:
Name for the custom node to be instantiated, used for error recovery if
the given id could not be found.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
def:
Custom node definition data
info:
Custom node information data
Returns: Custom Node Instance

Dynamo.Core.CustomNodeManager.GuidFromPath(System.String)
Returns a function id from a guid assuming that the file is already loaded.
path:
Returns:

Dynamo.Core.CustomNodeManager.AddUninitializedCustomNode(System.String,System.Boolean,Dynamo.CustomNodeInfo@)
Import a dyf file for eventual initialization.
file: Path to a custom node file on disk.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
info:
If the info was successfully processed, this parameter will be set to
it. Otherwise, it will be set to null.
Returns: True on success, false if the file could not be read properly.

Dynamo.Core.CustomNodeManager.Remove(System.Guid)
Attempts to remove all traces of a particular custom node from Dynamo, assuming the node is not in a loaded workspace.
guid: Custom node identifier.

Dynamo.Core.CustomNodeManager.Uninitialize(System.Guid)
Uninitialized a custom node. The information for the node is still retained, but the next time
the node is queried for it's workspace / definition / an instace it will be re-initialized from
disk.
guid: Custom node identifier.

Dynamo.Core.CustomNodeManager.AddUninitializedCustomNodesInPath(System.String,System.Boolean,System.Boolean)
Scans the given path for custom node files, retaining their information in the manager for later
potential initialization.
path: Path on disk to scan for custom nodes.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
isPackageMember:
Indicates whether custom node comes from package or not.
Returns:

Dynamo.Core.CustomNodeManager.AddUninitializedCustomNodesInPath(System.String,System.Boolean,Dynamo.Graph.Workspaces.PackageInfo)
Scans the given path for custom node files, retaining their information in the manager for later
potential initialization. Should be used when packages load or reload customNodes.
path: Path on disk to scan for custom nodes.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
packageInfo:
Info about the package that requested this customNode to be loaded or to which the customNode belongs.
Is PackageMember property will be true if this property is not null.
Returns:

Dynamo.Core.CustomNodeManager.ScanNodeHeadersInDirectory(System.String,System.Boolean)
Enumerates all of the files in the search path and get's their guids.
Does not instantiate the nodes.
Returns: False if SearchPath is not a valid directory, otherwise true

Dynamo.Core.CustomNodeManager.SetNodeInfo(Dynamo.CustomNodeInfo)
Stores the path and function definition without initializing a node.
Overwrites the existing NodeInfo if necessary!

Dynamo.Core.CustomNodeManager.TryGetFunctionWorkspace(System.Guid,System.Boolean,Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel@)
Returns the function workspace from a guid
id: The unique id for the node.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
ws:
Returns: The path to the node or null if it wasn't found.

Dynamo.Core.CustomNodeManager.TryGetFunctionWorkspace(System.Guid,System.Boolean,Dynamo.Graph.Workspaces.ICustomNodeWorkspaceModel@)
Returns the function workspace.
id: The identifier.
isTestMode: if set to true [is test mode].
ws: The workspace.
Returns: Boolean indicating if Custom Node Workspace defination is loaded.

Dynamo.Core.CustomNodeManager.TryGetFunctionDefinition(System.Guid,System.Boolean,Dynamo.CustomNodeDefinition@)
Returns the function definition from a guid.
id: Custom node identifier.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
definition:
Returns: Boolean indicating if Custom Node Workspace defination is loaded.

Dynamo.Core.CustomNodeManager.Contains(System.Guid)
Returns true if the custom node's unique identifier is inside of the manager (initialized or not)
guid: The FunctionId

Dynamo.Core.CustomNodeManager.Contains(System.String)
Returns true if the custom node's name is inside the manager (initialized or not)
name: The name of the custom node.

Dynamo.Core.CustomNodeManager.IsInitialized(System.String)
Indicates whether the custom node is initialized in the manager
name: The name of the node
Returns: The name of the

Dynamo.Core.CustomNodeManager.IsInitialized(System.Guid)
Indicates whether the custom node is initialized in the manager
guid: Whether the definition is stored with the manager.

Dynamo.Core.CustomNodeManager.TryGetInfoFromPath(System.String,System.Boolean,Dynamo.CustomNodeInfo@)
Returns a boolean indicating if successfully get a CustomNodeInfo object from a workspace path
path: The path from which to get the guid
isTestMode:
Flag specifying whether or not this should operate in "test mode".
info:
Returns: The custom node info object - null if we failed

Dynamo.Core.CustomNodeManager.OpenCustomNodeWorkspace(System.Xml.XmlDocument,Dynamo.Graph.Workspaces.WorkspaceInfo,System.Boolean,Dynamo.Graph.Workspaces.WorkspaceModel@)
Opens a Custom Node workspace from an XmlDocument, given a pre-constructed WorkspaceInfo.
workspaceInfo: Workspace header describing the custom node file.
xmlDoc: Xml content of workspace
isTestMode:
Flag specifying whether or not this should operate in "test mode".
workspace:
Returns: Boolean indicating if Custom Node Workspace opened.

Dynamo.Core.CustomNodeManager.InitializeCustomNode(System.Guid,System.Boolean,Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel@)
Deserialize a function definition from a given path.  A side effect of this function is that
the node is added to the dictionary of loadedNodes.
functionId: The function guid we're currently loading
isTestMode:
workspace: The resultant function definition
Returns: Boolean indicating if Custom Node initialized.

Dynamo.Core.CustomNodeManager.CreateCustomNode(System.String,System.String,System.String,System.Nullable{System.Guid})
Creates a new Custom Node in the manager.
name: Name of the custom node.
category: Category for the custom node.
description: Description of the custom node.
functionId:
Optional identifier to be used for the custom node. By default, will make a new unique one.
Returns: Newly created Custom Node Workspace.

Dynamo.Core.CustomNodeManager.TryGetNodeInfo(System.Guid,Dynamo.CustomNodeInfo@)
Attempts to retrieve information for the given custom node identifier.
id: Custom node identifier.
info:
Returns: Success or failure.

Dynamo.Core.CustomNodeManager.TryGetNodeInfo(System.String,Dynamo.CustomNodeInfo@)
Attempts to retrieve information for the given custom node name. If there are multiple
custom nodes matching the given name, this method will return any one of them.
name: Name of a custom node.
info:
Returns:

Dynamo.Core.CustomNodeManager.Collapse(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel},Dynamo.Graph.Workspaces.WorkspaceModel,System.Boolean,Dynamo.Models.FunctionNamePromptEventArgs)
Collapse a set of nodes in a given workspace.
selectedNodes:  The function definition for the user-defined node
selectedNotes:  The note models in current selection
currentWorkspace:  The workspace where
isTestMode:
args:

Dynamo.Core.CustomNodeManager.Dispose
Call this method to uninitialize all loaded custom node functions.