Dynamo.Updates.IDisableUpdateConfig
This interface represents configuration properties for Disable Update.

Dynamo.Updates.IDisableUpdateConfig.DisableUpdates
Specifies whether to disable update, default value is false.