Dynamo.Models.NodeModelAssemblyLoader
This class is responsible for loading types that derive
from NodeModel. For information about package loading see the
PackageLoader. For information about loading other libraries,
see LibraryServices.

Dynamo.Models.NodeModelAssemblyLoader.LoadedAssemblyNames
Used at startup to avoid reloading NodeModels from assemblies that have already been loaded.
Is NOT kept in sync with latest loaded assemblies - use LoadedAssemblies Property for that.

Dynamo.Models.NodeModelAssemblyLoader.LoadedAssemblies
All assemblies that have been loaded into Dynamo.

Dynamo.Models.NodeModelAssemblyLoader.AssemblyLoaded
Event fired when a new assembly is loaded.

Dynamo.Models.NodeModelAssemblyLoader.LoadNodeModelsAndMigrations(System.Collections.Generic.IEnumerable{System.String},System.String,System.Collections.Generic.List{Dynamo.Graph.Nodes.TypeLoadData}@,System.Collections.Generic.List{Dynamo.Graph.Nodes.TypeLoadData}@)
Load all types which inherit from NodeModel whose assemblies are located in
the bin/nodes directory. Add the types to the searchviewmodel and
the controller's dictionaries.
nodeDirectories: Directories that contain node assemblies.
context:
modelTypes:
migrationTypes:

Dynamo.Models.NodeModelAssemblyLoader.IsNodeSubType(System.Type)
Determine if a Type is a node.  Used by LoadNodesFromAssembly to figure
out what nodes to load from other libraries (.dlls).
The type
Returns: True if the type is node.

Dynamo.Models.NodeModelAssemblyLoader.LoadNodesFromAssembly(System.Reflection.Assembly,System.String,System.Collections.Generic.List{Dynamo.Graph.Nodes.TypeLoadData},System.Collections.Generic.List{Dynamo.Graph.Nodes.TypeLoadData})
Enumerate the types in an assembly and add them to DynamoController's
dictionaries and the search view model.  Internally catches exceptions and sends the error
to the console.
The list of node types loaded from this assembly