Dynamo.Updates.UpdateManagerConfiguration
Specifies Update Manager Configuration settings.

Dynamo.Updates.UpdateManagerConfiguration.DownloadSourcePath
Specifies download location for new installer

Dynamo.Updates.UpdateManagerConfiguration.SignatureSourcePath
Specifies location for signature file to validate the new installer.

Dynamo.Updates.UpdateManagerConfiguration.CheckNewerDailyBuild
Specifies whether to consider daily builds for update, default is false.

Dynamo.Updates.UpdateManagerConfiguration.ForceUpdate
Specifies whether to force update, default value is false.

Dynamo.Updates.UpdateManagerConfiguration.InstallerNameBase
Returns the base name of the installer to be used for upgrade.

Dynamo.Updates.UpdateManagerConfiguration.ConfigFilePath
Return file path for the overriding config file.

Dynamo.Updates.UpdateManagerConfiguration.DisableUpdates
Specifies whether to disable update, default value is false.

Dynamo.Updates.UpdateManagerConfiguration.#ctor
Default constructor

Dynamo.Updates.UpdateManagerConfiguration.Load(System.String,Dynamo.Updates.IUpdateManager)
Loads the configurations from given xml file.
filePath: Xml file path that contains configuration details.
updateManager: IUpdateManager object which can log errors during loading.
Returns: Loaded UpdateManagerConfiguration.

Dynamo.Updates.UpdateManagerConfiguration.Save(System.String,Dynamo.Updates.IUpdateManager)
Saves this configuration to a given file in xml format.
filePath: File path to save this configuration.
updateManager: IUpdateManager object which can log errors during saving.

Dynamo.Updates.UpdateManagerConfiguration.GetSettings(Dynamo.Updates.IDynamoLookUp,Dynamo.Updates.IUpdateManager)
Utility method to get the settings
lookUp: IDynamoLookUp instance
updateManager: IUpdateManager object which can log errors during saving.
Returns: Update Manager Configuration settings object

Dynamo.Updates.UpdateManagerConfiguration.TryGetConfigFilePath(System.String@)
Returns the update manager config file path.
filePath: Full path for the config file
Returns: True if file exists.

Dynamo.Updates.UpdateManagerConfiguration.DynamoLookUp
IDynamoLookUp object to get installed Dynamo versions