Dynamo.Configuration.WindowStatus
Possible status of a floating window.

Dynamo.Configuration.WindowStatus.Normal
The window can be moved and resized.

Dynamo.Configuration.WindowStatus.Maximized
The window is maximized.