Dynamo.Interfaces.BackgroundPreviewActiveState
Represents data about active state of preview background

Dynamo.Interfaces.BackgroundPreviewActiveState.Name
Name of background preview

Dynamo.Interfaces.BackgroundPreviewActiveState.IsActive
Flag which indicates if background preview is active

Dynamo.Interfaces.BackgroundPreviewActiveState.#ctor
Initializes a new instance of  class