Dynamo.Models.DynamoModel.DragSelectionCommand.Operation
The operation to perform.

Dynamo.Models.DynamoModel.DragSelectionCommand.Operation.BeginDrag
Begin dragging.

Dynamo.Models.DynamoModel.DragSelectionCommand.Operation.EndDrag
End dragging.