Dynamo.CustomNodeInfo
Basic information about a custom node.

Dynamo.CustomNodeInfo.#ctor(System.Guid,System.String,System.String,System.String,System.String,System.Boolean)
This function creates CustomNodeInfo.
functionId: Custom node unique ID
name: Custom node name
category: Custom node category
description: Custom node description
path: Path to custom node
isVisibleInDynamoLibrary: Bool value controls the visibility in library search

Dynamo.CustomNodeInfo.FunctionId
Returns custom node unique ID

Dynamo.CustomNodeInfo.Name
Returns custom node name

Dynamo.CustomNodeInfo.Category
Returns custom node category

Dynamo.CustomNodeInfo.Description
Returns custom node description

Dynamo.CustomNodeInfo.Path
Returns path to custom node

Dynamo.CustomNodeInfo.IsPackageMember
Indicates if custom node is part of the package.
If true, then custom node is part of package manager.

Dynamo.CustomNodeInfo.IsVisibleInDynamoLibrary
Indicates if custom node is part of the library search.
If true, then custom node is part of library search.

Dynamo.CustomNodeInfo.PackageInfo
Only valid if IsPackageMember is true.
Can be used to identify which package
requested this CustomNode to load.