Dynamo.Search.BrowserInternalElement
This class represents internal elements of browser item

Dynamo.Search.BrowserInternalElement.Items
The items inside of the browser item

Dynamo.Search.BrowserInternalElement.Siblings
Returns items which are in the same category as the browser item

Dynamo.Search.BrowserInternalElement.Parent
Returns browser item representing category which this element belongs to

Dynamo.Search.BrowserInternalElement.OldParent
Returns previous parent item

Dynamo.Search.BrowserInternalElement.Name
Returns name of the node

Dynamo.Search.BrowserInternalElement.FullCategoryName
Returns full category name consisting of root and all sub categories names

Dynamo.Search.BrowserInternalElement.#ctor(System.String,Dynamo.Search.BrowserItem)
Initializes a new instance of the Dynamo.Search.BrowserInternalElement class.
name: Name of element.
parent: Parent element.