Dynamo.Scheduler.AsyncTask
This is the base class for async tasks, that are running on Dynamo Scheduler.

Dynamo.Scheduler.AsyncTask.scheduler
Dynamo Scheduler.

Dynamo.Scheduler.AsyncTask.Priority
DynamoScheduler sorts tasks based on two key factors: the priority of
a task, and the relative importance between two tasks that have the
same priority. During task re-prioritizing process, DynamoScheduler
first sorts the tasks in accordance to their AsyncTask.Priority
property. The resulting ordered list is then sorted again by calling
AsyncTask.Compare method to determine the relative importance among
tasks having the same priority.

Dynamo.Scheduler.AsyncTask.Completed
This event is raised when the AsyncTask is completed, in the context of ISchedulerThread,
any UI element access that is needed should be dispatched onto the UI dispatcher.

Dynamo.Scheduler.AsyncTask.Discarded
Raised if the AsyncTask is discarded by an IScheduler and will not be executed

Dynamo.Scheduler.AsyncTask.#ctor(Dynamo.Scheduler.IScheduler)
Constructs an instance of AsyncTask object.
scheduler: A reference to the DynamoScheduler, this
parameter cannot be null.

Dynamo.Scheduler.AsyncTask.MarkTaskAsScheduled
This method is invoked when DynamoScheduler places this AsyncTask
into its internal task queue. This method is only meant to be used
internally by the DynamoScheduler.

Dynamo.Scheduler.AsyncTask.CanMergeWith(Dynamo.Scheduler.AsyncTask)
This method is called by DynamoScheduler when it compacts the task
queue. The result of this call indicates if either of the tasks in
comparison should be dropped from the task queue, or both should be
kept. Tasks that are discarded during this phase will not be executed.
otherTask: Another task to compare with.
Returns: Returns the comparison result. See Comparison enumeration
for details of the possible values.

Dynamo.Scheduler.AsyncTask.Compare(Dynamo.Scheduler.AsyncTask)
Call this method to determine the relative priority of two AsyncTask
objects. DynamoScheduler makes use of this method to determine the
order in which AsyncTask objects are sorted in its internal task queue.
otherTask: A task to compare this task with.
Returns: Returns -1 if this AsyncTask object should be processed
before the other AsyncTask; returns 1 if this AsyncTask object should
be processed after the other AsyncTask; or 0 if both AsyncTask objects
have the same priority and can be processed in the current order.

Dynamo.Scheduler.AsyncTask.Execute
This method is called when the SchedulerThread decides to execute a
scheduled AsyncTask in the task queue. Derived tasks overrides
ExecuteCore method to perform relevant operations. This method is
invoked in the context of the SchedulerThread and not the main thread.
Returns: Returns true if execution was successful, or false if an
exception was thrown.

Dynamo.Scheduler.AsyncTask.HandleTaskCompletion
This method is called by DynamoScheduler after AsyncTask.Execute
method returns. It is guaranteed to be called even when exception
is thrown from within AsyncTask.Execute.