Dynamo.Logging.LogEventArgs
Represents Event arguments that are passed to log event handler.

Dynamo.Logging.LogEventArgs.Message
The message to be logged.

Dynamo.Logging.LogEventArgs.Level
The log level at which to log the message.

Dynamo.Logging.LogEventArgs.#ctor(System.String,Dynamo.Logging.LogLevel)
Creates LogEventArgs based on log message.
message: String message.
level: Level, where message can be logged.

Dynamo.Logging.LogEventArgs.#ctor(System.Exception,Dynamo.Logging.LogLevel)
Creates LogEventArgs based on exception.
e: Exception.
level: Level, where exception message and stack trace can be logged.