Dynamo.Engine.LibraryServices
LibraryServices is a singleton class which manages builtin libraries
as well as imported libraries. It is across different sessions.

Dynamo.Engine.LibraryServices.LibraryManagementCore
Returns core which is used for parsing code and loading libraries

Dynamo.Engine.LibraryServices.#ctor(ProtoCore.Core,Dynamo.Interfaces.IPathManager)
Initializes a new instance of the Dynamo.Engine.LibraryServices class.
libraryManagementCore: Core which is used for parsing code and loading libraries
pathManager: Instance of IPathManager containing neccessary Dynamo paths

Dynamo.Engine.LibraryServices.#ctor(ProtoCore.Core,Dynamo.Interfaces.IPathManager,Dynamo.Interfaces.IPreferences)
Initializes a new instance of the Dynamo.Engine.LibraryServices class.
libraryManagementCore: Core which is used for parsing code and loading libraries
pathManager: Instance of IPathManager containing neccessary Dynamo paths
preferences: The preference settings of the Dynamo instance

Dynamo.Engine.LibraryServices.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources

Dynamo.Engine.LibraryServices.ImportedLibraries
Returns a list of imported libraries.

Dynamo.Engine.LibraryServices.BuiltinFunctionGroups
Returns built-in function groups.
Returns:

Dynamo.Engine.LibraryServices.ImportedFunctionGroups
Returns all imported function groups.

Dynamo.Engine.LibraryServices.LibraryLoading
Occurs before a library is loaded

Dynamo.Engine.LibraryServices.LibraryLoadFailed
Occurs if a library cannot be loaded

Dynamo.Engine.LibraryServices.LibraryLoaded
Occurs after a library is successfully loaded

Dynamo.Engine.LibraryServices.GetFunctionGroups(System.String)
Returns function groups from an imported library.
library: Library path
Returns:

Dynamo.Engine.LibraryServices.GetAllFunctionGroups
Returns all function groups.

Dynamo.Engine.LibraryServices.GetFunctionDescriptor(System.String,System.String)
Returns function descriptor from the managled function name.
name.
library: Library path
mangledName: Mangled function name
Returns:

Dynamo.Engine.LibraryServices.GetPriorNames
Returns a dictionary of old names vs. new names for node migration
Returns:

Dynamo.Engine.LibraryServices.GetFunctionDescriptor(System.String)
Returns function descriptor from the managed function name.
managledName:
Returns:

Dynamo.Engine.LibraryServices.GetAllFunctionDescriptors(System.String)
Returns a list of function descriptors associated with the function name.
qualifiedName:
Returns:

Dynamo.Engine.LibraryServices.IsLibraryLoaded(System.String)
Checks if a given library is already loaded or not.
Only unique assembly names are allowed to be loaded
library:  can be either the full path or the assembly name
Returns:  true even if the same library name is loaded from different paths

Dynamo.Engine.LibraryServices.IsFunctionBuiltIn(System.String,System.String)
Checks if a given function is in the builtinFunctionGroups so we do not necessarily look for it's library based on its Assembly tag
library: assembly name
name: name, used for searching as key with default value ""
Returns:

Dynamo.Engine.LibraryServices.LoadNodeLibrary(System.String,System.Boolean)
Import a library (if it hasn't been imported yet).
library: The library to be loaded
isExplicitlyImportedLib: Indicates if the library has been imported using the "File | ImportLibrary" command

Dynamo.Engine.LibraryServices.PopulateBuiltIns
Add DesignScript builtin functions to the library.

Dynamo.Engine.LibraryServices.PopulateOperators
Add operators to the library.

Dynamo.Engine.LibraryServices.PopulatePreloadLibraries
Populate preloaded libraries.

Dynamo.Engine.LibraryServices.TryGetDefaultArgumentFromAttribute(ProtoCore.DSASM.ArgumentInfo,ProtoCore.AST.AssociativeAST.AssociativeNode@)
Try get default argument expression from DefaultArgumentAttribute,
and parse into Associaitve AST node.
arg:
defaultArgumentNode:
Returns: