Dynamo.Exceptions.CustomNodePackageLoadException.InstalledPath
File path of existing custom node package.

Dynamo.Exceptions.CustomNodePackageLoadException.#ctor(System.String,System.String,System.String)
Constructor.
path: File path of failing custom node package.
installedPath: File path of existing package.
reason: Failure reason.