Dynamo.Graph.Nodes.CustomNodes.Symbol
Represents function entry point.
It contains functionality to manage expressions and applies input values to function logic.

Dynamo.Graph.Nodes.CustomNodes.Symbol.NodeType
The NodeType property provides a name which maps to the
server type for the node. This property should only be
used for serialization.

Dynamo.Graph.Nodes.CustomNodes.Symbol.IsInputNode
Indicates whether node is input node.
Used to bind visibility of UI for user selection.

Dynamo.Graph.Nodes.CustomNodes.Symbol.IsOutputNode
Indicates whether node is output node.
Used to bind visibility of UI for user selection.

Dynamo.Graph.Nodes.CustomNodes.Symbol.ElementResolver
Responsible for resolving
a partial class name to its fully resolved name

Dynamo.Graph.Nodes.CustomNodes.Symbol.#ctor
Initializes a new instance of the Dynamo.Graph.Nodes.CustomNodes.Symbol class.

Dynamo.Graph.Nodes.CustomNodes.Symbol.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel},Dynamo.Library.TypedParameter,ProtoCore.Namespace.ElementResolver)
Initializes a new instance of the Dynamo.Graph.Nodes.CustomNodes.Symbol class.

Dynamo.Graph.Nodes.CustomNodes.Symbol.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel},Dynamo.Library.TypedParameter)
Initializes a new instance of the Dynamo.Graph.Nodes.CustomNodes.Symbol class.

Dynamo.Graph.Nodes.CustomNodes.Symbol.InputSymbol
Represents string input.

Dynamo.Graph.Nodes.CustomNodes.Symbol.Parameter
Returns tuple of Input parameter and its type.

Dynamo.Graph.Nodes.CustomNodes.Symbol.GetAstIdentifierForOutputIndex(System.Int32)
Returns ProtoCore.AST.AssociativeAST.IdentifierNode by passed output index.
outputIndex: Output index.