Dynamo.Migration.WorkspaceMigrationAttribute
Specifies versions which workspace should be migrated between.

Dynamo.Migration.WorkspaceMigrationAttribute.From
Returns version which workspace should be migrated from.

Dynamo.Migration.WorkspaceMigrationAttribute.To
Returns version which workspace should be migrated to.

Dynamo.Migration.WorkspaceMigrationAttribute.#ctor(System.String,System.String)
Initializes a new instance of the Dynamo.Migration.WorkspaceMigrationAttribute class
with the versions which workspace should be migrated between.
from: Version which workspace should be migrated from.
to: Version which workspace should be migrated to.
This parameter can be omitted that means workspace should migrate to the latest version