Dynamo.Graph.Workspaces.SerializationExtensions
Contains methods for serializing a WorkspaceModel to json.

Dynamo.Graph.Workspaces.SerializationExtensions.ToJson(Dynamo.Graph.Workspaces.WorkspaceModel,Dynamo.Engine.EngineController)
Save a Workspace to json.
Returns: A string representing the serialized WorkspaceModel.

Dynamo.Graph.Workspaces.SerializationExtensions.ReplaceTypeDeclarations(System.String,System.Boolean)
Strips $type references from the generated json, replacing them with
type names matching those expected by the server.
json: The json to parse.
fromServer: A flag indicating whether this json is coming from the server, and thus
needs to be converted back to its Json.net friendly format.
Returns: