Dynamo.Search.SearchElements.NodeModelSearchElementBase
Base class for node search elements that can be initialized from TypeLoadData.

Dynamo.Search.SearchElements.NodeModelSearchElementBase.#ctor(Dynamo.Graph.Nodes.TypeLoadData)
Initializes a new instance of the Dynamo.Search.SearchElements.NodeModelSearchElementBase class.
typeLoadData: Data to load.