Dynamo.Graph.Workspaces.DescriptionConverter
Converter for Description property in the NodeModel class.

Dynamo.Graph.Workspaces.DescriptionConverter.ReadJson(Newtonsoft.Json.JsonReader,System.Type,System.Object,Newtonsoft.Json.JsonSerializer)
When deserializing, we do not want to read this property from the file
so null is being returned. This is to convert the Description property
to the localized language.

Dynamo.Graph.Workspaces.DescriptionConverter.WriteJson(Newtonsoft.Json.JsonWriter,System.Object,Newtonsoft.Json.JsonSerializer)
Serializing the description property.