Dynamo.Graph.Nodes.CustomNodes.ICustomNodeSource.CreateCustomNodeInstance(System.Guid,System.String,System.Boolean)
Creates a new Custom Node Instance.
id: Identifier referring to a custom node definition.
name:
isTestMode: