Dynamo.Engine.XmlDocumentationExtensions
Provides extension methods for reading XML documentation from reflected members.

Dynamo.Engine.XmlDocumentationExtensions.LogToConsole
Raise event to log messages to the Dynamo Console.

Dynamo.Engine.XmlDocumentationExtensions.GetDescription(Dynamo.Library.TypedParameter,System.Xml.XmlReader)
Returns a description of a parameter from the its documentation xml,
using the corresponding FunctionDescriptor.
parameter: The TypedParameter object corresponding to the parameter.
xml:
Returns: The contents of the documentation description for the parameter.

Dynamo.Engine.XmlDocumentationExtensions.GetSummary(Dynamo.Engine.FunctionDescriptor,System.Xml.XmlReader)
Returns a summary of a method from its documentation xml,
using the corresponding FunctionDescriptor object.
member: The FunctionDescriptor object corresponding to the method.
xml:
Returns: The contents of the documentation summary tag.

Dynamo.Engine.XmlDocumentationExtensions.GetSearchTags(Dynamo.Engine.FunctionDescriptor,System.Xml.XmlReader)
Returns a collection of search tags for a method from its documentation xml,
using the corresponding FunctionDescriptor object.
member: The FunctionDescriptor object corresponding to the method.
xml:
Returns: A collection of search tags.

Dynamo.Engine.XmlDocumentationExtensions.GetSearchTagWeights(Dynamo.Engine.FunctionDescriptor,System.Xml.XmlReader)
Returns a collection of search tag weights for a method from its documentation xml,
using the corresponding FunctionDescriptor object.
member: The FunctionDescriptor object corresponding to the method.
xml:
Returns: A collection of search weights, or an empty collection if the search weights tag is emtpy.

Dynamo.Engine.XmlDocumentationExtensions.GetReturns(Dynamo.Engine.FunctionDescriptor,System.Xml.XmlReader)
Returns a collection of return descriptions for a method from its documentation xml,
using the corresponding FunctionDescriptor object.
member: The FunctionDescriptor object corresponding to the method.
xml:
Returns: A collection of return descriptions from the documentation returns tag.

Dynamo.Engine.XmlDocumentationExtensions.PrimitiveMap(System.String)
Attempts to translate a DS type into a .NET type. Note that,
given these do not map 1 to 1, this is just a heuristic.