Dynamo.Core.UndoRedoRecorder.BeginActionGroup
For a series of actions to be recorded for undo, an "action
group" needs to be opened. An action group is the smallest unit in
which undo or redo can be done. For example, dragging a set of nodes
on the UI results in those nodes getting recorded in a single action
group, when undo is done, the set of recorded nodes get reverted in
one undo command.
It is mandatory for the caller of this method to call
EndActionGroup when the undo recording is done for the current
action group. Failing to do so will result in subsequent calls to
BeginActionGroup to throw an exception.

Dynamo.Core.UndoRedoRecorder.EndActionGroup
Call this method to close the currently opened action group, wrapping
all recorded actions as part of the group. Actions in an action group
get undone/redone at one go with a single undo/redo command.

Dynamo.Core.UndoRedoRecorder.Clear
Call this method to clear the internal undo/redo stacks, effectively
destroying all the recorded actions. This is desirable for example,
when the workspace is cleared to be used as a clean slate for future
works, causing recorded actions become irrelevant.

Dynamo.Core.UndoRedoRecorder.RecordCreationForUndo(Dynamo.Graph.ModelBase)
Record the given model right after it has been created. This results
in a creation action to be recorded under the current action group.
Undoing this action will result in the model being deleted.
model: The model to be recorded.

Dynamo.Core.UndoRedoRecorder.RecordDeletionForUndo(Dynamo.Graph.ModelBase)
Record the given model right before it has been deleted. This
results in a deletion action to be recorded under the current action
group. Undoing this action will result in the model being created
and re-inserted into the current workspace.
model: The model to be recorded.

Dynamo.Core.UndoRedoRecorder.RecordModificationForUndo(Dynamo.Graph.ModelBase)
Record the given model right before it is modified. This results
in a modification action to be recorded under the current action
group. Undoing this action will result in the model being reverted
to the states that it was in before the modification took place.
model: The model to be recorded.

Dynamo.Core.UndoRedoRecorder.PopFromUndoGroup
This function removes the top most item from the UndoStack. In
order to preserve continuity of both undo and redo stacks, a pop
action cannot be done when undo has unwinded some user actions,
leaving them on the redo stack. This partially helps making sure
the method is only called when the caller recognizes the most
recent item that was pushed onto the undo stack (and that it does
not accidentally pop an action that is irrelevant).
Returns: Returns the XmlElement representing the action group that
is on top of the stack at the time pop is requested.

Dynamo.Core.UndoRedoRecorder.EnsureValidRecorderStates
This method is called at the beginning of any method that requires
any existing undo group to be closed before proceeding. For example,
UndoRedoRecorder.OpenGroup cannot be called again while there is an
existing undo group that is left open.

Dynamo.Core.UndoRedoRecorder.IsRecordedInActionGroup(System.Xml.XmlElement,Dynamo.Graph.ModelBase)
The recorder calls this method to determine if a given model has
already been recorded in the active action group. For an example,
if there is a connection between NodeA and NodeB, selecting both
the nodes and deleting them will cause the connection model to be
recorded twice (when a node is deleted, its connections are being
recorded for undo).
group: The action group to check against.
model: The model to check against.
Returns: Returns true if the model has already been recorded in the
current action group, or false otherwise.