Dynamo.Interfaces.IDisablePackageLoadingPreferences
Temporary interface to avoid breaking changes.
TODO: Merge with IPreferences for 3.0 (DYN-1699)

Dynamo.Interfaces.IDisablePackageLoadingPreferences.DisableBuiltinPackages
If enabled Dynamo Built-In Packages will not be loaded.

Dynamo.Interfaces.IDisablePackageLoadingPreferences.DisableCustomPackageLocations
If enabled user's custom package locations will not be loaded.