Dynamo.Extensions.ExtensionData.ExtensionGuid
Extensions unique id.

Dynamo.Extensions.ExtensionData.Name
Name of extension.

Dynamo.Extensions.ExtensionData.Version
Extension version.

Dynamo.Extensions.ExtensionData.Data
Extension specific data.