Dynamo.Graph.Workspaces.NodeLibraryDependencyConverter
Is used to serialize and deserialize graph workspace node library references

Dynamo.Graph.Workspaces.NodeLibraryDependencyConverter.#ctor(Dynamo.Logging.ILogger)
Constructs a WorkspaceNodeReferenceConverter.
logger: