Dynamo.Migration.MigrationReport
Class responsible for creation of an XML in following format that records
node mapping information - which old node has been converted to which to new node(s)
NewNodeName1
NewNodeName2
...
...