Dynamo.Graph.ILocatable
Interface contains definitions for locatable objects.
Objects such as nodes, connectors, workspaces etc.

Dynamo.Graph.ILocatable.X
X coordinate of locatable object.

Dynamo.Graph.ILocatable.Y
Y coordinate of locatable object.

Dynamo.Graph.ILocatable.Width
Width of locatable object.

Dynamo.Graph.ILocatable.Height
Height of locatable object.

Dynamo.Graph.ILocatable.Rect
Bounds of locatable object.

Dynamo.Graph.ILocatable.CenterX
X coordinate of center point.

Dynamo.Graph.ILocatable.CenterY
Y coordinate of center point.

Dynamo.Graph.ILocatable.ReportPosition
Notify listeners that the position of the object has changed,
then all dependant objects will also redraw themselves.