Dynamo.Graph.Nodes.NodeLoaders.INodeLoader`1
An object which can load a NodeModel from Xml.

Dynamo.Graph.Nodes.NodeLoaders.INodeLoader`1.CreateNodeFromXml(System.Xml.XmlElement,Dynamo.Graph.SaveContext,ProtoCore.Namespace.ElementResolver)
Create a new NodeModel from its serialized form.
elNode: Serialized NodeModel
context: Serialization context
resolver: Element resolver for resolve namespace conflict
Returns: