Dynamo.Models.DynamoModel.CreateAnnotationCommand
A command to create a group.

Dynamo.Models.DynamoModel.CreateAnnotationCommand.#ctor(System.Guid,System.String,System.Double,System.Double,System.Boolean)
annotationId:
annotationText:
x:
y:
defaultPosition:

Dynamo.Models.DynamoModel.CreateAnnotationCommand.#ctor(System.Guid,System.String,System.String,System.Double,System.Double,System.Boolean)
Recordable command to create a new AnnotationModel
annotationId: Id of the new AnnotationModel
annotationText: Header text
annotationDescriptionText: Description text
x: X location
y: Y location
defaultPosition: The default position

Dynamo.Models.DynamoModel.CreateAnnotationCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid},System.String,System.Double,System.Double,System.Boolean)
Recordable command to create a new AnnotationModel
annotationId:
annotationText:
x:
y:
defaultPosition:

Dynamo.Models.DynamoModel.CreateAnnotationCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid},System.String,System.String,System.Double,System.Double,System.Boolean)
Recordable command to create a new AnnotationModel
annotationId: Collection of ids
annotationText: Header text
annotationDescriptionText: Description text
x: X location
y: Y location
defaultPosition: The default position