Dynamo.Graph.Nodes.TypeLoadData
This class represents data loaded from assembly for each type.
Based on this info node model is created.

Dynamo.Graph.Nodes.TypeLoadData.Assembly
Assembly containing the type.

Dynamo.Graph.Nodes.TypeLoadData.Type
The type this data is associated with.

Dynamo.Graph.Nodes.TypeLoadData.ObsoleteMessage
Information about why this type is obsolete, if it is actually obsolete.

Dynamo.Graph.Nodes.TypeLoadData.IsObsolete
Specifies whether or not this Type is obsolete.

Dynamo.Graph.Nodes.TypeLoadData.#ctor(System.Type)
Creates TypeLoadData.
typeIn: Type

Dynamo.Graph.Nodes.TypeLoadData.AlsoKnownAs
Other names this type might go by inside of Dynamo.

Dynamo.Graph.Nodes.TypeLoadData.IsDeprecated
Specifies whether or not this type is deprecated by Dynamo.

Dynamo.Graph.Nodes.TypeLoadData.IsMetaNode
Specifies whether or not this type is considered a "meta node"

Dynamo.Graph.Nodes.TypeLoadData.IsDSCompatible
Specifies whether or not this type is considered "DesignScript compatible"

Dynamo.Graph.Nodes.TypeLoadData.IsHidden
Specifies whether or not this type should be hidden from users in search.

Dynamo.Graph.Nodes.TypeLoadData.Name
The Name associated with this type.

Dynamo.Graph.Nodes.TypeLoadData.SearchKeys
Search keys that can be used to search for this type.

Dynamo.Graph.Nodes.TypeLoadData.Category
The category of this type, used in search.

Dynamo.Graph.Nodes.TypeLoadData.Description
The description of this type.

Dynamo.Graph.Nodes.TypeLoadData.IsPackageMember
Indicates if the type is loaded from a package.

Dynamo.Graph.Nodes.TypeLoadData.InputParameters
Indicates input parameters.

Dynamo.Graph.Nodes.TypeLoadData.OutputParameters
Indicates output parameters.