Dynamo.Updates.IUpdateManagerConfiguration
This interface represents configuration properties for Update manager.

Dynamo.Updates.IUpdateManagerConfiguration.DownloadSourcePath
Specifies download location for new installer

Dynamo.Updates.IUpdateManagerConfiguration.SignatureSourcePath
Specifies location for signature file to validate the new installer.

Dynamo.Updates.IUpdateManagerConfiguration.CheckNewerDailyBuild
Specifies whether to consider daily builds for update, default is false.

Dynamo.Updates.IUpdateManagerConfiguration.ForceUpdate
Specifies whether to force update, default value is false.

Dynamo.Updates.IUpdateManagerConfiguration.InstallerNameBase
Returns the base name of the installer to be used for upgrade.

Dynamo.Updates.IUpdateManagerConfiguration.DynamoLookUp
Returns IDynamoLookUp interface to search Dynamo installations on the system.