Dynamo.Migration.Migration.Version
A version after which this migration will be applied.

Dynamo.Migration.Migration.Upgrade
The action to perform during the upgrade.

Dynamo.Migration.Migration.#ctor(System.Version,System.Action)
A migration which can be applied to a workspace to upgrade the workspace to the current version.
v: A version number specified as x.x.x.x after which a workspace will be upgraded
upgrade: The action to perform during the upgrade.