Dynamo.Models.DynamoModel.SelectModelCommand
A command to select a model object.

Dynamo.Models.DynamoModel.SelectModelCommand.#ctor(System.String,Dynamo.Utilities.ModifierKeys)
modelGuid:
modifiers:

Dynamo.Models.DynamoModel.SelectModelCommand.#ctor(System.Guid,Dynamo.Utilities.ModifierKeys)
modelGuid:
modifiers:

Dynamo.Models.DynamoModel.SelectModelCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid},Dynamo.Utilities.ModifierKeys)
modelGuids:
modifiers: