Dynamo.Graph.Workspaces.PackageInfo
Class containing info about a package

Dynamo.Graph.Workspaces.PackageInfo.Name
Name of the package

Dynamo.Graph.Workspaces.PackageInfo.Version
Version of the package

Dynamo.Graph.Workspaces.PackageInfo.#ctor(System.String,System.Version)
Create a package info object from the package name and version
name:
version:

Dynamo.Graph.Workspaces.PackageInfo.Equals(System.Object)
Checks whether two PackageInfos are equal
They are equal if their Name and Versions are equal
obj:
Returns:

Dynamo.Graph.Workspaces.PackageInfo.GetHashCode
Gets the hashcode for this PackageInfo
Returns:

Dynamo.Graph.Workspaces.PackageInfo.ToString
Get the string representing this PackageInfo
Returns: