Dynamo.Logging.DynamoLogger
This class contains methods and properties used for logging in Dynamo,

Dynamo.Logging.DynamoLogger.NotificationLogged
event that is raised when a notification is logged

Dynamo.Logging.DynamoLogger.WarningLevel
Returns warning level for log messages.

Dynamo.Logging.DynamoLogger.Warning
Returns warning message text

Dynamo.Logging.DynamoLogger.LogPath
Returns full path to log file

Dynamo.Logging.DynamoLogger.LogText
Contains all message which have been logged

Dynamo.Logging.DynamoLogger.StartupNotifications
Notifications logged during startup such as library load failures
that need to be displayed to user.

Dynamo.Logging.DynamoLogger.#ctor(Dynamo.Configuration.DebugSettings,System.String)
Initializes a new instance of Dynamo.Logging.DynamoLogger class
with specified debug settings and directory where to write logs
debugSettings: Debug settings
logDirectory: Directory path where log file will be written

Dynamo.Logging.DynamoLogger.#ctor(Dynamo.Configuration.DebugSettings,System.String,System.Boolean)
Initializes a new instance of Dynamo.Logging.DynamoLogger class
with specified debug settings and directory where to write logs
debugSettings: Debug settings
logDirectory: Directory path where log file will be written
isTestMode: Test mode is true or false.

Dynamo.Logging.DynamoLogger.Log(System.String,Dynamo.Logging.LogLevel)
Logs the specified message.
message: The message.
level: The level.

Dynamo.Logging.DynamoLogger.Log(System.String,Dynamo.Logging.LogLevel,System.Boolean)
Log the message to the the correct path
message:
level:
reportModification:

Dynamo.Logging.DynamoLogger.LogNotification(System.String,System.String,System.String,System.String)
Logs a tagged notification to the console, also
fires an event that a notification was logged
sender:
title:
shortMessage:
detailedMessage:

Dynamo.Logging.DynamoLogger.LogWarning(System.String,Dynamo.Logging.WarningLevel)
Logs the warning.
message: The message.
level: The level.

Dynamo.Logging.DynamoLogger.LogError(System.String)
Logs the error.
error: The error.

Dynamo.Logging.DynamoLogger.LogError(System.String,System.String)
Logs the error.
tag: The tag.
error: The error.

Dynamo.Logging.DynamoLogger.LogInfo(System.String,System.String)
Log an information message
tag: Tag of the message to log
info: Message to log

Dynamo.Logging.DynamoLogger.ResetWarning
Resets the warning.

Dynamo.Logging.DynamoLogger.ClearStartupNotifications
Clear any notifications after displaying them.

Dynamo.Logging.DynamoLogger.Log(System.String)
Log a message
message: Message to log

Dynamo.Logging.DynamoLogger.Log(System.Exception)
Log an exception
e: Exception to log

Dynamo.Logging.DynamoLogger.Log(System.String,System.String)
Log some data with an associated tag
tag: Tag of the message to log
data: Message to log

Dynamo.Logging.DynamoLogger.StartLoggingToConsoleAndFile(System.String)
Begin logging.

Dynamo.Logging.DynamoLogger.Dispose(System.Boolean)
Dispose of the logger and finish logging.

Dynamo.Logging.DynamoLogger.Dispose
Disposes the logger and finishes logging.