Dynamo.Scheduler.DelegateBasedAsyncTask
DelegateBasedAsyncTask allows for a delegate or System.Action object
to be scheduled for asynchronous execution on the ISchedulerThread.

Dynamo.Scheduler.DelegateBasedAsyncTask.Priority
Returns priority of the Dynamo.Scheduler.DelegateBasedAsyncTask.

Dynamo.Scheduler.DelegateBasedAsyncTask.#ctor(Dynamo.Scheduler.IScheduler)
construct a new empty DelegateBasedAsyncTask
scheduler:  the scheduler to run the task on

Dynamo.Scheduler.DelegateBasedAsyncTask.#ctor(Dynamo.Scheduler.IScheduler,System.Action)
construct a new DelegateBasedAsyncTask by supplying an action delegate that will run
on the scheduler specified
scheduler:  the scheduler to run the task on
action:  the action to perform when this task is executed