Dynamo.Logging.LogSourceBase
An object that can log messages.

Dynamo.Logging.LogSourceBase.MessageLogged
Emits LogMessages.

Dynamo.Logging.LogSourceBase.Log(Dynamo.Logging.ILogMessage)
Logs ILogMessage objects.
obj: Message object

Dynamo.Logging.LogSourceBase.Log(System.String)
Transform string into ILogMessage object and logs it.
msg: String

Dynamo.Logging.LogSourceBase.Log(System.Exception)
Transform exception into ILogMessage object and logs it.
ex: Exception

Dynamo.Logging.LogSourceBase.Log(System.String,Dynamo.Logging.WarningLevel)
Logs string message with some warning level.
msg: String
severity: Warning level

Dynamo.Logging.LogSourceBase.AsLogger
Creates an ILogger out of this LogSourceBase; logging to the ILogger
will send messages out of the LogMessage event.
Returns: