Dynamo.Engine.Profiling.ProfilingSession
This class manages a diagnostic session and the data collected in a session.

Dynamo.Engine.Profiling.ProfilingSession.#ctor
Creeate a diagnostic session for collecting profiling data.

Dynamo.Engine.Profiling.ProfilingSession.Dispose
Ensure that the event handlers are disconnected when the profiling session is terminated.

Dynamo.Engine.Profiling.ProfilingSession.ProfilingData
Return an interface to the profiling data for this profiling session.