Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1
Controller that synchronizes a node with a zero-touch function definition.

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.#ctor(`0)
Initializes a new instance of
the ZeroTouchNodeController class with FunctionDescriptor.
definition: FunctionDescriptor describing the function
that this controller will call.

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.Description
Description of function, taken from Definition.

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.Category
Category of function, taken from Definition.

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.MangledName
MangledName of function, taken from Definition.

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.IsInstanceMember
Is this function an instance member of a class?

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.IsStaticMember
Is this function a static member of a class?

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.IsConstructor
Is this function a constructor of a class?

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.InitializeFunctionParameters(Dynamo.Graph.Nodes.NodeModel,System.Collections.Generic.IEnumerable{Dynamo.Library.TypedParameter})
Initializes a node's InPortData based on a list of parameters.
model: Node to initialize.
parameters: Parameters used for initialization.

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.SerializeCore(System.Xml.XmlElement,Dynamo.Graph.SaveContext)
Serializes data into given System.Xml.XmlElement object.
element: System.Xml.XmlElement object to store data.
context: Saving context.

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.SyncNodeWithDefinition(Dynamo.Graph.Nodes.NodeModel)
Syncronizes custom node instance with its definition
model: The custom node instance

Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.CreateFunctionObject(Dynamo.Graph.Nodes.NodeModel,ProtoCore.AST.AssociativeAST.AssociativeNode,System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Creates a FunctionObject representing a partial application of a function.
model: Node to produce FunctionObject for.
functionNode: AST representing the function to make a FunctionObject out of.
inputs: Arguments to be applied partially.