Dynamo.Graph.Workspaces.IWorkspaceModel
Exposes workspace model.

Dynamo.Graph.Workspaces.IWorkspaceModel.Name
Returns name of the workspace

Dynamo.Graph.Workspaces.IWorkspaceModel.Description
Returns description of the workspace

Dynamo.Graph.Workspaces.IWorkspaceModel.FileName
Returns FileName of the workspace

Dynamo.Graph.Workspaces.IWorkspaceModel.Connectors
Returns list of connectors in the workspace

Dynamo.Graph.Workspaces.IWorkspaceModel.Nodes
Returns list of nodes owned by this workspace.

Dynamo.Graph.Workspaces.IWorkspaceModel.CurrentSelection
Returns list of selected nodes.

Dynamo.Graph.Workspaces.IWorkspaceModel.CenterX
Returns X coordinate of center point of visible workspace part

Dynamo.Graph.Workspaces.IWorkspaceModel.CenterY
Returns Y coordinate of center point of visible workspace part

Dynamo.Graph.Workspaces.IWorkspaceModel.NodeAdded
Triggers when a node is added to the workspace.

Dynamo.Graph.Workspaces.IWorkspaceModel.NodeRemoved
Triggers when a node is removed from the workspace.

Dynamo.Graph.Workspaces.IWorkspaceModel.NodesCleared
Triggers when nodes are cleared from the workspace.

Dynamo.Graph.Workspaces.IWorkspaceModel.ConnectorAdded
Triggers when a connector is added to the workspace.

Dynamo.Graph.Workspaces.IWorkspaceModel.ConnectorDeleted
Triggers when a connector is removed from the workspace.

Dynamo.Graph.Workspaces.IWorkspaceModel.RecordModelsForModification(System.Collections.Generic.IEnumerable{Dynamo.Graph.ModelBase})
Implement to record node modification for undo/redo
models: Collection of Dynamo.Graph.ModelBase objects to record.