Dynamo.Updates.DynamoLookUp
Lookup for installed products

Dynamo.Updates.DynamoLookUp.LatestProduct
Returns the version of latest product

Dynamo.Updates.DynamoLookUp.GetDynamoVersion(System.String)
Locates DynamoCore.dll at given install path and gets file version
installPath: Dynamo install path
Returns: Dynamo version if valid Dynamo exists else null

Dynamo.Updates.DynamoLookUp.GetDynamoInstallLocations
Returns all dynamo install path on the system by looking into the Windows registry.
Returns: List of Dynamo install path

Dynamo.Updates.DynamoLookUp.GetDynamoUserDataLocations
Returns the full path of user data location of all version of this
Dynamo product installed on this system. The default implementation
returns list of all subfolders in %appdata%\Dynamo as well as
%appdata%\Dynamo\Dynamo Core\ folders.
Returns: