Dynamo.Engine.SyncDataManager
SyncDataManager is to manage the state of a Dynamo node and the
corresponding AST nodes of that Dynamo node. It is responsible for
generating GraphSyncData that will be consumed by LiveRunner.

Dynamo.Engine.SyncDataManager.GetSyncData
Return graph sync data that will be executed by LiveRunner.
Returns:

Dynamo.Engine.SyncDataManager.Clone
Return a clone of current SyncDataManager.
Returns:

Dynamo.Engine.SyncDataManager.ResetStates
Reset states of all nodes to State.NoChange. It should be called
before each running.

Dynamo.Engine.SyncDataManager.MarkForAdding(System.Guid)
Notify SyncDataManager that is going to add AST nodes.
guid:

Dynamo.Engine.SyncDataManager.AddNode(System.Guid,ProtoCore.AST.AssociativeAST.AssociativeNode)
Add an AST node to the existing AST node list.
guid:
node:

Dynamo.Engine.SyncDataManager.DeleteNodes(System.Guid)
Delete all AST nodes for this Dynamo node.
guid: