Dynamo.Graph.Workspaces.HomeWorkspaceModel
This class contains methods and properties that defines a Dynamo.Graph.Workspaces.WorkspaceModel.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.EngineController
Returns Dynamo.Graph.Workspaces.HomeWorkspaceModel.EngineController object assosiated with thisPreloadedTraceData home workspace
to coordinate the interactions between some DesignScript
sub components like library managment, live runner and so on.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.IsTestMode
Flag specifying if this workspace is operating in "test mode".

Dynamo.Graph.Workspaces.HomeWorkspaceModel.HasRunWithoutCrash
Indicates whether a run has completed successfully.
This flag is critical to ensuring that crashing run-auto files
are not left in run-auto upon reopening.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.silenceNodeModifications
Before the Workspace has been built the first time, we do not respond to
NodeModification events.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.VerboseLogging
Indicates if detailed descriptions should be logged

Dynamo.Graph.Workspaces.HomeWorkspaceModel.RunSettings
Returns Dynamo.Graph.Workspaces.HomeWorkspaceModel.EngineController object containing properties to control
how execution is carried out.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.EvaluationCount
Evaluation count is incremented whenever the graph is evaluated.
It is set to zero when the graph is Cleared.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.GraphDocumentationURL
Link to documentation page for this workspace

Dynamo.Graph.Workspaces.HomeWorkspaceModel.Thumbnail
Workspace thumbnail as Base64 string.
Returns null if provide value is not Base64 encoded.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.ExtensionData
List of user defined data from extensions and view extensions stored in the graph

Dynamo.Graph.Workspaces.HomeWorkspaceModel.PreloadedTraceData
In near future, the file loading mechanism will be completely moved
into WorkspaceModel, that's the time we removed this property setter below.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.EvaluationStarted
Notifies listeners that graph evaluation is started.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.OnEvaluationStarted(System.EventArgs)
Triggers EvaluationStarted event.
e: The event data.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.EvaluationCompleted
Notifies listeners that graph evaluation is completed.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.OnEvaluationCompleted(Dynamo.Models.EvaluationCompletedEventArgs)
Triggers EvaluationCompleted event.
e: The event data containing information
if graph evaluation has completed successfully.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.RefreshCompleted
Notifies listeners when all tasks in scheduler related to current evalution are completed.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.OnRefreshCompleted(Dynamo.Models.EvaluationCompletedEventArgs)
Triggers RefreshCompleted event
e: The event data containing information
if graph evaluation has completed successfully.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.#ctor(Dynamo.Engine.EngineController,Dynamo.Scheduler.DynamoScheduler,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,System.Boolean,System.Boolean,System.String)
Initializes a new empty instance of the Dynamo.Graph.Workspaces.HomeWorkspaceModel class
engine: Dynamo.Graph.Workspaces.HomeWorkspaceModel.EngineController object assosiated with this home workspace
to coordinate the interactions between some DesignScript sub components.
scheduler: Dynamo.Scheduler.DynamoScheduler object to add tasks in queue to execute
factory: Node factory to create nodes
verboseLogging: Indicates if detailed descriptions should be logged
isTestMode: Indicates if current code is running in tests
fileName: Name of file where the workspace is saved

Dynamo.Graph.Workspaces.HomeWorkspaceModel.#ctor(Dynamo.Engine.EngineController,Dynamo.Scheduler.DynamoScheduler,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,System.Boolean,System.Boolean,Dynamo.Linting.LinterManager,System.String)
Initializes a new empty instance of the Dynamo.Graph.Workspaces.HomeWorkspaceModel class
engine: Dynamo.Graph.Workspaces.HomeWorkspaceModel.EngineController object assosiated with this home workspace
to coordinate the interactions between some DesignScript sub components.
scheduler: Dynamo.Scheduler.DynamoScheduler object to add tasks in queue to execute
factory: Node factory to create nodes
verboseLogging: Indicates if detailed descriptions should be logged
isTestMode: Indicates if current code is running in tests
linterManager: The linter manager from the DynamoModel that owns this workspace
fileName: Name of file where the workspace is saved

Dynamo.Graph.Workspaces.HomeWorkspaceModel.#ctor(Dynamo.Engine.EngineController,Dynamo.Scheduler.DynamoScheduler,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,System.Collections.Generic.IEnumerable{System.Collections.Generic.KeyValuePair{System.Guid,System.Collections.Generic.List{ProtoCore.CallSite.RawTraceData}}},System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Annotations.AnnotationModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Presets.PresetModel},ProtoCore.Namespace.ElementResolver,Dynamo.Graph.Workspaces.WorkspaceInfo,System.Boolean,System.Boolean)
Initializes a new instance of the Dynamo.Graph.Workspaces.HomeWorkspaceModel class
by given information about it and specified item collections
engine: Dynamo.Graph.Workspaces.HomeWorkspaceModel.EngineController object assosiated with this home workspace
to coordinate the interactions between some DesignScript sub components.
scheduler: Dynamo.Scheduler.DynamoScheduler object to add tasks in queue to execute
factory: Node factory to create nodes
traceData: Preloaded trace data
nodes: Node collection of the workspace
notes: Note collection of the workspace
annotations: Group collection of the workspace
presets: Preset collection of the workspace
elementResolver: ElementResolver responsible for resolving
a partial class name to its fully resolved name
info: Information for creating custom node workspace
verboseLogging: Indicates if detailed descriptions should be logged
isTestMode: Indicates if current code is running in tests

Dynamo.Graph.Workspaces.HomeWorkspaceModel.#ctor(Dynamo.Engine.EngineController,Dynamo.Scheduler.DynamoScheduler,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,System.Collections.Generic.IEnumerable{System.Collections.Generic.KeyValuePair{System.Guid,System.Collections.Generic.List{ProtoCore.CallSite.RawTraceData}}},System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Annotations.AnnotationModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Presets.PresetModel},ProtoCore.Namespace.ElementResolver,Dynamo.Graph.Workspaces.WorkspaceInfo,System.Boolean,System.Boolean,Dynamo.Linting.LinterManager)
Initializes a new instance of the Dynamo.Graph.Workspaces.HomeWorkspaceModel class
by given information about it and specified item collections
engine: Dynamo.Graph.Workspaces.HomeWorkspaceModel.EngineController object assosiated with this home workspace
to coordinate the interactions between some DesignScript sub components.
scheduler: Dynamo.Scheduler.DynamoScheduler object to add tasks in queue to execute
factory: Node factory to create nodes
traceData: Preloaded trace data
nodes: Node collection of the workspace
notes: Note collection of the workspace
annotations: Group collection of the workspace
presets: Preset collection of the workspace
elementResolver: ElementResolver responsible for resolving
a partial class name to its fully resolved name
info: Information for creating custom node workspace
verboseLogging: Indicates if detailed descriptions should be logged
isTestMode: Indicates if current code is running in tests
linterManager: The linter manager from the DynamoModel that owns this workspace

Dynamo.Graph.Workspaces.HomeWorkspaceModel.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.RequestRun
Invoked when a change to the workspace that requires re-execution
has taken place.  If in run-automatic, a new run will take place,
otherwise nothing will happen.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.NodeModified(Dynamo.Graph.Nodes.NodeModel)
Called when a Node is modified in the workspace
node: The node itself

Dynamo.Graph.Workspaces.HomeWorkspaceModel.OnToggleNodeFreeze(Dynamo.Graph.Nodes.NodeModel)
When a node is frozen, then the node and its dependencies should be
deleted from the current AST
node: The node.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.RegisterNode(Dynamo.Graph.Nodes.NodeModel)
Called when a node is added to the workspace and event handlers are to be added
node: The node itself

Dynamo.Graph.Workspaces.HomeWorkspaceModel.DisposeNode(Dynamo.Graph.Nodes.NodeModel)
Called when a node is disposed and removed from the workspace
node: The node itself

Dynamo.Graph.Workspaces.HomeWorkspaceModel.NodeOnRequestSilenceNodeModifiedEvents(Dynamo.Graph.Nodes.NodeModel,System.Boolean)
Called when the RequestSilenceNodeModifiedEvents event is emitted from a Node
node: The node itself
value: A boolean value indicating whether to silence or not

Dynamo.Graph.Workspaces.HomeWorkspaceModel.Clear
Clears this workspace of nodes, notes, and connectors.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.StartPeriodicEvaluation
Start periodic evaluation using the currently set RunPeriod

Dynamo.Graph.Workspaces.HomeWorkspaceModel.StopPeriodicEvaluation
Stop the on-going periodic evaluation, if there is any.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.ResetEngine(Dynamo.Engine.EngineController,System.Boolean)
Call this method to reset the virtual machine, avoiding a race
condition by using a thread join inside the vm executive.
TODO(Luke): Push this into a resync call with the engine controller
controller:
markNodesAsDirty: Set this parameter to true to force
reset of the execution substrait. Note that setting this parameter
to true will have a negative performance impact.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.MarkNodesAsModifiedAndRequestRun(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Boolean)
Mark the input nodes as modified
nodes: The nodes to modify
forceExecute: The argument to NodeModel.MarkNodeAsModified

Dynamo.Graph.Workspaces.HomeWorkspaceModel.OnUpdateGraphCompleted(Dynamo.Scheduler.AsyncTask)
This callback method is invoked in the context of ISchedulerThread
when UpdateGraphAsyncTask is completed.
task: The original UpdateGraphAsyncTask instance.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.Run
This method is typically called from the main application thread (as
a result of user actions such as button click or node UI changes) to
schedule an update of the graph. This call may or may not represent
an actual update. In the event that the user action does not result
in actual graph update (e.g. moving of node on UI), the update task
will not be scheduled for execution.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.GetExecutingNodes(System.Boolean)
This function gets the set of nodes that will get executed in the next run.
This function will be called when the nodes are modified or when showrunpreview is set
the executing nodes will be sent via SetNodeDeltaState event.
showRunPreview: This parameter controls the delta state computation

Dynamo.Graph.Workspaces.HomeWorkspaceModel.GetOrphanedSerializablesAndClearHistoricalTraceData
Returns a list of ISerializable items which exist in the preloaded
trace data but do not exist in the current CallSite data.
Returns:

Dynamo.Graph.Workspaces.HomeWorkspaceModel.ReCompileCodeBlockNodesForFunctionDefinitions
Recompile all CBNs in home workspace in a second pass after all other function definitions
have been compiled.
Note: This method is intended to be called only during opening of an existing workspace.