Dynamo.Logging.AnalyticsService
Utility class to support analytics tracking.

Dynamo.Logging.AnalyticsService.Start(Dynamo.Models.DynamoModel,System.Boolean,System.Boolean)
Starts the client when DynamoModel is created. This method initializes
the Analytics service and application life cycle start is tracked.
model: DynamoModel
isHeadless: Analytics won't be started if IsHeadless, but ADP may be loaded to be disabled.
isTestMode: Analytics won't be started if isTestMode, ADP will not be loaded.

Dynamo.Logging.AnalyticsService.IsADPOptedIn
Indicates whether the user has opted-in to ADP analytics.
As of ADP4 this will return true for most users.

Dynamo.Logging.AnalyticsService.ShutDown
Shuts down the client. Application life cycle end is tracked.

Dynamo.Logging.AnalyticsService.ShowADPConsetDialog(System.Nullable{System.IntPtr})
Show the ADP dynamic consents dialog.
host: main window