Dynamo.Search.SearchElements.ElementTypes
Enumeration of external elements' types

Dynamo.Search.SearchElements.ElementTypes.None
Represents no type

Dynamo.Search.SearchElements.ElementTypes.ZeroTouch
Type for all the DLLs (can be built-in, third-party, and packaged)

Dynamo.Search.SearchElements.ElementTypes.CustomNode
Type for all the DYFs (both loose DYF files and packaged)

Dynamo.Search.SearchElements.ElementTypes.BuiltIn
Type for things that Dynamo ships with (operator, geometries...)

Dynamo.Search.SearchElements.ElementTypes.Packaged
Type for a packaged element (either zero-touch DLLs or DYFs)