Dynamo.Scheduler.TimeStamp
This class is used to set creation time of async task in Dynamo Scheduler.

Dynamo.Scheduler.TimeStamp.identifier
The unique identifier of the time-stamp. This identifier is
generated from a centralized TimeStampGenerator class that ensures
the identifier is unique for each generated TimeStamp object.

Dynamo.Scheduler.TimeStamp.tickCount
The high resolution tick count obtained from Stopwatch.GetTimestamp.
This tick count is different from 'identifier' in the way that this
represents real elapsed

Dynamo.Scheduler.TimeStamp.op_GreaterThan(Dynamo.Scheduler.TimeStamp,Dynamo.Scheduler.TimeStamp)
The public usage of time stamps should be restricted to these
methods which are used to ensure an ordering on timestamps
timeStamp0: The first time stamp in comparison.
timeStamp1: The second time stamp in comparison.
Returns: Return true if the first time stamp was created later than
the second time stamp, or false otherwise.

Dynamo.Scheduler.TimeStamp.op_LessThan(Dynamo.Scheduler.TimeStamp,Dynamo.Scheduler.TimeStamp)
The public usage of time stamps should be restricted to these
methods which are used to ensure an ordering on timestamps
timeStamp0: The first time stamp in comparison.
timeStamp1: The second time stamp in comparison.
Returns: Return true if the first time stamp was created earlier than
the second time stamp, or false otherwise.