Dynamo.Interfaces.IPreferences
An interface which defines preference settings.

Dynamo.Interfaces.IPreferences.BackgroundPreviews
Collection of pairs [BackgroundPreviewName;isActive]

Dynamo.Interfaces.IPreferences.ShowPreviewBubbles
Indicates if preview bubbles should be displayed on nodes.

Dynamo.Interfaces.IPreferences.ConsoleHeight
Returns height of console

Dynamo.Interfaces.IPreferences.ShowConnector
Indicates whether connector should be displayed on canvas or not.

Dynamo.Interfaces.IPreferences.ConnectorType
Indicates which type of connector's should be displayed on canvas.
I.e. bezier or polyline

Dynamo.Interfaces.IPreferences.IsBackgroundGridVisible
Indicates whether background grid is visible or not.

Dynamo.Interfaces.IPreferences.IsBackgroundPreviewActive
Indicates whether background preview is active or not.

Dynamo.Interfaces.IPreferences.NumberFormat
Returns the decimal precision used to display numbers.

Dynamo.Interfaces.IPreferences.IsUsageReportingApproved
Indicates whether usage reporting is approved or not.

Dynamo.Interfaces.IPreferences.IsAnalyticsReportingApproved
Indicates whether Google analytics reporting is approved or not.

Dynamo.Interfaces.IPreferences.IsADPAnalyticsReportingApproved
Indicates whether ADP analytics reporting is approved or not.

Dynamo.Interfaces.IPreferences.IsFirstRun
Indicates first run

Dynamo.Interfaces.IPreferences.WindowX
Returns the last X coordinate of the Dynamo window.

Dynamo.Interfaces.IPreferences.WindowY
Returns the last Y coordinate of the Dynamo window.

Dynamo.Interfaces.IPreferences.WindowH
Returns the last height of the Dynamo window.

Dynamo.Interfaces.IPreferences.WindowW
Returns the last width of the Dynamo window.

Dynamo.Interfaces.IPreferences.MaxNumRecentFiles
Returns maximal count of recent files which can be displayed

Dynamo.Interfaces.IPreferences.RecentFiles
Returns list of recent files

Dynamo.Interfaces.IPreferences.BackupFiles
Returns list of backup files

Dynamo.Interfaces.IPreferences.PackageDirectoriesToUninstall
Returns list of packages used by the Package Manager to determine
which packages are scheduled to be deleted or scheduled to be unloaded.

Dynamo.Interfaces.IPreferences.CustomPackageFolders
Returns list of folders containing zero-touch nodes and custom nodes.

Dynamo.Interfaces.IPreferences.ShowEdges
Indicates whether surface and solid edges will
be rendered.

Dynamo.Interfaces.IPreferences.Save(System.String)
Call this method to serialize PreferenceSettings given the output
file path.
filePath: The full path of the output file to serialize
PreferenceSettings to.
Returns: Returns true if the serialization is successful, or false
otherwise.

Dynamo.Interfaces.IPreferences.PythonTemplateFilePath
Return full path to the Python (.py) file to use as a starting template when creating a new PythonScript Node.

Dynamo.Interfaces.IPreferences.GetIsBackgroundPreviewActive(System.String)
Returns active state of specified background preview
name: Background preview name
Returns: The active state

Dynamo.Interfaces.IPreferences.SetIsBackgroundPreviewActive(System.String,System.Boolean)
Sets active state of specified background preview
name: Background preview name
value: Active state to set