Dynamo.Graph.Workspaces.DummyNodeWriteConverter
DummyNodeWriteConverter is used for serializing DummyNodes to JSON.
Note that the DummyNode objects serialize as their original content and not as a DummyNode.