Dynamo.Search.SearchElements.DragDropNodeSearchElementInfo
This class returns Dynamo.Search.SearchElements.NodeSearchElement which is used
for creating a node, when the element is drag and dropped.

Dynamo.Search.SearchElements.DragDropNodeSearchElementInfo.SearchElement
Returns Dynamo.Search.SearchElements.NodeSearchElement to drag and drop.

Dynamo.Search.SearchElements.DragDropNodeSearchElementInfo.#ctor(Dynamo.Search.SearchElements.NodeSearchElement)
Initializes a new instance of the Dynamo.Search.SearchElements.DragDropNodeSearchElementInfo class.
searchElement: Element to drag on the canvas