Dynamo.Scheduler.TaskProcessMode
Describes the way a scheduled task will be processed.

Dynamo.Scheduler.TaskProcessMode.Synchronous
Scheduled task will be processed immediately

Dynamo.Scheduler.TaskProcessMode.Asynchronous
Scheduled task will be processed by schedule