Dynamo.Search.SearchLibrary`2
Searchable library of item sources.
Type of searchable elements.
Type of items produced by searchable elements.

Dynamo.Search.SearchLibrary`2.#ctor(Dynamo.Logging.ILogger)
Construct a SearchLibrary object
logger:  (Optional) A logger to pass through to SearchDictionary for logging search data

Dynamo.Search.SearchLibrary`2.Add(`0)
Adds an entry to search.
entry: search element

Dynamo.Search.SearchLibrary`2.Update(`0,System.Boolean)
Updates an entry in search.
entry: search element
isCategoryChanged: true, if entry changed its category

Dynamo.Search.SearchLibrary`2.ItemProduced
Produces an item whenever a search element produces an item.