Dynamo.Core.CrashPromptArgs
Event argument for CrashPrompt. It contains display options, details, overriding text and file path.

Dynamo.Core.CrashPromptArgs.Options
Returns Dispalyoptions flag which indicates whether args contain default text overriden,
has details or has file path

Dynamo.Core.CrashPromptArgs.Details
Returns details of crash

Dynamo.Core.CrashPromptArgs.OverridingText
Returns crash message

Dynamo.Core.CrashPromptArgs.FilePath
Returns preference file path

Dynamo.Core.CrashPromptArgs.#ctor(System.String,System.String,System.String)
Returns initializes a new instance of the Dynamo.Core.CrashPromptArgs class.
details: Details of crash
overridingText: Crash message
filePath: Preferences file path