Dynamo.Scheduler.CompileCustomNodeAsyncTask
Schedule this task to compile a CustomNodeDefinition asynchronously.

Dynamo.Scheduler.CompileCustomNodeAsyncTask.Initialize(Dynamo.Scheduler.CompileCustomNodeParams)
Call this method to intialize a CompileCustomNodeAsyncTask with an
EngineController and an GraphSyncData that is required to compile the
associated custom node.
initParams: Input parameters required for custom node
graph updates.
Returns: Returns true if GraphSyncData is not empty and that the
CompileCustomNodeAsyncTask should be scheduled for execution. Returns
false otherwise.