Dynamo.Logging.StabilityCookie
The stability cookie class groups together the usage around the registry key that is written
to record whether the last shutdown was performed cleanly or not.
If the Write

Dynamo.Logging.StabilityCookie.WriteCleanShutdown
Record that the shutdown was clean

Dynamo.Logging.StabilityCookie.WriteCrashingShutdown
Record that the shutdown was as a result of a crash

Dynamo.Logging.StabilityCookie.WriteUptimeBeat(System.TimeSpan)
Record that the system has been up for the the length of the time in the timespan
timespan:

Dynamo.Logging.StabilityCookie.Startup
Start up and report the status of the last shutdown

Dynamo.Logging.StabilityCookie.IsLastShutdownClean
To check whether the last shutdown is clean(no crash)