Dynamo.Models.DynamoModel.DeleteModelCommand
A command used to delete a model object.

Dynamo.Models.DynamoModel.DeleteModelCommand.#ctor(System.String)
modelGuid:

Dynamo.Models.DynamoModel.DeleteModelCommand.#ctor(System.Guid)
modelGuid:

Dynamo.Models.DynamoModel.DeleteModelCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid})
modelGuids: