Dynamo.Graph.Nodes.InPortDescriptionsAttribute
Indicates input ports' description

Dynamo.Graph.Nodes.InPortDescriptionsAttribute.#ctor(System.Type,System.String[])
Loads ports descriptions from resource.
resourceType: resource type, i.e. type of resource class specified in .resx file
resourceNames: resource names

Dynamo.Graph.Nodes.InPortDescriptionsAttribute.#ctor(System.String[])
Loads ports descriptions, that are specified directly in Attribute.
descriptions:

Dynamo.Graph.Nodes.InPortDescriptionsAttribute.PortDescriptions
Port descriptions, that are shown in Dynamo.