Dynamo.Migration.WorkspaceMigrations
Contains methods to migrate a workspace from one version to another

Dynamo.Migration.WorkspaceMigrations.#ctor(Dynamo.Models.DynamoModel)
Initializes a new instance of the Dynamo.Migration.WorkspaceMigrations class
with current Dynamo.Models.DynamoModel object.
dynamoModel: Current Dynamo.Models.DynamoModel object.

Dynamo.Migration.WorkspaceMigrations.Migrate_0_5_3_to_0_6_0(System.Xml.XmlDocument)
Performs migration of a workspace from 0.5.3.0 to 0.6.1.0.
doc: The System.Xml.XmlDocument object.