Dynamo.Extensions.LinterExtensionBase
Base class for all LinterExtensions

Dynamo.Extensions.LinterExtensionBase.UniqueId


Dynamo.Extensions.LinterExtensionBase.Name


Dynamo.Extensions.LinterExtensionBase.LinterRules
Collection of the rules in this extension

Dynamo.Extensions.LinterExtensionBase.AddLinterRule(Dynamo.Linting.Rules.LinterRule)
Add a LinterRule
linterRule:

Dynamo.Extensions.LinterExtensionBase.RemoveLinterRule(Dynamo.Linting.Rules.LinterRule)
Remove a LinterRule
linterRule:

Dynamo.Extensions.LinterExtensionBase.Activate(System.Boolean)
Activate this linter by subscribing the workspace and initializing its rules

Dynamo.Extensions.LinterExtensionBase.Deactivate
Deactivates this extension by unsubscribing all its events

Dynamo.Extensions.LinterExtensionBase.Ready(Dynamo.Extensions.ReadyParams)


Dynamo.Extensions.LinterExtensionBase.Startup(Dynamo.Extensions.StartupParams)


Dynamo.Extensions.LinterExtensionBase.Shutdown


Dynamo.Extensions.LinterExtensionBase.Dispose
