Dynamo.Graph.Workspaces.DependencyInfo
Class containing info about a LocalDefinition or an External File

Dynamo.Graph.Workspaces.DependencyInfo.Name
Name of the Dependency

Dynamo.Graph.Workspaces.DependencyInfo.Path
Path of the Dependency

Dynamo.Graph.Workspaces.DependencyInfo.Size
Size of the Dependency

Dynamo.Graph.Workspaces.DependencyInfo.ReferenceType
ReferenceType of the Dependency

Dynamo.Graph.Workspaces.DependencyInfo.IsLoaded
Indicates whether this Dependency is loaded in the current session

Dynamo.Graph.Workspaces.DependencyInfo.#ctor(System.String,System.String)
Create a Dependency info object from the Name and Path
name:
path:

Dynamo.Graph.Workspaces.DependencyInfo.#ctor(System.String,System.String,Dynamo.Graph.Workspaces.ReferenceType)
Create a Dependency info object from the Name, Path and ReferenceType
name:
path:
referenceType:

Dynamo.Graph.Workspaces.DependencyInfo.#ctor(System.String,Dynamo.Graph.Workspaces.ReferenceType)
Create a Dependency info object from the Name and ReferenceType
name:
referenceType:

Dynamo.Graph.Workspaces.DependencyInfo.#ctor(System.String)
Create a Dependency info object from the name
name:

Dynamo.Graph.Workspaces.DependencyInfo.Equals(System.Object)
Checks whether two Dependency's are equal
They are equal if their Name, Path and ReferenceType are equal
obj:
Returns:

Dynamo.Graph.Workspaces.DependencyInfo.GetHashCode
Gets the hashcode for this dependency
Returns:

Dynamo.Graph.Workspaces.DependencyInfo.ToString
Get the string representing this dependency.
Returns: