Dynamo.Engine.CodeCompletion.CodeCompletionServices
Interacts with the VM core to provide code completion data to the UI

Dynamo.Engine.CodeCompletion.CodeCompletionServices.GetCompletionsOnType(System.String,System.String,ProtoCore.Namespace.ElementResolver)
Determines if the completion string is a valid type and
enumerates the list of completion members on the type
code:  code typed in the code block
stringToComplete:  Class name or declared variable
resolver:
Returns:  list of method and property members of the type

Dynamo.Engine.CodeCompletion.CodeCompletionServices.GetClasses
Returns the list of names of classes loaded in the Core
Returns:  list of class names

Dynamo.Engine.CodeCompletion.CodeCompletionServices.GetGlobals
Returns the list of names of global methods and properties in Core
Returns:  list of names of global methods and properties

Dynamo.Engine.CodeCompletion.CodeCompletionServices.SearchCompletions(System.String,System.Guid,ProtoCore.Namespace.ElementResolver)
Matches the completion string with classes and
global methods and properties loaded in the session
stringToComplete:  current string being typed which is to be completed
guid:  code block node guid to identify current node being typed
resolver:
Returns:  list of classes, global methods and properties that match with string being completed

Dynamo.Engine.CodeCompletion.CodeCompletionServices.SearchTypes(System.String,ProtoCore.Namespace.ElementResolver)
Matches the completion string with classes, including primitive types.
stringToComplete:
resolver:
Returns:

Dynamo.Engine.CodeCompletion.CodeCompletionServices.GetFunctionSignatures(System.String,System.String,System.String,ProtoCore.Namespace.ElementResolver)
Returns the list of function signatures of all overloads of a given method
or getter method equivalent of a property.
code:  code being typed in code block
functionName:  given method name for which signature is queried
functionPrefix:  class name in case of constructor or static method, OR
declared instance variable on which method is invoked
resolver:
Returns:  list of method overload signatures