Dynamo.Updates.BinaryVersion
This class represents current version of the product.

Dynamo.Updates.BinaryVersion.FromString(System.String)
Parses a given string version representation
version: Version to parse
Returns: Result Dynamo.Updates.BinaryVersion object

Dynamo.Updates.BinaryVersion.ToString
Returns string representation of the Dynamo.Updates.BinaryVersion
Returns: String representation of the version

Dynamo.Updates.BinaryVersion.GetHashCode
Returns the hash code for this Dynamo.Updates.BinaryVersion
Returns: The hash code

Dynamo.Updates.BinaryVersion.Equals(System.Object)
Determines whether this instance and another specified
Dynamo.Updates.BinaryVersion object are equal by reference
other: The Dynamo.Updates.BinaryVersion to compare to this instance.
Returns: True if references are equal

Dynamo.Updates.BinaryVersion.op_LessThan(Dynamo.Updates.BinaryVersion,Dynamo.Updates.BinaryVersion)
Compares two Dynamo.Updates.BinaryVersion objects. The result specifies
if the first given version is older than the second one
lhs: A Dynamo.Updates.BinaryVersion to compare.
rhs: A Dynamo.Updates.BinaryVersion to compare.
Returns: True if the first version is older than the second one

Dynamo.Updates.BinaryVersion.op_LessThanOrEqual(Dynamo.Updates.BinaryVersion,Dynamo.Updates.BinaryVersion)
Compares two Dynamo.Updates.BinaryVersion objects. The result specifies
if the first given version is older or the same as the second one
lhs: A Dynamo.Updates.BinaryVersion to compare.
rhs: A Dynamo.Updates.BinaryVersion to compare.
Returns: True if the first version is older or the same as the second one

Dynamo.Updates.BinaryVersion.op_GreaterThan(Dynamo.Updates.BinaryVersion,Dynamo.Updates.BinaryVersion)
Compares two Dynamo.Updates.BinaryVersion objects. The result specifies
if the first given version is newer than the second one
lhs: A Dynamo.Updates.BinaryVersion to compare.
rhs: A Dynamo.Updates.BinaryVersion to compare.
Returns: True if the first version is newer than the second one

Dynamo.Updates.BinaryVersion.op_GreaterThanOrEqual(Dynamo.Updates.BinaryVersion,Dynamo.Updates.BinaryVersion)
Compares two Dynamo.Updates.BinaryVersion objects. The result specifies
if the first given version is newer or the same as the second one
lhs: A Dynamo.Updates.BinaryVersion to compare.
rhs: A Dynamo.Updates.BinaryVersion to compare.
Returns: True if the first version is newer or the same as the second one

Dynamo.Updates.BinaryVersion.op_Equality(Dynamo.Updates.BinaryVersion,Dynamo.Updates.BinaryVersion)
Compares two Dynamo.Updates.BinaryVersion objects. The result specifies
if the versions are the same
lhs: A Dynamo.Updates.BinaryVersion to compare.
rhs: A Dynamo.Updates.BinaryVersion to compare.
Returns: True if the versions are the same

Dynamo.Updates.BinaryVersion.op_Inequality(Dynamo.Updates.BinaryVersion,Dynamo.Updates.BinaryVersion)
Compares two Dynamo.Updates.BinaryVersion objects. The result specifies
if the versions are different
lhs: A Dynamo.Updates.BinaryVersion to compare.
rhs: A Dynamo.Updates.BinaryVersion to compare.
Returns: True if the versions are different