Dynamo.Engine.NodeToCode.NodeToCodeCompiler.NumberingState
The numbering state of a variable.

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.NumberingState.Variable
Variable name.

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.NumberingState.NumberedVariable
Variable name with number suffix.

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.NumberingState.ID
Number suffix.

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.NumberingState.IsNewSession
Indicate it is for ASTs in a new code block

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.NumberingState.#ctor(System.String)
Constructor.
variable:

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.NumberingState.BumpID
Increase number.