Dynamo.Models.DynamoModel.UndoRedoCommand
A command used to trigger an undo or redo operation.

Dynamo.Models.DynamoModel.UndoRedoCommand.#ctor(Dynamo.Models.DynamoModel.UndoRedoCommand.Operation)
operation: The operation to perform.