Dynamo.Extensions.IExtension
An extension to the model layer of Dynamo

Dynamo.Extensions.IExtension.UniqueId
A unique id for this extension instance.
There may be multiple instances of the same type, but the application
will *not* allow two instances to coexist with the same id.

Dynamo.Extensions.IExtension.Name
A name for the Extension.  This is used for more user-readable logging.

Dynamo.Extensions.IExtension.Startup(Dynamo.Extensions.StartupParams)
Action to be invoked when Dynamo begins to start up.
This action is *not* guaranteed to be invoked unless the extension is
already installed at startup.
Exceptions thrown from this method will be caught by Dynamo and
logged.

Dynamo.Extensions.IExtension.Ready(Dynamo.Extensions.ReadyParams)
Action to be invoked when the Dynamo has started up and is ready
for user interaction.
This action is guaranteed to be called even if the extension is installed
after startup.
Exceptions thrown from this method will be caught by Dynamo and
logged.

Dynamo.Extensions.IExtension.Shutdown
Action to be invoked when shutdown has begun.