Dynamo.Utilities.ResourceLoader.Load(System.Type,System.String)
Loads resource string from resource type.
resourceType: resource type, i.e. type of resource class specified in .resx file
resourceName: resource name
Returns: resource value

Dynamo.Utilities.ResourceLoader.Load(System.Type,System.Collections.Generic.IEnumerable{System.String})
Loads several resource strings from resource type.
resourceType: resource type, i.e. type of resource class specified in .resx file
resourceNames: resource names
Returns: resource values