Dynamo.Wpf.Interfaces.LayoutSpecification
Represents the specification for the library items layout in library view.

Dynamo.Wpf.Interfaces.LayoutSpecification.#ctor
Default constructor

Dynamo.Wpf.Interfaces.LayoutSpecification.sections
List of LayoutSections

Dynamo.Wpf.Interfaces.LayoutSpecification.ToJSONStream
Serializes the layout specification to json stream
Returns:

Dynamo.Wpf.Interfaces.LayoutSpecification.FromJSONString(System.String)
Creates LibraryLayoutSpec object from the given json text
jsonText: JSON text to deserialize
Returns: LibraryLayoutSpec object or null

Dynamo.Wpf.Interfaces.LayoutSpecification.FromJSONStream(System.IO.Stream)
Creates LibraryLayoutSpec object from given json stream
stream: JSON stream
Returns: LibraryLayoutSpec object or null

Dynamo.Wpf.Interfaces.LayoutSpecification.Clone
Performs a deep clone of this object and returns a new LayoutSpecification object
Returns: A cloned LayoutSpecification object