Dynamo.Engine.NodeToCode.NodeToCodeUndoHelper
An undo helper class that is used in node-to-code conversion. It helps to
avoid recording redundant user actions (e.g. deletion right after creation
will not be recorded). This typically happens when there are multiple code
block nodes being created as part of node-to-code conversion, during which
some connectors will be created and later on deleted all within the same
conversion process.

Dynamo.Engine.NodeToCode.NodeToCodeUndoHelper.RecordCreation(Dynamo.Graph.ModelBase)
Add a creation action.
model:

Dynamo.Engine.NodeToCode.NodeToCodeUndoHelper.RecordDeletion(Dynamo.Graph.ModelBase)
Add a deletion action. If a creation action for the same model has
been added, that creation action will be removed and this deletion
action won't be added.
model:

Dynamo.Engine.NodeToCode.NodeToCodeUndoHelper.ApplyActions(Dynamo.Core.UndoRedoRecorder)
Record all actions in recorder.
recorder:

Dynamo.Engine.NodeToCode.NodeToCodeUndoHelper.ActionCount
Returns the count of recorded actions.
Returns: