Dynamo.CustomNodeDefinition
Compiler definition of a Custom Node.

Dynamo.CustomNodeDefinition.#ctor(System.Guid,System.String,System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
This function creates CustomNodeDefinition.
functionId: Custom node unique ID
displayName: Custom node name
nodeModels: Nodes inside custom node

Dynamo.CustomNodeDefinition.IsProxy
Is this CustomNodeDefinition properly loaded?

Dynamo.CustomNodeDefinition.ContainsInvalidInput
Indicates whether any of this definition's input parameters are invalid.
An input is invalid when its input expression fails to parse. For example,
this would happen if the input name contained spaces or illegal characters.

Dynamo.CustomNodeDefinition.FunctionName
Function name.

Dynamo.CustomNodeDefinition.FunctionId
Function unique ID.

Dynamo.CustomNodeDefinition.DisplayParameters
User-friendly parameters

Dynamo.CustomNodeDefinition.Parameters
Function parameters.

Dynamo.CustomNodeDefinition.ReturnKeys
If the function returns a dictionary, this specifies all keys in
that dictionary.

Dynamo.CustomNodeDefinition.FunctionBody
NodeModels making up the body of the custom node.

Dynamo.CustomNodeDefinition.OutputNodes
Identifiers associated with the outputs of the custom node.

Dynamo.CustomNodeDefinition.DisplayName
User friendly name on UI.

Dynamo.CustomNodeDefinition.ReturnType
Return type.

Dynamo.CustomNodeDefinition.Returns
The collection of output name and its description.

Dynamo.CustomNodeDefinition.Dependencies
Returns all custom node definitions.

Dynamo.CustomNodeDefinition.DirectDependencies
Returns custom node definitions for direct dependencies.

Dynamo.CustomNodeDefinition.MangledName
Name to create custom node