Dynamo.Models.DynamoModel.UndoRedoCommand.Operation
The operation to perform.

Dynamo.Models.DynamoModel.UndoRedoCommand.Operation.Undo
Undo.

Dynamo.Models.DynamoModel.UndoRedoCommand.Operation.Redo
Redo.