Dynamo.Linting.Rules.NodeLinterRule
Base class for creating Node related linter rules

Dynamo.Linting.Rules.NodeLinterRule.Evaluate(Dynamo.Graph.Nodes.NodeModel,System.String)
Method to call when this rule needs to be evaluated.
This will use EvaluateFunction(NodeModel) to evaluate the rule.
nodeModel:
changedEvent:

Dynamo.Linting.Rules.NodeLinterRule.EvaluateFunction(Dynamo.Graph.Nodes.NodeModel,System.String)
Function used to evaluate this rule
nodeModel: Node to evaluate
changedEvent:
Returns:

Dynamo.Linting.Rules.NodeLinterRule.InitFunction(Dynamo.Graph.Workspaces.WorkspaceModel)
The init function is used when the Linter extension implementing this Rule is initialized.
workspaceModel:
Returns: