Dynamo.Graph.Nodes.PortModel
PortModel represents Dynamo ports.

Dynamo.Graph.Nodes.PortModel.GUID
ID of the PortModel, which is unique within the graph.

Dynamo.Graph.Nodes.PortModel.Connectors
Returns the connectors between the specified ports.

Dynamo.Graph.Nodes.PortModel.Name
Name of the port.

Dynamo.Graph.Nodes.PortModel.ToolTip
Tooltip of the port.

Dynamo.Graph.Nodes.PortModel.PortType
Type of the port.
It can be incoming or outcoming.

Dynamo.Graph.Nodes.PortModel.Owner
Returns the Node.

Dynamo.Graph.Nodes.PortModel.Index
Index of the port.

Dynamo.Graph.Nodes.PortModel.LineIndex
Returns the LineIndex of that port. The vertical position of PortModel is dependent on LineIndex.

Dynamo.Graph.Nodes.PortModel.IsEnabled
Indicates whether the port is enabled or not.

Dynamo.Graph.Nodes.PortModel.Center
Center is used by connected connectors to update their shape
The "center" of a port is derived from the type of port and
offsets from the node origin based on the port's index in the
ports collection.

Dynamo.Graph.Nodes.PortModel.UsingDefaultValue
Controls whether this port is set to use it's default value (true) or yield a closure (false).

Dynamo.Graph.Nodes.PortModel.DefaultValue
Default value for port.

Dynamo.Graph.Nodes.PortModel.MarginThickness
Controls the space between successive output ports

Dynamo.Graph.Nodes.PortModel.extensionEdges
Based on extensionEdges port is aligned in UI.

Dynamo.Graph.Nodes.PortModel.Level
The Level at which objects will be
extracted from a nested list. The deepest
level of a nested list is -1.

Dynamo.Graph.Nodes.PortModel.UseLevels
A flag which determines whether this Port will
extract data from a specific level in a nested list.

Dynamo.Graph.Nodes.PortModel.KeepListStructure
A flag which determines whether data from this
node will be re-aligned into the original structure
of the nested list.

Dynamo.Graph.Nodes.PortModel.IsConnected
Returns true if the port has connectors or if the
default value is enabled and not null. Otherwise, returns false.

Dynamo.Graph.Nodes.PortModel.#ctor(Dynamo.Graph.Nodes.PortType,Dynamo.Graph.Nodes.NodeModel,Dynamo.Graph.Nodes.PortData)
Creates PortModel.
portType: Type of the Port
owner: Parent Node
data: Information about port

Dynamo.Graph.Nodes.PortModel.DestroyConnectors
Deletes all connectors attached to this PortModel.

Dynamo.Graph.Nodes.PortModel.GetInputPortType
Returns the string representation of the fully qualified typename
where possible for the port if it's an input port. This method currently
returns a valid type for only Zero Touch, Builtin and NodeModel nodes,
and returns null otherwise. The string representation of the type also
contains the rank information of the type, e.g. Point[], or var[]..[].
Returns: input port type

Dynamo.Graph.Nodes.PortModel.GetOutPortType
Returns the string representation of the fully qualified typename
where possible for the port if it's an output port. This method currently
returns a valid type for only Zero Touch, Builtin and NodeModel nodes,
and returns null otherwise. The string representation of the type also
contains the rank information of the type, e.g. Point[], or var[]..[].
Returns: output port type