Dynamo.Models.HostAnalyticsInfo
Host analytics related info

Dynamo.Models.HostAnalyticsInfo.HostName
Dynamo variation identified by host.

Dynamo.Models.HostAnalyticsInfo.ParentId
Dynamo host parent id for analytics purpose.

Dynamo.Models.HostAnalyticsInfo.SessionId
Dynamo host session id for analytics purpose.