Dynamo.Logging.LogMessage
Factory methods for creating log messages.

Dynamo.Logging.LogMessage.Warning(System.String,Dynamo.Logging.WarningLevel)
Creates a LogMessage representing a warning.
message:
severity:
Returns:

Dynamo.Logging.LogMessage.Error(System.String)
Creates a LogMessage representing an error.
message:
Returns:

Dynamo.Logging.LogMessage.Error(System.Exception)
Creates a LogMessage representing an error.
exception:
Returns:

Dynamo.Logging.LogMessage.Info(System.String)
Creates a basic LogMessage.
message:
Returns:

Dynamo.Logging.LogMessage.Log(Dynamo.Logging.ILogger,Dynamo.Logging.ILogMessage)
Logs a LogMessage.
logger:
message: