Dynamo.Graph.Workspaces.NodesToCodeExtensions.IsInternalNodeToCodeConnection(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},Dynamo.Graph.Connectors.ConnectorModel)
Checks whether the given connection is inside the node to code set or outside it.
This determines if it should be redrawn(if it is external) or if it should be
deleted (if it is internal)

Dynamo.Graph.Workspaces.NodesToCodeExtensions.ReConnectOutputConnections(System.Collections.Generic.Dictionary{Dynamo.Graph.Connectors.ConnectorModel,System.String},Dynamo.Graph.Nodes.CodeBlockNodeModel)
Forms new connections from the external nodes to the Node To Code Node,
based on the connectors passed as inputs.
externalOutputConnections: List of connectors to remake, along with the port names of the new port
cbn: The new Node To Code created Code Block Node

Dynamo.Graph.Workspaces.NodesToCodeExtensions.ReConnectInputConnections(System.Collections.Generic.Dictionary{Dynamo.Graph.Connectors.ConnectorModel,System.String},Dynamo.Graph.Nodes.CodeBlockNodeModel,Dynamo.Graph.Workspaces.WorkspaceModel)
Forms new connections from the external nodes to the Node To Code Node,
based on the connectors passed as inputs.
externalInputConnections: List of connectors to remake, along with the port names of the new port
cbn: The new Node To Code created Code Block Node
workspace: