Dynamo.Models.DynamoModel.DefaultStartConfiguration
Initialization settings for DynamoModel.

Dynamo.Models.DynamoModel.DefaultStartConfiguration.DefaultPythonEngine
Default Python script engine

Dynamo.Models.DynamoModel.DefaultStartConfiguration.DisableADP
Disables ADP for the entire process for the lifetime of the process.

Dynamo.Models.DynamoModel.DefaultStartConfiguration.HostAnalyticsInfo
Host analytics info
TODO: Move this to IStartConfiguration in Dynamo 3.0