Dynamo.Graph.Nodes.VariableInputNode
Base class for nodes that have dynamic incoming ports.
E.g. list.create.

Dynamo.Graph.Nodes.VariableInputNode.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel})
Protected constructor for deserialization
inPorts:
outPorts:

Dynamo.Graph.Nodes.VariableInputNode.VariableInputPorts
A flag used during serialization to indicated that
the node has a variable number of input ports.