Dynamo.Models.DynamoModel.RecordableCommand
This is the base class of all recordable commands. It provides the
contract between a UI event handler (e.g. delegate command method or
a button event handler) and the actual command handler in the
DynamoViewModel. It is mandatory for each RecordableCommand-derived
class to be serializable to/deserializable from an XmlElement.

Dynamo.Models.DynamoModel.RecordableCommand.jsonSettings
Settings that is used for serializing commands

Dynamo.Models.DynamoModel.RecordableCommand.#cctor
Initialize commands serializing settings

Dynamo.Models.DynamoModel.RecordableCommand.#ctor
Constructs an instance of RecordableCommand derived class. This
constructor is made protected to indicate that the class instance
can only be instantiated through a derived class.

Dynamo.Models.DynamoModel.RecordableCommand.#ctor(System.String)
Constructs an instance of RecordableCommand derived class,
assigning a new tag to it.
tag: A string tag to be assigned to the command.
This parameter can be any string, even an empty one. However,
it should not be null. A null "tag" parameter causes the
ArgumentNullException to be thrown.

Dynamo.Models.DynamoModel.RecordableCommand.Execute(Dynamo.Models.DynamoModel)
Call this method to execute a RecordableCommand. A RecordableCommand
must be executed in the context of an existing DynamoViewModel.
dynamoModel: The DynamoModel object this
RecordableCommand is targeting.

Dynamo.Models.DynamoModel.RecordableCommand.Serialize(System.Xml.XmlDocument)
This method serializes the RecordableCommand object in the form of
XmlElement for storage. The resulting XmlElement contains all the
arguments that are required by this command.
document: The XmlDocument from which an XmlElement can
be created.
Returns: The XmlElement representation of this RecordableCommand
object. It will be used in RecordableCommand.Deserialize method to
completely reconstruct the RecordableCommand it represents.

Dynamo.Models.DynamoModel.RecordableCommand.Serialize
This method serializes the RecordableCommand object in the json form.
The resulting string contains command type name and all the
arguments that are required by this command.
Returns: The string can be used for reconstructing RecordableCommand
using Deserialize method

Dynamo.Models.DynamoModel.RecordableCommand.Deserialize(System.Xml.XmlElement)
Call this static method to reconstruct a RecordableCommand-derived
object given an XmlElement that was previously saved with Serialize
method. This method simply redirects the XmlElement to respective
RecordableCommand-derived classes based on its type.
element: The XmlElement from which the RecordableCommand
can be reconstructed.
Returns: Returns the reconstructed RecordableCommand object. If a
RecordableCommand cannot be reconstructed, this method throws a
relevant exception.

Dynamo.Models.DynamoModel.RecordableCommand.Deserialize(System.String)
Call this static method to reconstruct a RecordableCommand from json
string that contains command name - name of corresponding class inherited
from RecordableCommand, - and all the arguments that are required by this
command.
jsonString: Json string that contains command name and all
its arguments.
Returns: Reconstructed RecordableCommand

Dynamo.Models.DynamoModel.RecordableCommand.Redundant
Some commands are fired at high frequency (e.g. dragging and window
selection related commands), and can be simulated during playback by
issuing the final occurrence of the command. For example, window
selection command is fired for each mouse-move event, but the end
result will be same if only the final selection command is recorded.
If this property is set to 'true', then only the last occurrence will
be recorded for playback.

Dynamo.Models.DynamoModel.RecordableCommand.IsInPlaybackMode
This flag will be set to true only during playback. Derived classes
can use this to decide their actions accordingly. For example,
UpdateModelValueCommand doesn't change the value of a property
during recording time, it is created for the sole purpose of being
recorded. During playback, then UpdateModelValueCommand will update
the property that it is bound to. This is a runtime flag, it is not
serialized in anyway.

Dynamo.Models.DynamoModel.RecordableCommand.Tag
This is an optional tag for each of the recorded commands in a
command Xml file. A command can only be tagged from within a
command Xml file manually, and a tag is useful for unit test
verification passes. See PlaybackStateChangedEventArgs class for
possible usage of command tags. If a command is not tagged, its
default tag value is an empty string.

Dynamo.Models.DynamoModel.RecordableCommand.ExecuteCore(Dynamo.Models.DynamoModel)
Derived classes must implement this method to perform the actual
command execution. A typical implementation of this method involves
calling a corresponding method on DynamoModel by passing itself as
the only argument.
dynamoModel: The DynamoModel object on which
this command should be executed.

Dynamo.Models.DynamoModel.RecordableCommand.SerializeCore(System.Xml.XmlElement)
Derived classes must implement this method to serialize all relevant
information into the XmlElement supplied to it. Typically the method
is a direct mirror of DeserializeCore.
element: All arguments that are required for this
command are written into this XmlElement. The information written
here must be exactly what DeserializeCore method expects.

Dynamo.Models.DynamoModel.RecordableCommand.TrackAnalytics
This method provides derived class implementation of analytics
tracking, and only gets called if analytics tracking is enabled.