Dynamo.Engine.NodeToCode.NodeToCodeResult
The result of converting nodes to code. As when a node is converted to
code, its inputs and outputs may be renamed to avoid confliction, the
result contains maps for inputs/new-inputs and outputs/new-outputs.

Dynamo.Engine.NodeToCode.NodeToCodeResult.AstNodes
AST nodes that compiled from NodeModel.

Dynamo.Engine.NodeToCode.NodeToCodeResult.InputMap
The map between original input name and new name.

Dynamo.Engine.NodeToCode.NodeToCodeResult.OutputMap
The map between original output name and new name.