Dynamo.Migration.MigrationManager.FutureFileCallback
Functions that can be used as a callback in the event a file from a later version of Dynamo
is attempting to be loaded.
fileName: Name of file to load
fileVersion: Version of file to load
currentVersion: Current Dynamo version
Returns: Resume value