Dynamo.Models.DynamoModel.RunCancelCommand
A command used to execute or cancel execution.

Dynamo.Models.DynamoModel.RunCancelCommand.#ctor(System.Boolean,System.Boolean)
showErrors: Should errors be shown?
cancelRun: True to cancel execution. False to execute.