Dynamo.Graph.Nodes.NodeLoaders.NodeFactory
Manages factories and loaders for NodeModels. Can use registered factories
and loaders to instantiate and load new NodeModels.

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.AddLoader``1(Dynamo.Graph.Nodes.NodeLoaders.INodeLoader{``0})
Adds a node loader to this manager.
loader:

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.AddLoader``1(System.Type,Dynamo.Graph.Nodes.NodeLoaders.INodeLoader{``0})
Adds a node loader to this manager, for the given type.
nodeType:
loader:

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.AddFactory``1(Dynamo.Graph.Nodes.NodeLoaders.INodeFactory{``0})
Adds a node factory to this manager.
loader:

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.AddFactory``1(System.Type,Dynamo.Graph.Nodes.NodeLoaders.INodeFactory{``0})
Adds a node factory to this manager, for a given type.
nodeType:
loader:

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.AddTypeFactoryAndLoader``1
Attempts to create a new factory and loader for a given type.

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.CreateProxyNodeInstance(System.Guid,System.String,System.String,System.Int32,System.Int32)
A proxy custom node is a custom node without its definition loaded
in Dynamo. The creation of a proxy custom node relies on information
provided by the caller since the definition is not readily available
for reading. The actual definition may become available at a later
time by means of user uploading the definition.
id: Identifier of the custom node instance.
functionId: The functionId represents the GUID of the custom node
definition that is used for creating the custom node instance.
name: The display name of the custom node.
inputs: Number of input ports.
outputs: Number of output ports.
Returns: Returns the custom node instance if creation was successful,
or null otherwise.

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.AddTypeFactoryAndLoader(System.Type)
Attempts to create a new factory and loader for a given type.
nodeType:

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.AddAlsoKnownAs(System.Type,System.String,System.Boolean)
Registers a type with another name that it may go by.
realType:
aka:
overwrite:

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.AddAlsoKnownAs(System.Type,System.Collections.Generic.IEnumerable{System.String},System.Boolean)
Registers a type with other names that it may go by.
realType:
names:
overwrite:

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.ResolveType(System.String,System.Type@)
Given a type name, attempts to query the type associated with that name.
fullyQualifiedName:
type:
Returns:

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.CreateNodeFromXml(System.Xml.XmlElement,Dynamo.Graph.SaveContext,ProtoCore.Namespace.ElementResolver)
Creates and Loads a new NodeModel from its Serialized form, using the node loaders
registered in this factory. If loading fails, a Dummy Node is produced.
elNode:
context:
resolver:
Returns:

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.CreateNodeFromTypeName(System.String,Dynamo.Graph.Nodes.NodeModel@)
Creates a new NodeModel from its typeName, using the node factories registered
in this factory.
typeName:
node:
Returns: