Dynamo.Models.DynamoModel.CreateNodeCommand
A command used to create a node.

Dynamo.Models.DynamoModel.CreateNodeCommand.#ctor(Dynamo.Graph.Nodes.NodeModel,System.Double,System.Double,System.Boolean,System.Boolean)
node: The node.
x: The x location.
y: The y location.
defaultPosition:
transformCoordinates:

Dynamo.Models.DynamoModel.CreateNodeCommand.#ctor(System.Xml.XmlElement,System.Double,System.Double,System.Boolean,System.Boolean)
node:
x:
y:
defaultPosition:
transformCoordinates:

Dynamo.Models.DynamoModel.CreateNodeCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid},System.String,System.Double,System.Double,System.Boolean,System.Boolean)
nodeId:
nodeName:
x:
y:
defaultPosition:
transformCoordinates:

Dynamo.Models.DynamoModel.CreateNodeCommand.#ctor(System.String,System.String,System.Double,System.Double,System.Boolean,System.Boolean)
nodeId:
nodeName:
x:
y:
defaultPosition:
transformCoordinates: