Dynamo.Models.DynamoModel.AddGroupToGroupCommand
A command to add a AnnotationModel object to a group.

Dynamo.Models.DynamoModel.AddGroupToGroupCommand.HostGroupGuid
Id of the the group that should host
the other group.

Dynamo.Models.DynamoModel.AddGroupToGroupCommand.#ctor(System.Guid,System.Guid)
Creates a command to add a AnnotationModel object to another AnnotationModel.
modelGuid: The guid of the AnnotationModel to group
hostModelGuid: The guid of the host AnnotationModel

Dynamo.Models.DynamoModel.AddGroupToGroupCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid},System.Guid)
Creates a command to add a AnnotationModel object to another AnnotationModel.
modelGuid: The guid of the AnnotationModel to group
hostModelGuid: The guid of the host AnnotationModel