Dynamo.Updates.IDynamoLookUp
Interface provides methods, that get installed Dynamo paths and the last Dynamo version.

Dynamo.Updates.IDynamoLookUp.GetDynamoInstallLocations
Returns installation path for all version of this Dynamo Product
installed on this system.

Dynamo.Updates.IDynamoLookUp.GetDynamoUserDataLocations
Returns a list of user data folders on this system.
Returns:
The implementation of this interface method should return a list of user
data folders, one for each of Dynamo product installed on the system. When
there is no Dynamo product installed, this method returns an empty list.

Dynamo.Updates.IDynamoLookUp.LatestProduct
Returns the version of latest installed product