Dynamo.Graph.Annotations.AnnotationModelExtensions.ContainsModel(System.Collections.Generic.IEnumerable{Dynamo.Graph.Annotations.AnnotationModel},Dynamo.Graph.ModelBase)
Checks if any of the provided groups contains the provided
ModelBase.
groups:
modelBase:
Returns: