Dynamo.Engine.FunctionDescriptorParams
Contains parameters for function description.

Dynamo.Engine.FunctionDescriptorParams.#ctor
Initializes a new instance of the Dynamo.Engine.FunctionDescriptorParams class.

Dynamo.Engine.FunctionDescriptorParams.Assembly
Returns full path to the assembly the defined this function

Dynamo.Engine.FunctionDescriptorParams.ClassName
Returns class name of this function. If the functinon is global, return String.Empty.

Dynamo.Engine.FunctionDescriptorParams.FunctionName
Returns function name.

Dynamo.Engine.FunctionDescriptorParams.Summary
Returns comment describing the function along with the signature

Dynamo.Engine.FunctionDescriptorParams.ObsoleteMsg
Message specified if function is obsolete

Dynamo.Engine.FunctionDescriptorParams.Parameters
Returns function parameters data

Dynamo.Engine.FunctionDescriptorParams.ReturnType
Describes the type of object to return by the function

Dynamo.Engine.FunctionDescriptorParams.FunctionType
Describes type of function

Dynamo.Engine.FunctionDescriptorParams.IsVisibleInLibrary
This attribute sets, if this function is shown in library or not.

Dynamo.Engine.FunctionDescriptorParams.CanUpdatePeriodically
This attribute sets whether the function enables periodic update of the workspace.

Dynamo.Engine.FunctionDescriptorParams.ReturnKeys
If the function returns a dictionary, ReturnKeys is the key collection
used in returned dictionary.

Dynamo.Engine.FunctionDescriptorParams.PathManager
Returns instance of IPathManager

Dynamo.Engine.FunctionDescriptorParams.IsVarArg
Does the function accept a variable number of arguments?

Dynamo.Engine.FunctionDescriptorParams.IsBuiltIn
Indicates if it is built-in function

Dynamo.Engine.FunctionDescriptorParams.IsPackageMember
Indicates if the function is packaged element (either zero-touch DLLs or DYFs)

Dynamo.Engine.FunctionDescriptorParams.IsLacingDisabled
Indicates if the lacing strategy is disabled on the function