Dynamo.Graph.Nodes.AlsoKnownAsAttribute
The AlsoKnownAs attribute allows the node implementor to
define an array of names that this node might have had
in the past.

Dynamo.Graph.Nodes.AlsoKnownAsAttribute.#ctor(System.String[])
Constructs AlsoKnownAsAttribute with defined old names.
values: Old names, that node used to have.

Dynamo.Graph.Nodes.AlsoKnownAsAttribute.Values
Old names, that node used to have.