Dynamo.Graph.Nodes.Variable
Represents variable in CBN.

Dynamo.Graph.Nodes.Variable.Row
Returns the index of row.

Dynamo.Graph.Nodes.Variable.StartColumn
Returns the index of start column.

Dynamo.Graph.Nodes.Variable.EndColumn
Returns the index of end column.

Dynamo.Graph.Nodes.Variable.Name
This returns the name of the variable.
E.g.
a = 5;
Name will be "a".

Dynamo.Graph.Nodes.Variable.NameWithIndex
This returns the name of the list including its index.
E.g. for "a[0] = 5;", NameWithIndex will be "a[0]".
It simply returns the name of the variable otherwise.
E.g. for "a = 5;" NameWithIndex will be "a".

Dynamo.Graph.Nodes.Variable.#ctor(ProtoCore.AST.AssociativeAST.IdentifierNode)
Creates Variable
identNode: ProtoCore.AST.AssociativeAST.IdentifierNode

Dynamo.Graph.Nodes.Variable.SetCorrectColumn(System.Collections.Generic.List{Dynamo.Graph.Nodes.Variable},Dynamo.Graph.Nodes.Statement.StatementType,System.Int32)
Moves column index back only if variable is not an expression.
refVar: list of variables
type: statement type
line: line index