Dynamo.Models.EvaluationCompletedEventArgs
This class represents the arguments when a graph evaluation is completed.

Dynamo.Models.EvaluationCompletedEventArgs.EvaluationTookPlace
Returns true if there was any evaluation.

Dynamo.Models.EvaluationCompletedEventArgs.EvaluationSucceeded
Returns true if Evaluation is succeeded.

Dynamo.Models.EvaluationCompletedEventArgs.Error
Exception thrown during graph evaluation.

Dynamo.Models.EvaluationCompletedEventArgs.#ctor(System.Boolean,System.Exception)
Creates EvaluationCompletedEventArgs
evaluationTookPlace: Bool value indicates if evaluation took place
errorMsg: Exception thrown during evaluation