Dynamo.Engine.EngineController
A controller to coordinate the interactions between some DesignScript
sub components like library management, live runner and so on.

Dynamo.Engine.EngineController.AstBuilt
This event is fired when a node has been compiled.

Dynamo.Engine.EngineController.VMLibrariesReset
The event notifies client that the VMLibraries have been reset and the VM is now ready to run the new code.

Dynamo.Engine.EngineController.TraceReconcliationComplete
This event is fired when Dynamo.Scheduler.UpdateGraphAsyncTask is completed.

Dynamo.Engine.EngineController.VerboseLogging
Bool value indicates if every action should be logged. Used in debug mode.

Dynamo.Engine.EngineController.CompilationServices
Reference to Compilation service. This compiles Input / Output node.

Dynamo.Engine.EngineController.LiveRunnerCore
Returns DesignScript core.

Dynamo.Engine.EngineController.LiveRunnerRuntimeCore
Returns DesignScript runtime core.

Dynamo.Engine.EngineController.LibraryServices
Returns library service instance.

Dynamo.Engine.EngineController.ExecutionTimeData
Returns information about time spent compiling and executing nodes.

Dynamo.Engine.EngineController.IsDisposed
A property defining whether the EngineController has been disposed or not.
This is a conservative field, as there should only be one owner of a valid
EngineController or not.

Dynamo.Engine.EngineController.#ctor(Dynamo.Engine.LibraryServices,System.String,System.Boolean)
This function creates EngineController
libraryServices:  LibraryServices manages builtin libraries and imported libraries.
geometryFactoryFileName: Path to LibG
verboseLogging: Bool value, if set to true, enables verbose logging

Dynamo.Engine.EngineController.Dispose
Disposes EngineController.

Dynamo.Engine.EngineController.EnableProfiling(System.Boolean,Dynamo.Graph.Workspaces.HomeWorkspaceModel,System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
Enables or disables profiling depending on the given argument
enable: Indicates enabling or disabling of profiling.
workspace: The workspace to enable or disable profiling for.
nodes: The list of nodes to enable or disable profiling for.

Dynamo.Engine.EngineController.ImportLibrary(System.String)
Import Library
library:

Dynamo.Engine.EngineController.GetMirror(System.String)
Returns runtime mirror for variable.
variableName: Unique ID of AST node
Returns: RuntimeMirror object that reflects status of a single designscript variable

Dynamo.Engine.EngineController.ComputeSyncData(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Boolean)
This method is called on the main thread from UpdateGraphAsyncTask
to generate GraphSyncData for a list of updated nodes.
nodes:
updatedNodes: The list of all updated nodes.
verboseLogging:
Returns: This method returns true if GraphSyncData is generated from
the list of updated nodes. If updatedNodes is empty or does not
result in any GraphSyncData, then this method returns false.

Dynamo.Engine.EngineController.PreviewGraphSyncData(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Boolean)
This is called on the main thread from PreviewGraphSyncData
to generate the list of node id's that will be executed on the next run
updatedNodes: The updated nodes.
verboseLogging:
Returns: This method returns the list of all reachable node id's from the given
updated nodes

Dynamo.Engine.EngineController.HasPendingGraphSyncData
Returns true if there are graph sync data in the queue waiting to be executed.
Returns:

Dynamo.Engine.EngineController.GenerateGraphSyncDataForCustomNode(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},Dynamo.CustomNodeDefinition,System.Boolean)
Generate graph sync data based on the input Dynamo custom node information.
Returns false if all nodes are clean.
nodes:
definition:
verboseLogging:
Returns:

Dynamo.Engine.EngineController.ProcessPendingCustomNodeSyncData(Dynamo.Scheduler.IScheduler)
DynamoModel calls this method prior to scheduling a graph update for
the home workspace. This method is called to schedule custom node
compilation since the home workspace update may depend on it. Any
updates to a CustomNodeDefinition will cause GraphSyncData to be added
to "pendingCustomNodeSyncData" queue.
scheduler: The scheduler on which custom node compilation
task can be scheduled.

Dynamo.Engine.EngineController.UpdateGraphImmediate(ProtoScript.Runners.GraphSyncData)
This method is called by UpdateGraphAsyncTask in the context of
ISchedulerThread to kick start an update through LiveRunner.
graphSyncData: The GraphSyncData that was generated by
a prior call to ComputeSyncData at the time UpdateGraphAsyncTask was
scheduled.

Dynamo.Engine.EngineController.LibraryLoaded(System.Object,Dynamo.Engine.LibraryServices.LibraryLoadedEventArgs)
LibraryLoaded event handler.

Dynamo.Engine.EngineController.OnCompiling(System.Guid)
This class represents the intermediate state (Compiling state), when a nodemodel is compiled to AST nodes.
nodeGuid: Node unique ID

Dynamo.Engine.EngineController.OnCompiled(System.Guid,System.Collections.Generic.IEnumerable{ProtoCore.AST.AssociativeAST.AssociativeNode})
This class represents a state after a nodemodel is compiled to AST nodes.
nodeGuid: Node unique ID
astNodes: Resulting AST nodes

Dynamo.Engine.EngineController.NodeDeleted(Dynamo.Graph.Nodes.NodeModel)
NodeDeleted event handler.
node:

Dynamo.Engine.EngineController.DeleteFrozenNodesFromAST(Dynamo.Graph.Nodes.NodeModel)
When a node is in freeze state, the node and its dependencies are
deleted from AST
node: The node.