Dynamo.Migration.MigrationManager
This class contains methods and properties used for migration of Dynamo workspaces.

Dynamo.Migration.MigrationManager.MigrationTargets
A collection of types which contain migration methods.

Dynamo.Migration.MigrationManager.#ctor(Dynamo.Migration.MigrationManager.FutureFileCallback,Dynamo.Migration.MigrationManager.ObsoleteFileCallback)
Initializes a new instance of Dynamo.Migration.MigrationManager class
displayFutureFileMessage: Functions that can be used
as a callback in the event a file from a later version of Dynamo
is attempting to be loaded
displayObsoleteFileMessage: Functions that can be used
as a callback in the event an obsolete file is attempted to be loaded.

Dynamo.Migration.MigrationManager.AddMigrationType(Dynamo.Graph.Nodes.TypeLoadData)
Adds a new type containing Migration methods into this manager.
t: Type data to add

Dynamo.Migration.MigrationManager.ProcessWorkspace(Dynamo.Graph.Workspaces.WorkspaceInfo,System.Xml.XmlDocument,System.Boolean,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory)
Attempts to migrate a workspace to the current version of Dynamo.
workspaceInfo: Information about workspace to migrate
xmlDoc: Xml data about workspace to migrate
isTestMode: Indicates if current code is running in tests
factory: Factory to create nodes
Returns: True if the workspace is migrated successfully

Dynamo.Migration.MigrationManager.ProcessWorkspaceMigrations(System.Version,System.Xml.XmlDocument,System.Version)
Runs all migration methods found on the listed migration target types.
currentVersion: Current Dynamo version
xmlDoc: Xml data about workspace to migrate
workspaceVersion: Version of workspace to migrate

Dynamo.Migration.MigrationManager.ProcessNodesInWorkspace(System.Xml.XmlDocument,System.Version,System.Version,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory)
Attempts to migrate nodes in a workspace to the current version of Dynamo.
xmlDoc: Xml data about workspace with nodes to migrate
workspaceVersion: Version of workspace to migrate
currentVersion: Current Dynamo version
nodeFactory: Factory to create nodes

Dynamo.Migration.MigrationManager.MigrateXmlNode(System.Version,System.Xml.XmlNode,System.Type,System.Version)
Attempts to migrate a node to the current version of Dynamo by given xml data
currentVersion: Current Dynamo version
elNode: Xml data about node to migrate
type: Type of node
workspaceVersion: Version of workspace which the node belongs to
Returns: Data about migration of the node

Dynamo.Migration.MigrationManager.BackupOriginalFile(System.String,System.String@)
Call this method to backup the DYN file specified by originalPath. The
new file will be backed up to a location where Dynamo has write access to.
originalPath: Path of the original DYN file to be backed up.
backupPath: Path of the backed up file. This value will be a valid
file path only if this method returns true.
Returns: Returns true if the backup was successful, or false otherwise.

Dynamo.Migration.MigrationManager.GetUniqueFileName(System.String,System.String)
Call this method to get the unique backup file name within the given folder.
folder: The folder where file search should happen.
fileNameWithExtension: The name of the original file which is
to be backed-up. This argument should have an extension, although it is not
mandatory.
Returns: Returns the full path to a unique file name for the backup file.

Dynamo.Migration.MigrationManager.GetBackupFolder(System.String,System.Boolean)
Call this method with a root directory path information, and then
a backup sub-directory will be created below it (if one does not
already exist).
baseFolder: This is a directory inside which a new
backup sub-directory will be created. If this parameter does not
represent a valid directory name, an exception will be thrown.
create: Set this parameter to false if the creation of
the backup sub-directory is not desired. Typically this means the
method is called from within a test case and it is only interested
in getting the resulting path back without actually creating a new
backup sub-directory.
Returns: Returns full path to the backup folder created.

Dynamo.Migration.MigrationManager.GetUniqueIndex(System.String[])
Call this method to determine the next available backup file name from the
given set of file names.
fileNames: An array of file names, each in the form of
'FileName.NNN.backup'.
Returns: Returns the next available index to use as backup file name

Dynamo.Migration.MigrationManager.ExtractFileIndex(System.String)
Call this method to extract the index of a backup file.
fileName: The file name of a backup file. This parameter
must be in the form of 'FileName.NNN.backup', where 'NNN' is an
integer value. The file name must also have a '*.backup' extension.
Returns: Returns the integer equivalent of the backup file index
'NNN' if the call is successful.

Dynamo.Migration.MigrationManager.VersionFromString(System.String)
Remove revision number from 'fileVersion' (so we get '0.6.3.0'
instead of '0.6.3.20048'). This way all migration methods with
'NodeMigration.from' attribute value '0.6.3.xyz' can be used to
migrate nodes in workspace version '0.6.3.ijk' (i.e. the revision
number does not have to be exact match for a migration method to
work).
version: The version string to convert into Version
object. Valid examples include "0.6.3.0" and "0.6.3.20048".
Returns: Returns the Version object representation of 'version'
argument, except without the 'revision number'.

Dynamo.Migration.MigrationManager.VersionFromWorkspace(Dynamo.Graph.Workspaces.WorkspaceModel)
Call this method to obtain the version of current WorkspaceModel.
Note that the revision number is dropped as both "0.7.0.1234"
should be treated as the same version as "0.7.0.5678", and no file
migration should take place.
workspace: The WorkspaceModel to get the Version from.
Returns: Returns the Version object representing the workspace
version with the revision set to 0.

Dynamo.Migration.MigrationManager.ShouldMigrateFile(System.Version,System.Version,System.Boolean)
Call this method to determine if migration should take place
for the input DYN/DYF file based on the given version numbers.
fileVersion: The version of input file.
currVersion: The version of Dynamo software.
isTestMode:
Returns: Returns the decision if the migration should take place or
not. See "Decision" enumeration for details of each field.

Dynamo.Migration.MigrationManager.CreateFunctionNode(System.Xml.XmlDocument,System.Xml.XmlElement,System.Int32,System.String,System.String,System.String)
Call this method to create an empty DSFunction node that contains
basic function node information.
document: The XmlDocument to create the node in.
oldNode: Base node to create a new one
nodeIndex: Index of the node
assembly: Name of the assembly that implements this
function.
name: The name to display on the node.
signature: The signature of the function.
Returns: Returns the XmlElement that represents a DSFunction node
with its basic function information with default attributes.

Dynamo.Migration.MigrationManager.CreateVarArgFunctionNode(System.Xml.XmlDocument,System.Xml.XmlElement,System.Int32,System.String,System.String,System.String,System.String)
Call this method to create an empty DSVarArgFunction node that contains
basic function node information.
document: The XmlDocument to create the node in.
oldNode: Base node to create a new one
nodeIndex: Index of the node
assembly: Name of the assembly that implements this
function.
name: The name to display on the node.
signature: The signature of the function.
Returns: Returns the XmlElement that represents a DSVarArgFunction node
with its basic function information with default attributes.

Dynamo.Migration.MigrationManager.CreateCodeBlockNodeModelNode(System.Xml.XmlDocument,System.Xml.XmlElement,System.Int32,System.String)
This method creates an empty CodeBlockNodeModel node that contains
basic code block node information.
document: The XmlDocument to create the node in.
oldNode: Base node to create a new one
nodeIndex: Index of the node
codeText: Code block content
Returns: Returns the XmlElement that represents a CodeBlockNodeModel node
with its basic function information with default attributes.

Dynamo.Migration.MigrationManager.CreateNode(System.Xml.XmlDocument,System.Xml.XmlElement,System.Int32,System.String,System.String)
This method creates an empty NodeModel node that contains
basic code block node information.
document: The XmlDocument to create the node in.
oldNode: Base node to create a new one
nodeIndex: Index of the node
type: Node type name
name: Name to display on the node
Returns: Returns the XmlElement that represents a NodeModel node
with its basic function information with default attributes.

Dynamo.Migration.MigrationManager.CreateFunctionNodeFrom(System.Xml.XmlElement,System.String[])
Call this method to create a XmlElement with a set of attributes
carried over from the source XmlElement. The new XmlElement will
have a name of "Dynamo.Graph.Nodes.ZeroTouch.DSFunction".
srcElement: The source XmlElement object.
attribNames: The list of attribute names whose values
are to be carried over to the resulting XmlElement. This list is
mandatory and it cannot be empty. If a specified attribute cannot
be found in srcElement, an empty attribute with the same name will
be created in the resulting XmlElement.
Returns: Returns the resulting XmlElement with specified attributes
duplicated from srcElement. The resulting XmlElement will also have
a mandatory "type" attribute with value "Dynamo.Graph.Nodes.ZeroTouch.DSFunction".

Dynamo.Migration.MigrationManager.CreateCustomNodeFrom(System.Xml.XmlDocument,System.Xml.XmlElement,System.String,System.String,System.String,System.Collections.Generic.List{System.String},System.Collections.Generic.List{System.String})
Create a custom node as a replacement for an existing node.
document: The XmlDocument to create the node in.
srcElement: The source XmlElement object.
id: The custom node id.
name: The custom node name.
description: The custom node's description.
inputs: A list of input names.
outputs: A list of output names.
Returns: Returns the XmlElement that represents a custom node
with its basic function information with default attributes.

Dynamo.Migration.MigrationManager.CreateFunctionNodeFrom(System.Xml.XmlElement)
Call this method to create a duplicated XmlElement with
all the attributes found from the source XmlElement.
srcElement: The source XmlElement to duplicate.
Returns: Returns the duplicated XmlElement with all attributes
found in the source XmlElement. The resulting XmlElement will also
have a mandatory "type" attribute with value "Dynamo.Graph.Nodes.ZeroTouch.DSFunction".

Dynamo.Migration.MigrationManager.CreateVarArgFunctionNodeFrom(System.Xml.XmlElement)
This method creates a duplicated XmlElement representing DSVarArgFunction
with all the attributes found from the source XmlElement.
srcElement: The source XmlElement to duplicate.
Returns: Returns the duplicated XmlElement representing DSVarArgFunction
with all attributes found in the source XmlElement.
The resulting XmlElement will also have a mandatory "type" attribute
with value "Dynamo.Graph.Nodes.ZeroTouch.DSVarArgFunction".

Dynamo.Migration.MigrationManager.CreateCodeBlockNodeFrom(System.Xml.XmlElement)
Call this method to create an empty Code Block node, with all
attributes carried over from an existing src XmlElement.
srcElement: The source element from which the Code
Block node XmlElement is constructed. All attributes of the source
XmlElement will be copied over, and Code Block node specific
attributes will be added.
Returns: Returns an XmlElement that represents the resulting Code
Block node.

Dynamo.Migration.MigrationManager.CloneAndChangeName(System.Xml.XmlElement,System.String,System.String,System.Boolean)
Call this method to create a clone of the original XmlElement and
change its type at one go. This method preserves all the attributes
while updating only the type name.
element: The XmlElement to be cloned and the type name
updated.
type: The fully qualified name of the new type.
name: The new name, by which this node is known.
cloneInnerXml: Parameter indicating whether the inner xml
of the original node should be cloned.
Returns: Returns the cloned and updated XmlElement.

Dynamo.Migration.MigrationManager.CreateDummyNode(System.Xml.XmlElement,System.Int32,System.Int32)
Call this method to create a dummy node, should a node failed to be
migrated. This results in a dummy node with a description of what the
original node type was, and also retain the number of input and output
ports.
element: XmlElement representing the original node which
has failed migration.
inportCount: The number of input ports required on the
new dummy node. This number must be a positive number greater or
equal to zero.
outportCount: The number of output ports required on the
new dummy node. This number must be a positive number greater or
equal to zero.
Returns: Returns a new XmlElement representing the dummy node.

Dynamo.Migration.MigrationManager.CreateMissingNode(System.Xml.XmlElement,System.Int32,System.Int32)
Call this method to create a dummy node, should a node failed to be
migrated. This results in a dummy node with a description of what the
original node type was, and also retain the number of input and output
ports.
element: XmlElement representing the original node which
has failed migration.
inportCount: The number of input ports required on the
new dummy node. This number must be a positive number greater or
equal to zero.
outportCount: The number of output ports required on the
new dummy node. This number must be a positive number greater or
equal to zero.
Returns: Returns a new XmlElement representing the dummy node.

Dynamo.Migration.MigrationManager.SetFunctionSignature(System.Xml.XmlElement,System.String,System.String,System.String)
Sets function data such as assembly, display name and function signature
element: Xml element where to set data
assemblyName: Assembly name of the function
methodName: Name of the function
signature: FullName of the function

Dynamo.Migration.MigrationManager.ReplaceAttributeValue(System.Xml.XmlElement,System.String,System.String,System.String)
Call this method to replace the value of attribute.
element: Xml element where to replace attribute value
attribute: Attribute name
from: Original value
to: New value

Dynamo.Migration.MigrationManager.GetGuidFromXmlElement(System.Xml.XmlElement)
Returns node guid specified in given System.Xml.XmlElement
element: System.Xml.XmlElement containing node guid
Returns: Guid of the node