Dynamo.Engine.MemberDocumentNode.#ctor(System.String,System.String)
Constructs an instance of MemberDocumentNode object from its
given assembly and member name.
assemblyName: The assembly inside which this member
resides. If this parameter is null or empty, ArgumentNullException
is thrown.
memberName: The fully qualified name that can be used
to uniquely identify the member within the same assembly. For an
example:
"M:Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)"