Dynamo.Configuration.ViewExtensionDisplayMode
Possible display modes for an extension UI control.

Dynamo.Configuration.ViewExtensionDisplayMode.Unspecified
Not really a display mode but rather the absence of one.

Dynamo.Configuration.ViewExtensionDisplayMode.DockRight
Extension control should be displayed docked to the right side.

Dynamo.Configuration.ViewExtensionDisplayMode.FloatingWindow
Extension control should be displayed in a floating window.