Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode
The connection mode.

Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode.Begin
Begin connection.

Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode.End
End connection.

Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode.BeginShiftReconnections
Begin shift reconnections.

Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode.EndShiftReconnections
End shift reconnections.

Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode.EndAndStartCtrlConnection
End and start control connections.

Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode.Cancel
Cancel connection.

Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode.BeginDuplicateConnection
Begin duplicate connection.

Dynamo.Models.DynamoModel.MakeConnectionCommand.Mode.BeginCreateConnections
End current connection and create new connections.