Dynamo.Engine.FunctionDescriptor
Describe a DesignScript function in a imported library

Dynamo.Engine.FunctionDescriptor.summary
A comment describing the Function

Dynamo.Engine.FunctionDescriptor.#ctor(Dynamo.Engine.FunctionDescriptorParams)
Initializes a new instance of the Dynamo.Engine.FunctionDescriptor class.
funcDescParams: Function descriptor parameters.

Dynamo.Engine.FunctionDescriptor.IsOverloaded
Indicates if the function overloads

Dynamo.Engine.FunctionDescriptor.Assembly
Full path to the assembly which defined this function

Dynamo.Engine.FunctionDescriptor.ClassName
Class name of this function. If the function is global, return String.Empty.

Dynamo.Engine.FunctionDescriptor.FunctionName
Function name.

Dynamo.Engine.FunctionDescriptor.Parameters
Function parameters.

Dynamo.Engine.FunctionDescriptor.ReturnType
Function return type.

Dynamo.Engine.FunctionDescriptor.ReturnKeys
If the function returns a dictionary, ReturnKeys is the key collection
used in returned dictionary.

Dynamo.Engine.FunctionDescriptor.IsVarArg
Does the function accept a variable number of arguments?

Dynamo.Engine.FunctionDescriptor.IsBuiltIn
Indicates if it is a built-in function

Dynamo.Engine.FunctionDescriptor.IsPackageMember
Indicates if the function is packaged element (either zero-touch DLLs or DYFs)

Dynamo.Engine.FunctionDescriptor.ObsoleteMessage
Message specified if function is obsolete

Dynamo.Engine.FunctionDescriptor.IsObsolete
Indicates if the function is obsolete

Dynamo.Engine.FunctionDescriptor.Type
Function type.

Dynamo.Engine.FunctionDescriptor.Summary
Returns summary of the function from its documentation xml
using the corresponding FunctionDescriptor object.

Dynamo.Engine.FunctionDescriptor.Description
A comment describing the function along with the signature

Dynamo.Engine.FunctionDescriptor.Returns
If the XML documentation for the function includes a returns field,
this parameter contains a collection of tuples of output names to
descriptions.
Otherwise, this list will be empty.

Dynamo.Engine.FunctionDescriptor.InputParameters
Inputs for Node

Dynamo.Engine.FunctionDescriptor.Category
The category of this function.

Dynamo.Engine.FunctionDescriptor.QualifiedName
The string that is used to search for this function.

Dynamo.Engine.FunctionDescriptor.MangledName
A unique name to identify a function. It is necessary when a
function is overloaded.

Dynamo.Engine.FunctionDescriptor.Signature
The full signature of the function.

Dynamo.Engine.FunctionDescriptor.UserFriendlyName
Return a user friendly name. E.g., for operator '+' it will return
'Add'

Dynamo.Engine.FunctionDescriptor.DisplayName
QualifiedName with leading namespaces removed.

Dynamo.Engine.FunctionDescriptor.IsVisibleInLibrary
This attribute sets, if this function is shown in library or not.

Dynamo.Engine.FunctionDescriptor.CanUpdatePeriodically
This attribute sets whether the function enables periodic update of the workspace.

Dynamo.Engine.FunctionDescriptor.UnqualifedClassName
Returns class name without namespace

Dynamo.Engine.FunctionDescriptor.Namespace
Returns namespace where the function is specified

Dynamo.Engine.FunctionDescriptor.PathManager
Returns instance of IPathManager

Dynamo.Engine.FunctionDescriptor.IsLacingDisabled
Returns if the lacing strategy is disabled

Dynamo.Engine.FunctionDescriptor.Equals(System.Object)
Overrides equality check of two Dynamo.Engine.FunctionDescriptor objects
obj: Dynamo.Engine.FunctionDescriptor object to compare
with the current one
Returns: Returns true if two Dynamo.Engine.FunctionDescriptor objects
are equals

Dynamo.Engine.FunctionDescriptor.GetHashCode
Overrides computing the hash code for the Dynamo.Engine.FunctionDescriptor
Returns: The hash code for this Dynamo.Engine.FunctionDescriptor