Dynamo.Selection.ISelectable
Interface, that provides selectable objects. These are objects, which user can select by mouse.
E.g. nodes, connectors, groups etc.

Dynamo.Selection.ISelectable.IsSelected
Bool value indicates if object is selected or not.

Dynamo.Selection.ISelectable.Select
Select object.

Dynamo.Selection.ISelectable.Deselect
Deselect object.