Dynamo.Exceptions.LibraryLoadFailedException
Customized exception thrown when library load failed.

Dynamo.Exceptions.LibraryLoadFailedException.Path
File path of failing dll.

Dynamo.Exceptions.LibraryLoadFailedException.Reason
Failure reason.

Dynamo.Exceptions.LibraryLoadFailedException.#ctor(System.String,System.String)
Constructor.
path:
reason: