Dynamo.Models.DynamoModel.DragSelectionCommand
A command to begin or end dragging a selection.

Dynamo.Models.DynamoModel.DragSelectionCommand.#ctor(Dynamo.Utilities.Point2D,Dynamo.Models.DynamoModel.DragSelectionCommand.Operation)
mouseCursor:
operation: