Dynamo.Graph.Nodes.OutPortTypesAttribute
Indicates output ports' types

Dynamo.Graph.Nodes.OutPortTypesAttribute.#ctor(System.Type,System.String[])
Loads ports types from resource.
resourceType: resource type, i.e. type of resource class specified in .resx file
resourceNames: resource names

Dynamo.Graph.Nodes.OutPortTypesAttribute.#ctor(System.String[])
Loads ports types, that are specified directly in Attribute.
types:

Dynamo.Graph.Nodes.OutPortTypesAttribute.PortTypes
Port types, that are shown in Dynamo tooltips.