Dynamo.Search.NodeSearchModel
Searchable library of NodeSearchElements that can produce NodeModels.

Dynamo.Search.NodeSearchModel.#ctor(Dynamo.Logging.ILogger)
Construct a NodeSearchModel object
logger:  (Optional) A logger to pass through to SearchLibrary for logging search data

Dynamo.Search.NodeSearchModel.DumpLibraryToXml(System.String,System.String)
Dumps the contents of search into an Xml file.
fileName:

Dynamo.Search.NodeSearchModel.ComposeXmlForLibrary(System.String)
Serializes the contents of search into Xml.
Returns:

Dynamo.Search.NodeSearchModel.ProcessNodeCategory(System.String,Dynamo.Search.SearchElements.SearchElementGroup@)
Call this method to assign a default grouping information if a given category
does not have any. A node category's group can either be "Create", "Query" or
"Actions". If none of the group names above is assigned to the category, it
will be assigned a default one that is "Actions".
For examples:
"Core.Evaluate" will be renamed as "Core.Evaluate.Actions"
"Core.List.Create" will remain as "Core.List.Create"