Dynamo.Graph.Notes.NoteModel
NoteModel represents notes in Dynamo.

Dynamo.Graph.Notes.NoteModel.Text
Returns the text inside the note.

Dynamo.Graph.Notes.NoteModel.PinnedNode
NodeModel which this Note is pinned to
When using the pin to node command
note and node become entangled so that
if you select and move one the other one
moves as well.

Dynamo.Graph.Notes.NoteModel.#ctor(System.Double,System.Double,System.String,System.Guid)
Creates NoteModel.
x: X coordinate of note.
y: Y coordinate of note.
text: Text of note
guid: Unique id of note

Dynamo.Graph.Notes.NoteModel.#ctor(System.Double,System.Double,System.String,System.Guid,Dynamo.Graph.Nodes.NodeModel)
Creates NoteModel with a reference to a pinned node.
x: X coordinate of note.
y: Y coordinate of note.
text: Text of note
guid: Unique id of note
pinnedNode: Pinned NodeModel