Dynamo.Selection.DynamoSelection.Selection
Returns a collection of ISelectable elements.

Dynamo.Selection.DynamoSelection.selection_CollectionChanged(System.Object,System.Collections.Specialized.NotifyCollectionChangedEventArgs)
A callback for automatically selecting and deselecting elements
when they are added to the Selection collection
sender:
e:

Dynamo.Selection.DynamoSelection.ClearSelection
Clears the selection, deslecting everything that is selected