Dynamo.Models.DynamoModel.ModelBasedRecordableCommand
This class is base for those RecordableCommands that should have
Guid that causes the problems during deserialization

Dynamo.Models.DynamoModel.ModelBasedRecordableCommand.ModelGuid
The first System.Guid in the Dynamo.Models.DynamoModel.ModelBasedRecordableCommand.ModelGuid collection, or an empty System.Guid.

Dynamo.Models.DynamoModel.ModelBasedRecordableCommand.ModelGuids
A collection of System.Guid.

Dynamo.Models.DynamoModel.ModelBasedRecordableCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid})
A collection of System.Guid identifying the objects on which to operate.
guids: