Dynamo.Engine.FunctionGroup
A group of overloaded functions

Dynamo.Engine.FunctionGroup.#ctor(System.String)
Initializes a new instance of the Dynamo.Engine.FunctionGroup class.
qualifiedName: Qualified name.

Dynamo.Engine.FunctionGroup.QualifiedName
Returns qualified name of the corresponding functions

Dynamo.Engine.FunctionGroup.Functions
Returns collection of functions with common qualified name

Dynamo.Engine.FunctionGroup.AddFunctionDescriptor(Dynamo.Engine.FunctionDescriptor)
Add a function descriptor to the group
function: Dynamo.Engine.FunctionDescriptor object to add
Returns: True if descriptor has been added

Dynamo.Engine.FunctionGroup.GetFunctionDescriptor(System.String)
Returns function descriptor from mangled function name
managledName:
Returns:

Dynamo.Engine.FunctionGroup.Equals(System.Object)
Overrides equality check of two Dynamo.Engine.FunctionGroup objects
obj: Dynamo.Engine.FunctionGroup object to compare
with the current one
Returns: Returns true if two Dynamo.Engine.FunctionGroup objects
are equals

Dynamo.Engine.FunctionGroup.GetHashCode
Overrides computing the hash code for the Dynamo.Engine.FunctionGroup
Returns: The hash code for this Dynamo.Engine.FunctionGroup