Dynamo.Graph.Nodes.OutPortNamesAttribute
Indicates output ports' names.

Dynamo.Graph.Nodes.OutPortNamesAttribute.#ctor(System.Type,System.String[])
Loads ports names from resource.
resourceType: resource type, i.e. type of resource class specified in .resx file
resourceNames: resource names

Dynamo.Graph.Nodes.OutPortNamesAttribute.#ctor(System.String[])
Loads ports names, that are specified directly in Attribute.
names:

Dynamo.Graph.Nodes.OutPortNamesAttribute.PortNames
Port titles, that are shown in Dynamo.