Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel
This class contains methods and properties that defines a customnodeworkspace.

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.CustomNodeId
Returns identifier of the custom node

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.#ctor(Dynamo.Graph.Workspaces.WorkspaceInfo,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory)
Initializes a new instance of the Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel class
by given information about it and node factory
info: Information for creating custom node workspace
factory: Node factory to create nodes

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.#ctor(Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Annotations.AnnotationModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Presets.PresetModel},ProtoCore.Namespace.ElementResolver,Dynamo.Graph.Workspaces.WorkspaceInfo)
Initializes a new instance of the Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel class
by given information about it and specified item collections
factory: Node factory to create nodes
nodes: Node collection of the workspace
notes: Note collection of the workspace
annotations: Group collection of the workspace
presets: Preset collection of the workspace
elementResolver: ElementResolver responsible for resolving
a partial class name to its fully resolved name
info: Information for creating custom node workspace

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.CustomNodeDependencies
All CustomNodeDefinitions which this Custom Node depends on.

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.CustomNodeDefinition
The definition of this custom node, based on the current state of this workspace.

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.CustomNodeInfo
The information about this custom node, based on the current state of this workspace.

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.GetSharedName
Gets appropriate name of workspace for sharing.
Returns: The name of workspace for sharing

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.SetInfo(System.String,System.String,System.String,System.String)
Updates custom node information by given data
newName: New name of the workspace.
The name will not change if the parameter is omitted.
newCategory: New category of the workspace.
The category will not change if the parameter is omitted.
newDescription: New description of the workspace.
The description will not change if the parameter is omitted.
newFilename: New file name of the workspace.
The file name will not change if the parameter is omitted.

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.Category
Search category for this workspace, if it is a Custom Node.

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.Description
A description of the workspace

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.IsVisibleInDynamoLibrary
Custom node visibility in the Dynamo library

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.InfoChanged
Notifies listeners that custom node workspace has changed

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.SilenceDefinitionUpdated
Disable the DefinitionUpdated event. This might be desirable to lump a large number of
workspace changes into a single event.

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.DefinitionUpdated
Notifies all custom node instances that definition has changed

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.FunctionIdChanged
Notifies listeners that custom node identifier has changed

Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel.Save(System.String,System.Boolean,Dynamo.Engine.EngineController)
Saves custom node workspace
newPath: New location to save the workspace.
isBackup: Indicates whether saved workspace is backup or not. If it's not backup,
we should add it to recent files. Otherwise leave it.
engine:
Returns: