Dynamo.Logging.ILogger
Consumes messages to be used for logging.

Dynamo.Logging.ILogger.Log(System.String)
Logs the specified message.

Dynamo.Logging.ILogger.Log(System.String,System.String)
Logs data with an associated tag.
tag: Tag.
message: Message to be logged.

Dynamo.Logging.ILogger.LogError(System.String)
Logs error.
error: Error message.

Dynamo.Logging.ILogger.LogWarning(System.String,Dynamo.Logging.WarningLevel)
Logs warning.
warning: Warning message.
level: Warning level.

Dynamo.Logging.ILogger.Log(System.Exception)
Logs exception.
e: Exception.