Dynamo.Scheduler.UpdateGraphAsyncTask.Initialize(Dynamo.Engine.EngineController,Dynamo.Graph.Workspaces.WorkspaceModel)
This method is called by code that intends to start a graph update.
This method is called on the main thread where node collection in a
WorkspaceModel can be safely accessed.
controller: Reference to an instance of EngineController
to assist in generating GraphSyncData object for the given set of nodes.
workspace: Reference to the WorkspaceModel from which a
set of updated nodes is computed. The EngineController generates the
resulting GraphSyncData from this list of updated nodes.
Returns: Returns true if there is any GraphSyncData, or false otherwise
(in which case there will be no need to schedule UpdateGraphAsyncTask
for execution).

Dynamo.Scheduler.UpdateGraphAsyncTask.CanReplace(Dynamo.Scheduler.UpdateGraphAsyncTask)
Returns true if this task's graph sync data is a super set of the other
other:
Returns:

Dynamo.Scheduler.UpdateGraphAsyncTask.ComputeModifiedNodes(Dynamo.Graph.Workspaces.WorkspaceModel)
This method is called to gather all the nodes whose cached values
should be updated after graph update is done. This set of nodes
includes nodes that are explicitly marked as requiring update, as
well as all its downstream nodes.
workspace: The WorkspaceModel from which nodes are to
be retrieved.
Returns: Returns a list of NodeModel whose cached values are to be
updated after the evaluation.

Dynamo.Scheduler.UpdateGraphAsyncTask.GetDownstreamNodes(Dynamo.Graph.Nodes.NodeModel,System.Collections.Generic.ICollection{Dynamo.Graph.Nodes.NodeModel})
Call this method to recursively gather downstream nodes of a given node.
Returns only those nodes that are in RUN state.
node: A NodeModel whose downstream nodes are to be gathered.
gathered: A list of all downstream nodes.