Dynamo.Graph.Workspaces.IPackageInfo
Interface for types containing info about a package

Dynamo.Graph.Workspaces.IPackageInfo.Name
Name of the package

Dynamo.Graph.Workspaces.IPackageInfo.Version
Version of the package