Dynamo.Updates.UpdateDownloadedEventArgs
Provides data for Dynamo.Updates.UpdateManager.UpdateDownloaded events.

Dynamo.Updates.UpdateDownloadedEventArgs.#ctor(System.Exception,System.String)
Initializes a new instance of the Dynamo.Updates.UpdateDownloadedEventArgs class
with the error and the update location
error: The exception thrown during downloading update.
Null if update is downloaded successfully.
fileLocation: Location where the update has been downloaded to.

Dynamo.Updates.UpdateDownloadedEventArgs.UpdateAvailable
Returns flag which indicates if update has been downloaded.

Dynamo.Updates.UpdateDownloadedEventArgs.UpdateFileLocation
Returns location where the update has been downloaded to.

Dynamo.Updates.UpdateDownloadedEventArgs.Error
Returns exception thrown during downloading update.
Null if update is downloaded successfully.