Dynamo.Engine.DocumentationServices.FindFileInPaths(System.String,System.String,System.String[])
searchs for a file with an extension in a list of paths, returns the first match
where the extension is case insensitive. If no file is found, returns an empty string.
filename:
extension:
searchPaths:
Returns: