Dynamo.Models.DynamoModel.CreateProxyNodeCommand
A command containing additional information needed for creating a proxy custom node.

Dynamo.Models.DynamoModel.CreateProxyNodeCommand.#ctor(System.String,System.String,System.Double,System.Double,System.Boolean,System.Boolean,System.String,System.Int32,System.Int32)
nodeId:
customnodeFunctionId:
x:
y:
defaultPosition:
transformCoordinates:
name:
inputs:
outputs: