Dynamo.Graph.Nodes.InPortNamesAttribute
Indicates input ports' names.

Dynamo.Graph.Nodes.InPortNamesAttribute.#ctor(System.Type,System.String[])
Loads ports names from resource.
resourceType: resource type, i.e. type of resource class specified in .resx file
resourceNames: resource names

Dynamo.Graph.Nodes.InPortNamesAttribute.#ctor(System.String[])
Loads ports names, that are specified directly in Attribute.
names:

Dynamo.Graph.Nodes.InPortNamesAttribute.PortNames
Port titles, that are shown in Dynamo.