Dynamo.Graph.Workspaces.WorkspaceModel
Represents base class for all kind of workspaces which contains general data
such as Name, collections of nodes, notes, annotations, etc.

Dynamo.Graph.Workspaces.WorkspaceModel.UndoRecorder
Returns the current UndoRedoRecorder that is associated with the current
WorkspaceModel. Note that external parties should not have the needs
to access the recorder directly, so this property is exposed just as
a "temporary solution". Before using this property, consider using
WorkspaceModel.RecordModelsForUndo method which allows for multiple
modifications in a single action group.

Dynamo.Graph.Workspaces.WorkspaceModel.CanUndo
Determine if undo operation is currently possible.

Dynamo.Graph.Workspaces.WorkspaceModel.CanRedo
Determine if redo operation is currently possible.

Dynamo.Graph.Workspaces.WorkspaceModel.RecordModelsForModification(System.Collections.Generic.List{Dynamo.Graph.ModelBase},Dynamo.Core.UndoRedoRecorder)
TODO(Ben): This method is exposed this way for external codes (e.g.
the DragCanvas) to record models before they are modified. This is
by no means ideal. The ideal case of course is for ALL codes that
end up modifying models to be folded back into WorkspaceViewModel in
the form of commands. These commands then internally record those
affected models before updating them. We need this method to be gone
sooner than later.
models: The models to be recorded for undo.
recorder:

Dynamo.Graph.Workspaces.WorkspaceModel.RecordModelsForModification(System.Collections.Generic.List{Dynamo.Graph.ModelBase})
This method assumes an undo-redo action group already exists
and records in it models that are modified.
models:

Dynamo.Graph.Workspaces.WorkspaceModel.DeleteModel(System.Xml.XmlElement)
Deletes Dynamo.Graph.ModelBase object given by System.Xml.XmlElement
from a corresponding collection of the workspace.
modelData: Dynamo.Graph.ModelBase object given by System.Xml.XmlElement

Dynamo.Graph.Workspaces.WorkspaceModel.RemoveGroup(Dynamo.Graph.ModelBase)
Deletes Dynamo.Graph.Annotations.AnnotationModel object from annotation collection of the workspace.
model: Dynamo.Graph.Annotations.AnnotationModel object to remove.

Dynamo.Graph.Workspaces.WorkspaceModel.ReloadModel(System.Xml.XmlElement)
Updates Dynamo.Graph.ModelBase object with given xml data
modelData: Xml data to update model

Dynamo.Graph.Workspaces.WorkspaceModel.CreateModel(System.Xml.XmlElement)
Creates Dynamo.Graph.ModelBase object by given xml data and
adds it to corresponding collection of the workspace.
modelData: Xml data to create model

Dynamo.Graph.Workspaces.WorkspaceModel.GetModelForElement(System.Xml.XmlElement)
Gets model by GUID which is contained in given Xml data.
modelData: Xml data to find model.
Returns: Found Dynamo.Graph.ModelBase object.

Dynamo.Graph.Workspaces.WorkspaceModel.GetModelInternal(System.Guid)
Returns model by GUID
modelGuid: Identifier of the requested model.
Returns: Found Dynamo.Graph.ModelBase object.

Dynamo.Graph.Workspaces.WorkspaceModel.GetModelsInternal(System.Collections.Generic.IEnumerable{System.Guid})
Gets model list by their GUIDs
modelGuids: Identifiers of the requested models.
Returns: All found Dynamo.Graph.ModelBase objects.

Dynamo.Graph.Workspaces.WorkspaceModel.currentPasteOffset
The offset of the elements in the current paste operation

Dynamo.Graph.Workspaces.WorkspaceModel.PasteOffsetStep
The step to offset elements between subsequent paste operations

Dynamo.Graph.Workspaces.WorkspaceModel.PasteOffsetMax
The maximum paste offset before reset

Dynamo.Graph.Workspaces.WorkspaceModel.DelayGraphExecution
Whether or not to delay graph execution.

Dynamo.Graph.Workspaces.WorkspaceModel.workspaceLoaded
This is set to true after a workspace is added.
This is set to false, if the workspace is cleared or disposed.

Dynamo.Graph.Workspaces.WorkspaceModel.DummyNodesReloaded
This event is raised after the workspace tries to resolve existing dummyNodes - for example after a new package or library is loaded.

Dynamo.Graph.Workspaces.WorkspaceModel.OnDummyNodesReloaded
This method invokes the DummyNodesReloaded event on the workspace model.

Dynamo.Graph.Workspaces.WorkspaceModel.setNameBasedOnFileName(System.String,System.Boolean)
sets the name property of the model based on filename,backup state and model type.
filePath: Full filepath to file to save.
isBackup: Indicates if this save represents a backup save.

Dynamo.Graph.Workspaces.WorkspaceModel.RequestNodeCentered
Event that is fired when a workspace requests that a Node or Note model is
centered.

Dynamo.Graph.Workspaces.WorkspaceModel.OnRequestNodeCentered(System.Object,Dynamo.Models.ModelEventArgs)
Requests that a Node or Note model should be centered.
sender: The workspace object where the event handler is attached.
e: The event data containing sufficient information about node.

Dynamo.Graph.Workspaces.WorkspaceModel.CurrentOffsetChanged
Event that is fired every time the position offset of a workspace changes.

Dynamo.Graph.Workspaces.WorkspaceModel.OnCurrentOffsetChanged(System.Object,Dynamo.Models.PointEventArgs)
Used during open and workspace changes to set the location of the workspace
sender: The object which triggers the event
e: The offset event data.

Dynamo.Graph.Workspaces.WorkspaceModel.Saved
Event that is fired when the workspace is saved.

Dynamo.Graph.Workspaces.WorkspaceModel.WorkspaceSaving
Event that is fired when the workspace is starting the save process.

Dynamo.Graph.Workspaces.WorkspaceModel.NodeAdded
Event that is fired when a node is added to the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.NodeRemoved
Event that is fired when a node is removed from the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.NodesCleared
Event that is fired when nodes are cleared from the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.NoteAdded
Event that is fired when a note is added to the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.NoteRemoved
Event that is fired when a note is removed from the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.NotesCleared
Event that is fired when notes are cleared from the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.AnnotationAdded
Event that is fired when an annotation is added to the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.AnnotationRemoved
Event that is fired when an annotation is removed from the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.AnnotationsCleared
Event that is fired when annotations are cleared from the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.ConnectorAdded
Event that is fired when a connector is added to the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.ConnectorDeleted
Event that is fired when a connector is deleted from a workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.RecordModelsForModification(System.Collections.Generic.IEnumerable{Dynamo.Graph.ModelBase})
Implement recording node modification for undo/redo.
models: Collection of Dynamo.Graph.ModelBase objects to record.

Dynamo.Graph.Workspaces.WorkspaceModel.Disposed
Event that is fired when this workspace is disposed of.

Dynamo.Graph.Workspaces.WorkspaceModel.Saving
Event that is fired during the saving of the workspace.
Add additional XmlNode objects to the XmlDocument provided,
in order to save data to the file.

Dynamo.Graph.Workspaces.WorkspaceModel.CollectingCustomNodePackageDependencies
Event that is fired when the workspace is collecting custom node package dependencies.
This event should only be subscribed to by the package manager.

Dynamo.Graph.Workspaces.WorkspaceModel.CollectingNodePackageDependencies
Event that is fired when the workspace is collecting node package dependencies.
This event should only be subscribed to by the package manager.

Dynamo.Graph.Workspaces.WorkspaceModel.NodeFactory
A NodeFactory used by this workspace to create Nodes.

Dynamo.Graph.Workspaces.WorkspaceModel.Presets
A set of input parameter states, this can be used to set the graph to a serialized state.

Dynamo.Graph.Workspaces.WorkspaceModel.LastSaved
The date of the last save.

Dynamo.Graph.Workspaces.WorkspaceModel.Dependencies
gathers the direct customNode workspace dependencies of this workspace.
Returns:  a list of workspace IDs in GUID form

Dynamo.Graph.Workspaces.WorkspaceModel.RequestPackageDependencies
Event requesting subscribers to return additional package dependencies for
current workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.OnRequestPackageDependencies
Raised when the workspace needs to request for additional package dependencies
that can be returned from other subscribers such as view extensions.
E.g. The PythonMigrationViewExtension returns additional package dependencies required for Python engines.
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.NodeLibraryDependencies
NodeLibraries that the nodes in this graph depend on

Dynamo.Graph.Workspaces.WorkspaceModel.Author
An author of the workspace

Dynamo.Graph.Workspaces.WorkspaceModel.Description
A description of the workspace

Dynamo.Graph.Workspaces.WorkspaceModel.HasUnsavedChanges
Are there unsaved changes in the workspace?

Dynamo.Graph.Workspaces.WorkspaceModel.IsReadOnly
Returns if current workspace is readonly.

Dynamo.Graph.Workspaces.WorkspaceModel.Nodes
All of the nodes currently in the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.ClearConnector(Dynamo.Graph.Connectors.ConnectorModel)
This function records the deletion of a certain connector.
Has to be in the workspace model because though the original command
is called in the connectorviewmodel, the action of recording, destroying,
and recreating itself has to occur outside of it.
connectorModel:

Dynamo.Graph.Workspaces.WorkspaceModel.Connectors
All of the connectors currently in the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.Notes
Returns the notes Dynamo.Graph.Notes.NoteModel collection.

Dynamo.Graph.Workspaces.WorkspaceModel.Annotations
Returns all of the annotations currently present in the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.FileName
Path to the file this workspace is associated with. If null or empty, this workspace has never been saved.

Dynamo.Graph.Workspaces.WorkspaceModel.Name
The name of this workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.X
Returns or set the X position of the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.Y
Returns or set the Y position of the workspace

Dynamo.Graph.Workspaces.WorkspaceModel.Zoom
Get or set the zoom value of the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.Height
Returns the height of the workspace's bounds.

Dynamo.Graph.Workspaces.WorkspaceModel.Width
Returns the width of the workspace's bounds.

Dynamo.Graph.Workspaces.WorkspaceModel.Rect
Returns the bounds of the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.CenterX
Implements Dynamo.Graph.ILocatable.CenterX property.

Dynamo.Graph.Workspaces.WorkspaceModel.CenterY
Implements Dynamo.Graph.ILocatable.CenterY property.

Dynamo.Graph.Workspaces.WorkspaceModel.ElementResolver
Returns Dynamo.Graph.Workspaces.WorkspaceModel.ElementResolver. This property resolves partial class name to fully resolved name.

Dynamo.Graph.Workspaces.WorkspaceModel.Guid
A unique identifier for the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.ScaleFactor
The geometry scale factor specific to the workspace obtained from user input
when selecting the scale of the model with which he/she is working.
This is used by ProtoGeometry to scale geometric values appropriately before passing them to ASM.
This property is set either when reading the setting from a DYN file or when the setting is updated from the UI.

Dynamo.Graph.Workspaces.WorkspaceModel.computeUpstreamNodesWhenWorkspaceAdded(Dynamo.Events.WorkspacesModificationEventArgs)
Computes the upstream nodes when workspace is added. when a workspace is added (assuming that
all the nodes and its connectors were added successfully) compute the upstream cache for all
the frozen nodes.
args: The Dynamo.Events.WorkspacesModificationEventArgs instance containing the event data.

Dynamo.Graph.Workspaces.WorkspaceModel.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
2

Dynamo.Graph.Workspaces.WorkspaceModel.GetSharedName
Returns appropriate name of workspace for sharing.

Dynamo.Graph.Workspaces.WorkspaceModel.Clear
Clears this workspace of nodes, notes, and connectors.

Dynamo.Graph.Workspaces.WorkspaceModel.Save(System.String,System.Boolean,Dynamo.Engine.EngineController)
Workspace's Save method serializes the Workspace to JSON and writes it to the specified file path.
filePath: The path of the file.
isBackup: A flag indicating whether this save operation represents a backup. If it's not backup,
we should add it to recent files. Otherwise leave it.
engine: An EngineController instance to be used to serialize node bindings.
Throws System.ArgumentNullException: Thrown when the file path is null.

Dynamo.Graph.Workspaces.WorkspaceModel.AddAndRegisterNode(Dynamo.Graph.Nodes.NodeModel,System.Boolean)
Adds a node to this workspace.
node: The node which is being added to the workspace.
centered: Indicates if the node should be placed at the center of workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.NodeModified(Dynamo.Graph.Nodes.NodeModel)
Indicates that the AST for a node in this workspace requires recompilation

Dynamo.Graph.Workspaces.WorkspaceModel.RemoveAndDisposeNode(Dynamo.Graph.Nodes.NodeModel,System.Boolean)
Removes a node from this workspace.
This method does not raise a NodesModified event. (LC notes this is clearly not true)
model: The node which is being removed from the worksapce.

Dynamo.Graph.Workspaces.WorkspaceModel.SetModelEventOnAnnotation
this sets the event on Annotation. This event return the model from the workspace.
When a model is ungrouped from a group, that model will be deleted from that group.
So, when UNDO execution, cannot get that model from that group, it has to get from the workspace.
The below method will set the event on every annotation model, that will return the specific model
from workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.annotationModel_GetModelBase(System.Guid)
Returns the model from Workspace
modelGuid: The model unique identifier.
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.CheckIfModelExistsInSomeGroup(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel})
Checks if model exists in some group.
selectNodes: The select nodes.
selectNotes: The select notes.
Returns: true if any of the models are already in a group

Dynamo.Graph.Workspaces.WorkspaceModel.ResetWorkspaceCore
Derived workspace classes can choose to override
this method to perform clean-up specific to them.

Dynamo.Graph.Workspaces.WorkspaceModel.GetSourceNodes
Returns the nodes in the graph that have no inputs or have none of their inputs filled
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.ComputeUpstreamCacheForEntireGraph
This method ensures that all upstream node caches are correct by calling
ComputeUpstreamOnDownstream on all source nodes in the graph,
this is done in such a way that each node is only computed once.

Dynamo.Graph.Workspaces.WorkspaceModel.ReportPosition
Called when workspace position is changed. This method notifyies all the listeners when a workspace is changed.

Dynamo.Graph.Workspaces.WorkspaceModel.IncrementPasteOffset
Increment the current paste offset to prevent overlapping pasted elements

Dynamo.Graph.Workspaces.WorkspaceModel.containsXmlDummyNodes
Returns true if the graph currently contains dummy node which point to XML content.
These nodes cannot be serialized to json correctly.
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.containsInvalidInputSymbols
Returns true if the workspace contains input symbols with invalid names.
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.GetNameOfAssemblyReferencedByNode(Dynamo.Graph.Nodes.NodeModel)
Gets the top level assembly referenced by a node in this workspace
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.VoidNodeDependency(System.Guid)
Removes a nodes deserialized package dependency,
causing it to be updated during the next Package Dependencies update
nodeID:

Dynamo.Graph.Workspaces.WorkspaceModel.GetNodePackage(Dynamo.Graph.Nodes.NodeModel)
Gets the PackageInfo from a node in the current WorkspaceModel
node:
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.MessageLogged
Triggers when something needs to be logged

Dynamo.Graph.Workspaces.WorkspaceModel.FromJson(System.String,Dynamo.Engine.LibraryServices,Dynamo.Engine.EngineController,Dynamo.Scheduler.DynamoScheduler,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,System.Boolean,System.Boolean,Dynamo.Core.CustomNodeManager)
Load a WorkspaceModel from json. If the WorkspaceModel is a HomeWorkspaceModel
it will be set as the current workspace.
json:
libraryServices:
engineController:
scheduler:
factory:
isTestMode:
verboseLogging:
manager:

Dynamo.Graph.Workspaces.WorkspaceModel.UpdateWithExtraWorkspaceViewInfo(Dynamo.Graph.Workspaces.ExtraWorkspaceViewInfo)
Updates a workspace model with extra view information. When loading a workspace from JSON,
the data is split into two parts, model and view. This method sets the view information.
workspaceViewInfo: The extra view information from the workspace to update the model with.

Dynamo.Graph.Workspaces.WorkspaceModel.BeginDelayedGraphExecution
Returns a DelayedGraphExecution object.