Dynamo.Models.DynamoModel.CreateCustomNodeCommand
A command to create a custom node.

Dynamo.Models.DynamoModel.CreateCustomNodeCommand.#ctor(System.String,System.String,System.String,System.String,System.Boolean)
nodeId:
name:
category:
description:
makeCurrent:

Dynamo.Models.DynamoModel.CreateCustomNodeCommand.#ctor(System.Guid,System.String,System.String,System.String,System.Boolean)
nodeId:
name:
category:
description:
makeCurrent:

Dynamo.Models.DynamoModel.CreateCustomNodeCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid},System.String,System.String,System.String,System.Boolean)
nodeId:
name:
category:
description:
makeCurrent: