Dynamo.Models.DynamoModel.PausePlaybackCommand
A command used to pause command playback.

Dynamo.Models.DynamoModel.PausePlaybackCommand.#ctor(System.Int32)
pauseDurationInMs: The duration to pause the playback in milliseconds.