Dynamo.Graph.ConnectorPinModel
Connector Pin Model

Dynamo.Graph.ConnectorPinModel.ConnectorId
Connector Id

Dynamo.Graph.ConnectorPinModel.StaticWidth
Required when needing to pull a reliable value for objects of this
type when there is no instances of this object type.

Dynamo.Graph.ConnectorPinModel.Height
Static height of pin

Dynamo.Graph.ConnectorPinModel.Width
Static width of pin

Dynamo.Graph.ConnectorPinModel.#ctor(System.Double,System.Double,System.Guid,System.Guid)
Constructor
x:
y:
id:
connectorId: