Dynamo.Graph.Nodes.NodeDescriptionAttribute
The NodeDescriptionAttribute attribute allows the node implementer
to define node description.

Dynamo.Graph.Nodes.NodeDescriptionAttribute.#ctor(System.String)
Creates NodeDescriptionAttribute with string.
description: String description. E.g. "Get a color given a color range." for ColorRange node.

Dynamo.Graph.Nodes.NodeDescriptionAttribute.#ctor(System.String,System.Type)
Creates NodeDescriptionAttribute with description from resx file.
descriptionResourceID: Resource name
resourceType: Type of Resource. E.g. typeof(Resource)

Dynamo.Graph.Nodes.NodeDescriptionAttribute.ElementDescription
Description of the node.
E.g. "Get a color given a color range." for ColorRange node.