Dynamo.Engine.LibraryCustomization
Implements library customization class that provides customization resources

Dynamo.Engine.LibraryCustomization.ResourceAssembly
Resources assembly. Assembly where icons are saved.