Dynamo.Models.DynamoModel
The core model of Dynamo.

Dynamo.Models.DynamoModel.ExecuteCommand(Dynamo.Models.DynamoModel.RecordableCommand)
Executes specified command
command: Command to execute

Dynamo.Models.DynamoModel.CreateAndConnectNodeImplWithUndoGroup(Dynamo.Models.DynamoModel.CreateAndConnectNodeCommand)
This method assumes that there exists an undo-redo action group already
that can be used to record creation and deletion of models.
command:

Dynamo.Models.DynamoModel.PropertyChanged
Occurs when a property of DynamoModel is changed

Dynamo.Models.DynamoModel.RequestDispatcherInvoke
Occurs when an action needs to be invoked on a Dispather

Dynamo.Models.DynamoModel.OnRequestDispatcherInvoke(System.Action)
Tries to invoke a given action on Dispather
action: Action to invoke

Dynamo.Models.DynamoModel.RequestDispatcherBeginInvoke
Occurs when an action needs to be invoked asynchronously on a Dispather

Dynamo.Models.DynamoModel.OnRequestDispatcherBeginInvoke(System.Action)
Tries to invoke a given action asynchronously on Dispather
action: Action to invoke

Dynamo.Models.DynamoModel.RequestLayoutUpdate
Occurs when changes in data may affect UI and UI needs to be refreshed

Dynamo.Models.DynamoModel.OnRequestLayoutUpdate(System.Object,System.EventArgs)
Called when Requests to update UI is made.
sender: Object which caused the event
e: The event data

Dynamo.Models.DynamoModel.WorkspaceClearing
Occurs before current workspace is cleared

Dynamo.Models.DynamoModel.OnWorkspaceClearing
Triggers WorkspaceClearing event

Dynamo.Models.DynamoModel.WorkspaceClearingStarted
Occurs before current workspace is cleared

Dynamo.Models.DynamoModel.OnWorkspaceClearingStarted(Dynamo.Graph.Workspaces.WorkspaceModel)
Triggers WorkspaceClearing event
workspace: Workspace about to be cleared

Dynamo.Models.DynamoModel.WorkspaceCleared
Occurs after current workspace is cleared

Dynamo.Models.DynamoModel.OnWorkspaceCleared(Dynamo.Graph.Workspaces.WorkspaceModel)
Triggers WorkspaceCleared event
workspace: Cleared workspace

Dynamo.Models.DynamoModel.WorkspaceAdded
Called when a workspace is added.

Dynamo.Models.DynamoModel.WorkspaceRemoveStarted
Occurs before a workspace is removed

Dynamo.Models.DynamoModel.WorkspaceRemoved
Occurs after a workspace is removed

Dynamo.Models.DynamoModel.DeletionStarted
Occurs before items of workspace are removed

Dynamo.Models.DynamoModel.OnDeletionStarted(System.Collections.Generic.List{Dynamo.Graph.ModelBase},System.ComponentModel.CancelEventArgs)
Called when Deletion started.

Dynamo.Models.DynamoModel.DeletionComplete
Occurs after items of workspace are removed

Dynamo.Models.DynamoModel.OnDeletionComplete(System.Object,System.EventArgs)
Triggers DeletionComplete event
sender: The object which caused the event
e: The event data

Dynamo.Models.DynamoModel.CleaningUp
An event triggered when the workspace is being cleaned.

Dynamo.Models.DynamoModel.OnCleanup
Triggers CleaningUp event

Dynamo.Models.DynamoModel.RequestCancelActiveStateForNode
Called when current state of a node is canelled.

Dynamo.Models.DynamoModel.WorkspaceHidden
Event called when a workspace is hidden

Dynamo.Models.DynamoModel.RequestNodeSelect
An event which requests that a node be selected

Dynamo.Models.DynamoModel.RunCompleted
Occurs when running is completed

Dynamo.Models.DynamoModel.OnRunCompleted(System.Object,System.Boolean)
Triggers RunCompleted event
sender: The object which caused the event
success: Indicates if run completed successfully

Dynamo.Models.DynamoModel.EvaluationCompleted
An event triggered when a single graph evaluation completes.

Dynamo.Models.DynamoModel.OnEvaluationCompleted(System.Object,Dynamo.Models.EvaluationCompletedEventArgs)
Triggers EvaluationCompleted event
sender: The object which caused the event
e: The event data

Dynamo.Models.DynamoModel.RefreshCompleted
An event triggered when all tasks in scheduler are completed.

Dynamo.Models.DynamoModel.OnRefreshCompleted(System.Object,System.EventArgs)
Triggers RefreshCompleted event
sender: The object which caused the event
e: The event data

Dynamo.Models.DynamoModel.ComputeModelDeserialized
This Event is raised after the compute section of the workspace is deserialized

Dynamo.Models.DynamoModel.OnComputeModelDeserialized
Triggers ComputeModelSerialized event

Dynamo.Models.DynamoModel.WorkspaceSaved
Occurs when a workspace is saved to a file.

Dynamo.Models.DynamoModel.WorkspaceSaving
Occurs when a workspace is about to be saved to a file.

Dynamo.Models.DynamoModel.RequestWorkspaceBackUpSave
Occurs when a workspace is scheduled to be saved to a backup file.

Dynamo.Models.DynamoModel.WorkspaceOpening
Event that is fired during the opening of the workspace.
Use the XmlDocument object provided to conduct additional
workspace opening operations.

Dynamo.Models.DynamoModel.WorkspaceOpened
Occurs when a workspaces is opened

Dynamo.Models.DynamoModel.ShutdownStarted
This event is raised right before the shutdown of DynamoModel started.
When this event is raised, the shutdown is guaranteed to take place
(i.e. user has had a chance to save the work and decided to proceed
with shutting down Dynamo). Handlers of this event can still safely
access the DynamoModel, the WorkspaceModel (along with its contents),
and the DynamoScheduler.

Dynamo.Models.DynamoModel.ShutdownCompleted
This event is raised after DynamoModel has been shut down. At this
point the DynamoModel is no longer valid and access to it should be
avoided.

Dynamo.Models.DynamoModel.DynamoReady
This event is raised when Dynamo is ready for user interaction.

Dynamo.Models.DynamoModel.RequestPythonReset
Event that is raised when Dynamo model requests a particular python engine
to reset. String parameter is engine name.

Dynamo.Models.DynamoModel.IsTestMode
Testing flag is used to defer calls to run in the idle thread
with the assumption that the entire test will be wrapped in an
idle thread call.

Dynamo.Models.DynamoModel.IsHeadless
Flag to indicate that there is no UI on this process, and things
like the update manager and the analytics collection should be
disabled.

Dynamo.Models.DynamoModel.IsCrashing
Specifies whether or not Dynamo is in a crash-state.

Dynamo.Models.DynamoModel.EnableMigrationLogging
Setting this flag enables creation of an XML in following format that records
node mapping information - which old node has been converted to which to new node(s)

Dynamo.Models.DynamoModel.EngineController
DesignScript VM EngineController, used for this instance of Dynamo.

Dynamo.Models.DynamoModel.LibraryServices
Manages all loaded ZeroTouch libraries.

Dynamo.Models.DynamoModel.ShutdownRequested
Flag specifying whether a shutdown of Dynamo was requested.

Dynamo.Models.DynamoModel.Version
This version of Dynamo.

Dynamo.Models.DynamoModel.HostVersion
Current Version of the Host (i.e. DynamoRevit/DynamoStudio)

Dynamo.Models.DynamoModel.HostName
Name of the Host (i.e. DynamoRevit/DynamoStudio)

Dynamo.Models.DynamoModel.HostAnalyticsInfo
Host analytics info

Dynamo.Models.DynamoModel.UpdateManager
UpdateManager to handle automatic upgrade to higher version.

Dynamo.Models.DynamoModel.PathManager
The path manager that configures path information required for
Dynamo to function properly. See IPathManager interface for more
details.

Dynamo.Models.DynamoModel.Context
The context that Dynamo is running under.

Dynamo.Models.DynamoModel.ExtensionManager
Manages all extensions for Dynamo

Dynamo.Models.DynamoModel.LinterManager
Manages the active linter

Dynamo.Models.DynamoModel.Loader
Manages all loaded NodeModel libraries.

Dynamo.Models.DynamoModel.CustomNodeManager
Custom Node Manager instance, manages all loaded custom nodes.

Dynamo.Models.DynamoModel.Logger
The Dynamo Logger, receives and manages all log messages.

Dynamo.Models.DynamoModel.Scheduler
The Dynamo Scheduler, handles scheduling of asynchronous tasks on different
threads.

Dynamo.Models.DynamoModel.SearchModel
The Dynamo Node Library, complete with Search.

Dynamo.Models.DynamoModel.AppVersion
The application version string for analytics reporting APIs

Dynamo.Models.DynamoModel.DebugSettings
Debugging settings for this instance of Dynamo.

Dynamo.Models.DynamoModel.PreferenceSettings
Preference settings for this instance of Dynamo.

Dynamo.Models.DynamoModel.NodeFactory
Node Factory, used for creating and intantiating loaded Dynamo nodes.

Dynamo.Models.DynamoModel.MigrationManager
Migration Manager, upgrades old Dynamo file formats to the current version.

Dynamo.Models.DynamoModel.CurrentWorkspace
The active workspace in Dynamo.

Dynamo.Models.DynamoModel.ClipBoard
The copy/paste clipboard.

Dynamo.Models.DynamoModel.IsShowingConnectors
Specifies whether connectors are displayed in Dynamo.

Dynamo.Models.DynamoModel.IsShowingConnectorTooltip
Flag specifying the current state of whether or not to show
tooltips in the graph. In addition to this toggle, tooltip is only
available when connectors are set to 'bezier' mode.

Dynamo.Models.DynamoModel.ConnectorType
Specifies how connectors are displayed in Dynamo.

Dynamo.Models.DynamoModel._workspaces
The private collection of visible workspaces in Dynamo

Dynamo.Models.DynamoModel.Workspaces
Returns collection of visible workspaces in Dynamo

Dynamo.Models.DynamoModel.TraceReconciliationProcessor
An object which implements the ITraceReconciliationProcessor interface,
and is used for handlling the results of a trace reconciliation.

Dynamo.Models.DynamoModel.AuthenticationManager
Returns authentication manager object for oxygen authentication.

Dynamo.Models.DynamoModel.ShutDown(System.Boolean)
External components call this method to shutdown DynamoModel. This
method marks 'ShutdownRequested' property to 'true'. This method is
used rather than a public virtual method to ensure that the value of
ShutdownRequested is set to true.
shutdownHost: Set this parameter to true to shutdown
the host application.

Dynamo.Models.DynamoModel.State
The modelState tels us if the RevitDynamoModel was started and if has the
the Dynamo UI attached to it or not

Dynamo.Models.DynamoModel.Start
Start DynamoModel with all default configuration options
Returns: The instance of Dynamo.Models.DynamoModel

Dynamo.Models.DynamoModel.Start(Dynamo.Models.DynamoModel.IStartConfiguration)
Start DynamoModel with custom configuration.  Defaults will be assigned not provided.
configuration: Start configuration
Returns: The instance of Dynamo.Models.DynamoModel

Dynamo.Models.DynamoModel.#ctor(Dynamo.Models.DynamoModel.IStartConfiguration)
Default constructor for DynamoModel
config: Start configuration

Dynamo.Models.DynamoModel.AddPackagePath(System.String,System.String)
Adds a new path to the list of custom package folders, but only if the path
does not already exist in the list.
path:  The path to add.
file:  The file to add when importing a library.

Dynamo.Models.DynamoModel.PostTraceReconciliation(System.Collections.Generic.Dictionary{System.Guid,System.Collections.Generic.List{System.Runtime.Serialization.ISerializable}})
Deals with orphaned serializables.
orphanedSerializables: Collection of orphaned serializables.

Dynamo.Models.DynamoModel.LibraryLoaded(System.Object,Dynamo.Engine.LibraryServices.LibraryLoadedEventArgs)
LibraryLoaded event handler.
sender:
e:

Dynamo.Models.DynamoModel.OnAsyncTaskStateChanged(Dynamo.Scheduler.DynamoScheduler,Dynamo.Scheduler.TaskStateChangedEventArgs)
This event handler is invoked when DynamoScheduler changes the state
of an AsyncTask object. See TaskStateChangedEventArgs.State for more
details of these state changes.
sender: The scheduler which raised the event.
e: Task state changed event argument.

Dynamo.Models.DynamoModel.Dispose
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
2

Dynamo.Models.DynamoModel.LoadNodeLibrary(System.Reflection.Assembly,System.Boolean)
Imports a node library (zero touch or nodeModel) into the VM.
Does not necessarily add those imported functions to search.
assem: The assembly to load which contains the types to import.
suppressZeroTouchLibraryLoad: If True, zero touch types will not be added to search.
This is used by packageManager extension to defer adding ZT libraries to search until all libraries are loaded.

Dynamo.Models.DynamoModel.PreferenceSettings_PropertyChanged(System.Object,System.ComponentModel.PropertyChangedEventArgs)
Responds to property update notifications on the preferences,
and synchronizes with the Units Manager.
sender:
e:

Dynamo.Models.DynamoModel.LogWarningMessage(DynamoServices.LogWarningMessageEventArgs)
This warning message is displayed on the node associated with the FFI dll
args:

Dynamo.Models.DynamoModel.UpdateCustomNodeDefinition(Dynamo.CustomNodeDefinition)
Register custom node defintion and execute all custom node
instances.
definition:

Dynamo.Models.DynamoModel.RegisterCustomNodeDefinitionWithEngine(Dynamo.CustomNodeDefinition)
Registers (or re-registers) a Custom Node definition with the DesignScript VM,
so that instances of the custom node can be evaluated.
definition:

Dynamo.Models.DynamoModel.MarkAllDependenciesAsModified(Dynamo.CustomNodeDefinition)
Returns all function instances directly or indirectly depends on the
specified function definition and mark them as modified so that
their values will be re-queried.
def:
Returns:

Dynamo.Models.DynamoModel.ResetEngine(System.Boolean)
Call this method to reset the virtual machine, avoiding a race
condition by using a thread join inside the vm executive.
markNodesAsDirty: Set this parameter to true to force
reset of the execution substrate. Note that setting this parameter
to true will have a negative performance impact.

Dynamo.Models.DynamoModel.ForceRun
Forces an evaluation of the current workspace by resetting the DesignScript VM.

Dynamo.Models.DynamoModel.OpenFileFromPath(System.String,System.Boolean)
Opens a Dynamo workspace from a path to a file on disk.
filePath: Path to file
forceManualExecutionMode: Set this to true to discard
execution mode specified in the file and set manual mode

Dynamo.Models.DynamoModel.OpenJsonFileFromPath(System.String,System.String,System.Boolean)
Opens a Dynamo workspace from a path to an JSON file on disk.
fileContents: Json file contents
filePath: Path to file
forceManualExecutionMode: Set this to true to discard
execution mode specified in the file and set manual mode
Returns: True if workspace was opened successfully

Dynamo.Models.DynamoModel.OpenXmlFileFromPath(System.Xml.XmlDocument,System.String,System.Boolean)
Opens a Dynamo workspace from a path to an Xml file on disk.
filePath: Path to file
forceManualExecutionMode: Set this to true to discard
execution mode specified in the file and set manual mode
Returns: True if workspace was opened successfully

Dynamo.Models.DynamoModel.SaveBackupFiles(System.Object)
Backup all the files

Dynamo.Models.DynamoModel.StartBackupFilesTimer
Start the timer to backup files periodically

Dynamo.Models.DynamoModel.AddHomeWorkspace
Add a new HomeWorkspace and set as current
1

Dynamo.Models.DynamoModel.AddCustomNodeWorkspace(Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel)
Add a new, visible Custom Node workspace to Dynamo
workspace: Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel to add

Dynamo.Models.DynamoModel.RemoveWorkspace(Dynamo.Graph.Workspaces.WorkspaceModel)
Remove a workspace from the dynamo model.
workspace: Workspace to remove

Dynamo.Models.DynamoModel.OpenCustomNodeWorkspace(System.Guid)
Opens an existing custom node workspace.
guid: Identifier of the workspace to open
Returns: True if workspace was found and open

Dynamo.Models.DynamoModel.AddNodeToCurrentWorkspace(Dynamo.Graph.Nodes.NodeModel,System.Boolean,System.Boolean)
Adds a node to the current workspace.
node: Node to add
centered: Indicates if the node should be placed
at the center of workspace.
addToSelection: Indicates if the newly added node
should be selected

Dynamo.Models.DynamoModel.Copy
Copy selected ISelectable objects to the clipboard.

Dynamo.Models.DynamoModel.Paste
Paste ISelectable objects from the clipboard to the workspace
so that the nodes appear in their original location with a slight offset

Dynamo.Models.DynamoModel.Paste(Dynamo.Utilities.Point2D,System.Boolean)
Paste ISelectable objects from the clipboard to the workspace at specified point.
targetPoint: Location where data will be pasted
useOffset: Indicates whether we will use current workspace offset or paste nodes
directly in this point.

Dynamo.Models.DynamoModel.AddToSelection(System.Object)
Add an ISelectable object to the selection.
parameters: The object to add to the selection.

Dynamo.Models.DynamoModel.ClearCurrentWorkspace
Clear the workspace. Removes all nodes, notes, and connectors from the current workspace.

Dynamo.Models.DynamoModel.HideUnhideNamespace(System.Boolean,System.String,System.String)
This method updates the node search library to either hide or unhide nodes that belong
to a specified assembly name and namespace. These nodes will be hidden from the node
library sidebar and from the node search.
hide: Set to true to hide, set to false to unhide.
library: The assembly name of the library.
namespc: The namespace of the nodes to be hidden.

Dynamo.Models.DynamoModel.AddWorkspace(Dynamo.Graph.Workspaces.WorkspaceModel)
Adds a workspace to the dynamo model.
workspace:

Dynamo.Models.DynamoModel.DisplayObsoleteFileMessage(System.String,System.Version,System.Version)
Call this method to display a message box when a file of an older
version cannot be opened by the current version of Dynamo.
fullFilePath:
fileVersion: Version of the input file.
currVersion: Current version of the Dynamo.

Dynamo.Models.DynamoModel.DisplayEngineFailureMessage(System.Exception)
Call this method to display an error message in an event when live
runner throws an exception that is not handled anywhere else. This
message instructs user to save their work and restart Dynamo.
exception: The exception to display.

Dynamo.Models.DynamoModel.DisplayFutureFileMessage(System.String,System.Version,System.Version)
Displays file open error dialog if the file is of a future version than the currently installed version
fullFilePath:
fileVersion:
currVersion:
Returns:  true if the file must be opened and false otherwise