Dynamo.Extensions.IServiceManager
Defines a mechanism for registering and retrieving a service object;
that is, an object that provides custom support to other objects.

Dynamo.Extensions.IServiceManager.RegisterService``1(``0)
Allows extension applications to register some specific service by its type.
Only one service of a given type can be registered.
Type of the service
service: The service object to register
Returns: A key for the registered service if registeration is
successful else null.

Dynamo.Extensions.IServiceManager.UnregisterService``1(System.String)
Unregisters a service of given type registered with given key.
Type of the service
serviceKey: The service key to ensure that only authorized
client is unregistering this service type.
Returns:

Dynamo.Extensions.IServiceManager.Service``1
Gets the service object of the specified type.
Type of the service
Returns: The service object if registered else null