Dynamo.Extensions.ReadyParams
Application-level handles provided to an extension when
Dynamo has started and is ready for interaction

Dynamo.Extensions.ReadyParams.#ctor(Dynamo.Models.DynamoModel)
Initializes a new instance of the Dynamo.Extensions.ReadyParams class.
dynamoM: Dynamo model.

Dynamo.Extensions.ReadyParams.StartupParams
A reference to the Dynamo.Extensions.ReadyParams.StartupParams class.
Useful if this extension will be loaded from a package as its startup method, will not be called.

Dynamo.Extensions.ReadyParams.WorkspaceModels
Returns list of workspaces

Dynamo.Extensions.ReadyParams.CurrentWorkspaceModel
Returns current workspace

Dynamo.Extensions.ReadyParams.CommandExecutive
Extension specific implementation to execute Recordable commands on DynamoModel

Dynamo.Extensions.ReadyParams.NotificationRecieved
Event that is raised when the Dynamo Logger logs a notification.
This event passes the notificationMessage to any subscribers

Dynamo.Extensions.ReadyParams.CurrentWorkspaceChanged
Occurs when current workspace is changed

Dynamo.Extensions.ReadyParams.CurrentWorkspaceCleared
Occurs when current workspace is cleared

Dynamo.Extensions.ReadyParams.CurrentWorkspaceClearingStarted
Occurs when current workspace is clearing

Dynamo.Extensions.ReadyParams.CurrentWorkspaceOpened
Occurs when current workspace has finished opening

Dynamo.Extensions.ReadyParams.CurrentWorkspaceRemoveStarted
Occurs when a worspace is about to be removed

Dynamo.Extensions.ReadyParams.Dispose
This method clears event handlers from the DynamoModel that the extension framework setup
when the model was first loaded.