Dynamo.Search.SearchElements.NodeModelSearchElement
Search element for basic NodeModels.

Dynamo.Search.SearchElements.NodeModelSearchElement.#ctor(Dynamo.Graph.Nodes.TypeLoadData)
Initializes a new instance of the Dynamo.Search.SearchElements.NodeModelSearchElement class.
typeLoadData: Data to load.