Dynamo.Models.DynamoModel.SelectInRegionCommand
A command to select model objects within a region.

Dynamo.Models.DynamoModel.SelectInRegionCommand.#ctor(Dynamo.Utilities.Rect2D,System.Boolean)
region:
isCrossSelection: