Dynamo.Wpf.Interfaces.LayoutElement
Represents a group/category

Dynamo.Wpf.Interfaces.LayoutElement.text
Name of the element

Dynamo.Wpf.Interfaces.LayoutElement.iconUrl
Relative or absolute URL of the icon for the corresponding library item

Dynamo.Wpf.Interfaces.LayoutElement.elementType
The type of the element.

Dynamo.Wpf.Interfaces.LayoutElement.include
List of data types that should be included under this given library element

Dynamo.Wpf.Interfaces.LayoutElement.childElements
List of nested elements under this element

Dynamo.Wpf.Interfaces.LayoutElement.#ctor(System.String)
Default constructor
text: Text value of the element

Dynamo.Wpf.Interfaces.LayoutElement.EnumerateIncludes
Returns a flat list of all the include info, including those owned by
its child elements recursively.
Returns:

Dynamo.Wpf.Interfaces.LayoutElement.EnumerateChildren
Returns a flat list of all the children, including the children owned
by its child elements recursively
Returns: