Dynamo.Engine.CodeGeneration.CompilingEventArgs
This event is triggerred when compiling a NodeModel to AST nodes.

Dynamo.Engine.CodeGeneration.CompilingEventArgs.#ctor(System.Guid)
Construct ASTBuildingEventArgs with NodeModel.

Dynamo.Engine.CodeGeneration.CompilingEventArgs.Node
Guid of NodeModel that is being compiled to AST.

Dynamo.Engine.CodeGeneration.CompilingEventArgs.NodeId
Guid of NodeModel that is being compiled to AST.