Dynamo.Updates.UpdateDownloadedEventHandler
Represents the method that will handle Dynamo.Updates.UpdateManager.UpdateDownloaded events.
sender: The object where the event handler is attached.
e: The event data.