Dynamo.Engine.IFunctionDescriptor
Describes a function, whether imported or defined in a custom node.

Dynamo.Engine.IFunctionDescriptor.DisplayName
Name to be displayed for the function.

Dynamo.Engine.IFunctionDescriptor.MangledName
An unique name to identify a function. It is used to create
a corresponding node instance

Dynamo.Engine.IFunctionDescriptor.ReturnKeys
Return keys for multi-output functions.

Dynamo.Engine.IFunctionDescriptor.Parameters
Function parameters

Dynamo.Engine.IFunctionDescriptor.FunctionName
Function name.

Dynamo.Engine.IFunctionDescriptor.ReturnType
Return Type