Dynamo.Search.SearchElements.NodeSearchElement
Base class for all Dynamo Node search elements.

Dynamo.Search.SearchElements.NodeSearchElement.VisibilityChanged
Event is fired when a node visibility in library search was changed.

Dynamo.Search.SearchElements.NodeSearchElement.IsVisibleInSearch
Specifies whether or not this entry should appear in search.

Dynamo.Search.SearchElements.NodeSearchElement.CreationName
The name that is used during node creation

Dynamo.Search.SearchElements.NodeSearchElement.Categories
List of nested categories this search element is contained in.

Dynamo.Search.SearchElements.NodeSearchElement.SplitCategoryName(System.String)
Split a category name into individual category names splitting be DEFAULT_DELIMITER
categoryName: The name
Returns: A list of output

Dynamo.Search.SearchElements.NodeSearchElement.FullName
The full name of entry which consists of category name and entry name.

Dynamo.Search.SearchElements.NodeSearchElement.FullCategoryName
The category name of this node.

Dynamo.Search.SearchElements.NodeSearchElement.Dynamo#Search#ISearchEntry#Name
The name of this entry in search.

Dynamo.Search.SearchElements.NodeSearchElement.Name
The name of this entry as it appears in the library.

Dynamo.Search.SearchElements.NodeSearchElement.Parameters
The parameters of this entry, used for overloaded nodes.

Dynamo.Search.SearchElements.NodeSearchElement.Weight
The search weight of this entry.

Dynamo.Search.SearchElements.NodeSearchElement.SearchKeywords
Collection of keywords which can be used to search for this element.

Dynamo.Search.SearchElements.NodeSearchElement.Description
Description of the node.

Dynamo.Search.SearchElements.NodeSearchElement.IconName
Returns the name of the node icon.

Dynamo.Search.SearchElements.NodeSearchElement.Group
Group to which Node belongs to

Dynamo.Search.SearchElements.NodeSearchElement.Assembly
Assembly to which Node belongs to

Dynamo.Search.SearchElements.NodeSearchElement.ElementType
Indicates whether it is custom node or zero-touch element.
And whether this element comes from package or not.

Dynamo.Search.SearchElements.NodeSearchElement.ItemProduced
Event fired when this search element produces a new NodeModel. This typically
happens when it is selected in the library by the user.

Dynamo.Search.SearchElements.NodeSearchElement.ConstructNewNodeModel
Creates a new NodeModel to be inserted into the current Dynamo workspace.
Returns:

Dynamo.Search.SearchElements.NodeSearchElement.ProduceNode
Produces a new Node, via the ItemProduced event.