Dynamo.Configuration.ViewExtensionSettings
Settings that apply to a view extension specifically.

Dynamo.Configuration.ViewExtensionSettings.Name
Name of the view extension.

Dynamo.Configuration.ViewExtensionSettings.UniqueId
UniqueId of the view extension.

Dynamo.Configuration.ViewExtensionSettings.DisplayMode
Specifies how an extension UI control should be displayed.

Dynamo.Configuration.ViewExtensionSettings.WindowSettings
Window settings for the extension control when displayed in FloatingWindow mode.