Dynamo.Engine.LiveRunnerServices
This is a helper class that can get mirror data from live runner, update graph etc.

Dynamo.Engine.LiveRunnerServices.#ctor(Dynamo.Engine.EngineController,System.String)
Creates LiveRunnerServices.
controller: Engine controller
geometryFactoryFileName: Path to LibG

Dynamo.Engine.LiveRunnerServices.Dispose
Dispose LiveRunner object.

Dynamo.Engine.LiveRunnerServices.RuntimeCore
RuntimeCore of liveRunner.
RuntimeCore is an object that is instantiated once across the lifecycle of the runtime.
This is the entry point of the runtime VM and its input is a DS Executable format.

Dynamo.Engine.LiveRunnerServices.GetMirror(System.String,System.Boolean)
TPDP
var: AST node id
verboseLogging: if set to true this enables verbose logging
Returns: RuntimeMirror

Dynamo.Engine.LiveRunnerServices.UpdateGraph(ProtoScript.Runners.GraphSyncData,System.Boolean)
Update graph with graph sync data.
graphData:
verboseLogging:

Dynamo.Engine.LiveRunnerServices.PreviewGraph(ProtoScript.Runners.GraphSyncData,System.Boolean)
Preview graph with graph sync data.
graphData:
verboseLogging:

Dynamo.Engine.LiveRunnerServices.GetRuntimeWarnings
Returns runtime warnings for this run.
Returns:

Dynamo.Engine.LiveRunnerServices.GetBuildWarnings
Returns build warnings for this run.
Returns:

Dynamo.Engine.LiveRunnerServices.GetExecutedAstGuids(System.Guid)
Returns GUIDs of exectued ASTs in this run.
sessionID:
Returns:

Dynamo.Engine.LiveRunnerServices.RemoveRecordedAstGuidsForSession(System.Guid)
Remove recorded GUIDs of executed ASTs for the specified session.
sessionID:

Dynamo.Engine.LiveRunnerServices.ReloadAllLibraries(System.Collections.Generic.IEnumerable{System.String})
Each time when a new library is imported, LiveRunner need to reload
all libraries and reset VM.
libraries: