Dynamo.Annotations.NotifyPropertyChangedInvocatorAttribute
Indicates that the method is contained in a type that implements
System.ComponentModel.INotifyPropertyChanged interface
and this method is used to notify that some property value changed.
Remarks:
The method should be non-static and conform to one of the supported signatures:
NotifyChanged(string)
NotifyChanged(params string[])
NotifyChanged{T}(Expression{Func{T}})
NotifyChanged{T,U}(Expression{Func{T,U}})
SetProperty{T}(ref T, T, string)
public class Foo : INotifyPropertyChanged {
public event PropertyChangedEventHandler PropertyChanged;
[NotifyPropertyChangedInvocator]
protected virtual void NotifyChanged(string propertyName) { ... }
private string _name;
public string Name {
get { return _name; }
set { _name = value; NotifyChanged("LastName"); /* Warning */ }
}
}
Examples of generated notifications:
NotifyChanged("Property")
NotifyChanged(() => Property)
NotifyChanged((VM x) => x.Property)
SetProperty(ref myField, value, "Property")