Dynamo.Engine.LibraryCustomizationServices
LibraryCustomizationServices class that implements ILibraryCustomizationServices interface

Dynamo.Engine.LibraryCustomizationServices.#ctor(Dynamo.Interfaces.IPathManager)
Creates an instance of LibraryCustomizationServices given an IPathManager.
assemblyPathManager: Path manager through which assembly paths
are to be resolved.

Dynamo.Engine.LibraryCustomizationServices.GetLibraryCustomization(System.String)
Call this method to obtain the corresponding LibraryCustomization object
for a given assembly path.
assemblyPath: Path of assembly for which LibraryCustomization
object is to be obtained.
Returns: Returns the corresponding LibraryCustomization object if one is
found, or null otherwise.

Dynamo.Engine.LibraryCustomizationServices.GetForAssembly(System.String,Dynamo.Interfaces.IPathManager,System.Boolean)
Call this method to obtain the corresponding LibraryCustomization object
for a given assembly path.
assemblyPath: Path of assembly for which LibraryCustomization
object is to be obtained.
pathManager: Path manager through which assembly paths are
to be resolved.
useAdditionalPaths: Set this parameter to true if additional
paths are to be considered when an assembly path is being resolved.
Returns: Returns the corresponding LibraryCustomization object if one is
found, or null otherwise.