Dynamo.Models.DynamoModel.UngroupModelCommand
A command to ungroup model objects.

Dynamo.Models.DynamoModel.UngroupModelCommand.#ctor(System.String)
modelGuid:

Dynamo.Models.DynamoModel.UngroupModelCommand.#ctor(System.Guid)
modelGuid:

Dynamo.Models.DynamoModel.UngroupModelCommand.#ctor(System.Collections.Generic.IEnumerable{System.Guid})
modelGuid: