Dynamo.Core.DynamoMigratorBase
Base class for all versions of Dynamo classes relating to
migrating preferences from older versions
For version specific migration, derived classes
should override base class methods

Dynamo.Core.DynamoMigratorBase.ReadPreferences
Reads preference settings from input file and deserializes it into
PreferenceSettings object
This function can be overridden by version specific migrator classes
Returns:  returns the deserialized preference settings

Dynamo.Core.DynamoMigratorBase.MigrateFrom(Dynamo.Core.DynamoMigratorBase)
Migrates preference settings, customized migration step in derived class.
from source migrator version to current version.
This function can be overridden by version specific migrator classes
sourceMigrator:  source migrator version from which to migrate from
Returns: new migrator instance after migration

Dynamo.Core.DynamoMigratorBase.MigrateBetweenDynamoVersions(Dynamo.Interfaces.IPathManager,Dynamo.Updates.IDynamoLookUp)
Migrates preference settings and copies packages and custom node
definitions from the last but one version to the currently installed Dynamo version
pathManager:
dynamoLookup:
Returns: new migrator instance after migration

Dynamo.Core.DynamoMigratorBase.GetLatestVersionToMigrate(Dynamo.Interfaces.IPathManager,Dynamo.Updates.IDynamoLookUp,Dynamo.Core.FileVersion)
Returns the most recent version to migrate to the given current version.
pathManager:
dynamoLookup:
currentVersion:
Returns: FileVersion?

Dynamo.Core.DynamoMigratorBase.GetInstalledVersions(System.String)
Returns a list of file version objects given a root folder. Assuming the
following folders exist:
e:\some\path\0.4
e:\some\path\0.75
e:\some\path\1.82
Calling this method with "e:\\some\\path" would return an ordered
list in the following way (from largest number to smallest number):
{ FileVersion(1, 82), FileVersion(0, 75), FileVersion(0, 4) }
rootFolder: The root folder under which versioned sub-
folders are expected to be found. This argument must represent a valid
local directory.
Returns: Return a list of FileVersion objects, ordered by newest
version to the oldest version. If no versioned sub-folder exists, then
the returned list is empty.
Throws System.ArgumentNullException: This exception is
thrown if rootFolder is null or an empty string.
Throws System.IO.DirectoryNotFoundException: This exception
is thrown if rootFolder points to an invalid directory.

Dynamo.Core.DynamoMigratorBase.GetInstalledVersions(Dynamo.Interfaces.IPathManager,Dynamo.Updates.IDynamoLookUp)
Returns list of FileVersion objects, given the IPathManager and
IDynamoLookUp objects. If a valid IDynamoLookUp interface object
is passed, this method uses the lookup to get Dynamo user data locations.
pathManager:
dynamoLookup:
Returns:

Dynamo.Core.DynamoMigratorBase.GetInstalledVersionsCore(System.Func{System.Collections.Generic.IEnumerable{System.String}})
userDataFolders:
Returns:

Dynamo.Core.DynamoMigratorBase.GetInstallVersionFromUserDataFolder(System.String)
Returns FileVersion object of the Dynamo installation from the given
user data folder path. Returns default(FileVersion) if file version
can't be determined from the given folder path.
folder: User data folder path
Returns: A valid or default FileVersion object

Dynamo.Core.DynamoMigratorBase.Migrate(Dynamo.Core.FileVersion,Dynamo.Core.FileVersion)
Given a root user data directory, this migrates user preferences,
packages and custom node definition files from one installed version
into another
fromVersion:  source Dynamo version from which to migrate
toVersion:  target Dynamo version into which to migrate
Returns:  new migrator instance after migration, null if there's no migration

Dynamo.Core.DynamoMigratorBase.CreateMigrator(Dynamo.Core.FileVersion)
Given a FileVersion, this creates an instance of the migrator
depending on the input version using reflection. Returns the default
migrator (DynamoMigratorBase) if version specific migrator does not exist
version:  input version for which migrator instance is created
Returns:  instance of migrator specific to input version.