Dynamo.Updates.IAsynchronousRequest
An interface to describe an asynchronous web
request for updating data.

Dynamo.Updates.IAsynchronousRequest.Data
The data returned from the request.

Dynamo.Updates.IAsynchronousRequest.Error
Any error information returned from the request.

Dynamo.Updates.IAsynchronousRequest.Path
Represents the send request link.

Dynamo.Updates.IAsynchronousRequest.OnRequestCompleted
An action to be invoked upon completion of the request.
This action is invoked regardless of the success of the request.