Dynamo.Graph.Workspaces.PresetExtensions
Extension methods for adding and removing Presets to Workspaces.

Dynamo.Graph.Workspaces.PresetExtensions.AddPresetCore(Dynamo.Graph.Workspaces.WorkspaceModel,System.String,System.String,System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
this method creates a new preset state from a set of NodeModels and adds this new state to this presets collection
workspace:
name: the name of preset state
description: a description of what the state does
currentSelection: a set of NodeModels that are to be serialized in this state

Dynamo.Graph.Workspaces.PresetExtensions.RemovePreset(Dynamo.Graph.Workspaces.WorkspaceModel,Dynamo.Graph.Presets.PresetModel)
Removes a specified Dynamo.Graph.Presets.PresetModel object from the preset collection of the workspace.
workspace:
state: Dynamo.Graph.Presets.PresetModel object to remove.

Dynamo.Graph.Workspaces.PresetExtensions.ImportPresets(Dynamo.Graph.Workspaces.WorkspaceModel,System.Collections.Generic.IEnumerable{Dynamo.Graph.Presets.PresetModel})
Adds a specified collection Dynamo.Graph.Presets.PresetModel objects to the preset collection of the workspace.
workspace:
presetCollection: Dynamo.Graph.Presets.PresetModel objects to add.