Dynamo.Core.AuthenticationManager
This is a wrapper for Greg.IAuthProvider functionality.
It is used for oxygen authentication.

Dynamo.Core.AuthenticationManager.LoginStateChanged
Occurs when login state is changed

Dynamo.Core.AuthenticationManager.HasAuthProvider
Determines if the this.client has login capabilities

Dynamo.Core.AuthenticationManager.LoginState
Specifies whether the user is logged in or not.

Dynamo.Core.AuthenticationManager.Username
The username of the current user, if logged in.  Otherwise null

Dynamo.Core.AuthenticationManager.AuthProvider
Current IAuthProvider

Dynamo.Core.AuthenticationManager.#ctor(Greg.IAuthProvider)
Initializes a new instance of the Dynamo.Core.AuthenticationManager class.
authProvider: IAuthProvider functionality

Dynamo.Core.AuthenticationManager.ToggleLoginState(System.Object)
Toggle current login state

Dynamo.Core.AuthenticationManager.CanToggleLoginState(System.Object)
Check if able to toggle login state