Dynamo.Scheduler.TaskStateChangedEventArgs
Provides data for DynamoScheduler.TaskStateChanged events.

Dynamo.Scheduler.TaskStateChangedEventArgs.Task
Returns AsyncTask object to execute

Dynamo.Scheduler.TaskStateChangedEventArgs.CurrentState
Returns Actual state of task

Dynamo.Scheduler.TaskStateChangedEventArgs.#ctor(Dynamo.Scheduler.AsyncTask,Dynamo.Scheduler.TaskStateChangedEventArgs.State)
Initializes a new instance of the Dynamo.Scheduler.TaskStateChangedEventArgs class
with the task and its current state
task: Dynamo.Scheduler.AsyncTask object
state: Current state of the Dynamo.Scheduler.AsyncTask object