Dynamo.Engine.CodeGeneration.IAstNodeContainer
Returns notification for AST compilation events.

Dynamo.Engine.CodeGeneration.IAstNodeContainer.OnCompiling(System.Guid)
Indicates to start compiling a NodeModel to AST nodes.
nodeGuid:

Dynamo.Engine.CodeGeneration.IAstNodeContainer.OnCompiled(System.Guid,System.Collections.Generic.IEnumerable{ProtoCore.AST.AssociativeAST.AssociativeNode})
Indicates a NodeModel has been compiled to AST nodes.
nodeGuid:
astNodes: