Dynamo.Linting.Rules.NodeRuleEvaluationResult
Rule evaluation result for node linter rules

Dynamo.Linting.Rules.NodeRuleEvaluationResult.RuleId
Id of the rule this evaluation result belongs to

Dynamo.Linting.Rules.NodeRuleEvaluationResult.Status
Evaluation status

Dynamo.Linting.Rules.NodeRuleEvaluationResult.NodeId
Unique id of the node that has been evaluated