Dynamo.Visualization.GeometryData.Id
Guid of the specified node

Dynamo.Visualization.GeometryData.GeometryEntries
List of the graphic primitives that result object consist of.
It is empty for nongraphic objects