Dynamo.Extensions.IExtensionStorageAccess.UniqueId
A unique id for this extension instance.
The id will be equivalent to the extension that implements this interface id.

Dynamo.Extensions.IExtensionStorageAccess.Name
A name for the Extension.
The name will be equivalent to the extension that implements this interface name.

Dynamo.Extensions.IExtensionStorageAccess.OnWorkspaceOpen(System.Collections.Generic.Dictionary{System.String,System.String})
Action to be invoked when the workspace is opened. The passed extensionData dictionary is a copy of the Dynamo.Extensions.ExtensionData data dictionary.
Modifying the extensionData from this action will not modify the stored Dynamo.Extensions.ExtensionData.
To modify the stored Dynamo.Extensions.ExtensionData data dictionary use the Dynamo.Extensions.IExtensionStorageAccess.OnWorkspaceSaving(System.Collections.Generic.Dictionary{System.String,System.String},Dynamo.Graph.SaveContext).
extensionData: A copy of the ExtensionData dictionary

Dynamo.Extensions.IExtensionStorageAccess.OnWorkspaceSaving(System.Collections.Generic.Dictionary{System.String,System.String},Dynamo.Graph.SaveContext)
Action to be invoked when the workspace has begun its saving process.
The passed extensionData dictionary is a direct reference to the stored Dynamo.Extensions.ExtensionData data dictionary, modifications to this dictionary
will be reflected in the stored Dynamo.Extensions.ExtensionData data dictionary
extensionData:
saveContext: