Dynamo.Extensions.ExtensionLibraryLoader
Provides functionality for loading node's DLLs

Dynamo.Extensions.ExtensionLibraryLoader.#ctor(Dynamo.Models.DynamoModel)
Initializes a new instance of the Dynamo.Extensions.ExtensionLibraryLoader class.
model: Dynamo model.

Dynamo.Extensions.ExtensionLibraryLoader.LoadNodeLibrary(System.Reflection.Assembly)
Loads a ZeroTouch or NodeModel based node into the VM and search.
To guarantee the node is correctly added to the LibraryUI this method should not
be called while LibraryExtension is loading.
library: The library.

Dynamo.Extensions.ExtensionLibraryLoader.LoadLibraryAndSuppressZTSearchImport(System.Reflection.Assembly)
Loads a zeroTouch or explicit NodeModel based node into the VM.
Does not add zeroTouch libraries to Search. Currently only used by package manager extension.
library: The library.

Dynamo.Extensions.ExtensionLibraryLoader.LoadPackages(System.Collections.Generic.IEnumerable{System.Reflection.Assembly})
Loads packages for import into VM and for node search.
assemblies: