Dynamo.Graph.Nodes.CustomNodes.Output
Represents function output.
It contains functionality to manage expressions and store function's node value to pass.

Dynamo.Graph.Nodes.CustomNodes.Output.NodeType
The NodeType property provides a name which maps to the
server type for the node. This property should only be
used for serialization.

Dynamo.Graph.Nodes.CustomNodes.Output.IsInputNode
Indicates whether node is input node.
Used to bind visibility of UI for user selection.

Dynamo.Graph.Nodes.CustomNodes.Output.IsOutputNode
Indicates whether node is output node.
Used to bind visibility of UI for user selection.

Dynamo.Graph.Nodes.CustomNodes.Output.ElementResolver
Element resolver

Dynamo.Graph.Nodes.CustomNodes.Output.#ctor
Create output node.

Dynamo.Graph.Nodes.CustomNodes.Output.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortModel})
Create output node.

Dynamo.Graph.Nodes.CustomNodes.Output.Symbol
Text in output node.

Dynamo.Graph.Nodes.CustomNodes.Output.Return
Output name and its description tuple.