Dynamo.Scheduler.PreviewGraphAsyncTask.Initialize(Dynamo.Engine.EngineController,Dynamo.Graph.Workspaces.WorkspaceModel)
This method is called by codes that intent to start a graph update.
This method is called on the main thread where node collection in a
WorkspaceModel can be safely accessed.
controller: Reference to an instance of EngineController
to assist in generating GraphSyncData object for the given set of nodes.
workspace: Reference to the WorkspaceModel from which a
set of updated nodes is computed. The EngineController generates the
resulting GraphSyncData from this list of updated nodes.
Returns: Returns the list of node id's that will be executed in the next run
for execution).