Dynamo.Engine.CodeGeneration.CompiledEventArgs
This event is triggered when a NodeModel has been compiled to a list of
AST nodes.

Dynamo.Engine.CodeGeneration.CompiledEventArgs.#ctor(System.Guid,System.Collections.Generic.IEnumerable{ProtoCore.AST.AssociativeAST.AssociativeNode})
Construct ASTBuiltEventArgs with NodeModel and AST nodes.
node:
astNodes:

Dynamo.Engine.CodeGeneration.CompiledEventArgs.Node
Guid of node that has been built to AST nodes.

Dynamo.Engine.CodeGeneration.CompiledEventArgs.NodeId
Guid of node that has been built to AST nodes.

Dynamo.Engine.CodeGeneration.CompiledEventArgs.AstNodes
Built AST nodes.