Dynamo.Graph.Nodes.Statement
Statements are used in CBN in order to create output ports.

Dynamo.Graph.Nodes.Statement.CreateInstance(ProtoCore.AST.Node)
Creates Statement from node
parsedNode: ProtoCore.AST.Node
Returns: Statement

Dynamo.Graph.Nodes.Statement.GetReferencedVariables(ProtoCore.AST.Node,System.Collections.Generic.List{Dynamo.Graph.Nodes.Variable})
Returns variables from AST nodes.
E.g. a+5. Here "a" is variable.
astNode: ProtoCore.AST.Node
refVariableList: list of variables

Dynamo.Graph.Nodes.Statement.GetDefinedVariableNames(Dynamo.Graph.Nodes.Statement)
Returns the names of the variables that have been declared in the statement
s:  Statement whose variable names to be queried.
Returns:

Dynamo.Graph.Nodes.Statement.GetDefinedVariableNamesForOutports(Dynamo.Graph.Nodes.Statement)
Returns the names of the variables that have been declared in the statement
for code block node output ports.
Example: "a[0] = x; a[1] = y;" will return 2 output ports, one for each list index.
s:  Statement whose variable names to be queried.
Returns:

Dynamo.Graph.Nodes.Statement.GetStatementType(ProtoCore.AST.Node)
Returns statement type.
astNode: ProtoCore.AST.Node
Returns: StatementType

Dynamo.Graph.Nodes.Statement.StartLine
Returns the index of the Startline.
E.g. a+5 StartLine will be 1.

Dynamo.Graph.Nodes.Statement.EndLine
Returns the index of the EndLine.
E.g.
a+5
+6+3;
Endline will be 2.

Dynamo.Graph.Nodes.Statement.CurrentState
Returns the State of the Statement.
E.g. normal, warning or error.

Dynamo.Graph.Nodes.Statement.CurrentType
Returns the type of the statement.
E.g. expression, literal etc.

Dynamo.Graph.Nodes.Statement.AstNode
ProtoCore.AST.Node