Dynamo.Migration.MigrationManager.ObsoleteFileCallback
Functions that can be used as a callback in the event an obsolete file is attempted to be loaded.
fileName: Name of file to load
fileVersion: Version of file to load
currentVersion: Current Dynamo version