Dynamo.Library.TypedParameter
A tuple of parameter and its type.

Dynamo.Library.TypedParameter.NameIsValid
Indicates whether a valid name has been set for this parameter.
This property is not serialized.

Dynamo.Library.TypedParameter.#ctor(System.String,System.String,System.Int32,System.String,System.String)
This function creates TypedParameter
name: parameter name
TypeName: parameter TypeName, serialized name of ProtoCore.Type
TypeRank: parameter TypeRank, serialized rank of ProtoCore.Type
defaultValue: parameter defaultValue
summary: parameter Summary, can include comments and documentation.

Dynamo.Library.TypedParameter.#ctor(System.String,ProtoCore.Type,ProtoCore.AST.AssociativeAST.AssociativeNode,System.String,System.String)
This function creates TypedParameter
name: parameter name
type: parameter type
defaultValue: parameter default value
shortArgumentName: short name is used as tooltip
summary: parameter description

Dynamo.Library.TypedParameter.#ctor(System.String,ProtoCore.Type,ProtoCore.AST.AssociativeAST.AssociativeNode,System.String,System.String,System.Boolean)
This function creates TypedParameter
name: parameter name
type: parameter type
defaultValue: parameter default value
shortArgumentName: short name is used as tooltip
summary: parameter description
nameIsValid: indicates whether the name can be parsed

Dynamo.Library.TypedParameter.Function
Returns DesignScript function.

Dynamo.Library.TypedParameter.Name
Returns the name of the parameter.

Dynamo.Library.TypedParameter.Type
Returns type of the parameter.

Dynamo.Library.TypedParameter.DefaultValue
Returns default value of the parameter as AST node.

Dynamo.Library.TypedParameter.DefaultValueString
Returns fully qualified string representation of AST node.

Dynamo.Library.TypedParameter.Summary
Returns summary of the parameter. This may include comments or documentation.

Dynamo.Library.TypedParameter.Description
Returns description of the parameter.

Dynamo.Library.TypedParameter.DisplayTypeName
Returns short type name of the parameter.

Dynamo.Library.TypedParameter.ToString
Turns into string.
Returns: string

Dynamo.Library.TypedParameter.ToCommentNameString
Returns a string in a specific format (Name:Type.Name)
ex: dateTime1:System.DateTime,  test:Autodesk.DesignScript.Geomtery.Curve
Refer to https://jira.autodesk.com/browse/QNTM-3786
Returns: