Dynamo.Engine.CompilationServices
This class is used to precompile code block node.
Also it's used as helper for resolving code in Input and Output nodes.

Dynamo.Engine.CompilationServices.#ctor(Dynamo.Engine.LibraryServices)
Creates CompilationServices.
core: Copilation core

Dynamo.Engine.CompilationServices.PreCompileCodeBlock(ProtoCore.Utils.ParseParam)
Pre-compiles Design script code in code block node.
parseParams: Container for compilation related parameters
Returns: true if code compilation succeeds, false otherwise