Dynamo.Linting.LinterExtensionDescriptor.Id
Id of linter extension

Dynamo.Linting.LinterExtensionDescriptor.Equals(System.Object)
Checks whether two LinterExtensionDescriptor are equal
They are equal if their Name and Id are equal
obj:
Returns:

Dynamo.Linting.LinterExtensionDescriptor.GetHashCode
Gets the hashcode for this LinterExtensionDescriptor
Returns: