Dynamo.Models.RunSettings
The RunSettings object contains properties which control
how execution is carried out.

Dynamo.Models.RunSettings.DefaultRunPeriod
Default milliseconds number for the period in periodic run.

Dynamo.Models.RunSettings.RunPeriod
The length, in milliseconds, of the period
between requests to execute.

Dynamo.Models.RunSettings.RunType
Returns or sets the current Run Type. E.g. Manual, Automatic, Periodic

Dynamo.Models.RunSettings.RunEnabled
A flag which indicates whether running is possible. This
flag is set to false during execution and is set to true
when execution is completed.

Dynamo.Models.RunSettings.#ctor
This method creates default RunSettings with DefaultRunPeriod, Manual run type and run is enabled.

Dynamo.Models.RunSettings.#ctor(Dynamo.Models.RunType,System.Int32)
This function creates RunSettings with specified run type and run period.
runType: RunType
period: milliseconds