Dynamo.Wpf.Interfaces.LayoutSection
Represents a section element, which is the root element in the library view

Dynamo.Wpf.Interfaces.LayoutSection.showHeader
Sections may have headers displayed or hidden. If the header is shown
the section is collapsible, otheriwse its always expanded.

Dynamo.Wpf.Interfaces.LayoutSection.#ctor(System.String)
Default constructor
text: Text value of the element