Dynamo.Graph.Nodes.ZeroTouch.DSFunctionBase
Base class for NodeModels representing zero-touch-imported-function calls.

Dynamo.Graph.Nodes.ZeroTouch.DSFunctionBase.#ctor(Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController{Dynamo.Engine.FunctionDescriptor})
Initializes a new instance of the Dynamo.Graph.Nodes.ZeroTouch.DSFunctionBase class.
controller: Function descritor.

Dynamo.Graph.Nodes.ZeroTouch.DSFunctionBase.IsConvertible
Indicates if this node is allowed to be converted to AST node in nodes to code conversion.

Dynamo.Graph.Nodes.ZeroTouch.DSFunctionBase.GetAstIdentifierForOutputIndex(System.Int32)
Fetches the ProtoAST Identifier for a given output index.
outputIndex: Index of the output port.
Returns: Identifier corresponding to the given output port.

Dynamo.Graph.Nodes.ZeroTouch.DSFunctionBase.SerializeCore(System.Xml.XmlElement,Dynamo.Graph.SaveContext)
Copy command will call it to serialize this node to xml data.

Dynamo.Graph.Nodes.ZeroTouch.DSFunctionBase.GetTypeHintForOutput(System.Int32)
Returns the possible type of output at specified port.
index: Index of the port
Returns: The type