Dynamo.Graph.Nodes.NodeModelExtensions.AllDownstreamNodes(Dynamo.Graph.Nodes.NodeModel,System.Collections.Generic.List{Dynamo.Graph.Nodes.NodeModel})
Get all downstream nodes of a node model
node:  Node model to get downstream nodes of
gathered:  List to recursively gather downstream nodes, set to an empty list to start
Returns:

Dynamo.Graph.Nodes.NodeModelExtensions.GetOriginalName(Dynamo.Graph.Nodes.NodeModel)
Getting the original name before graph author renamed the node
node: target NodeModel
Returns: Original node name as string