Dynamo.Linting.LinterManager
This class handles registration of Linter extensions and linter rule evaluation management.

Dynamo.Linting.LinterManager.AvailableLinters
Available linters

Dynamo.Linting.LinterManager.RuleEvaluationResults
Results from evaluated rules

Dynamo.Linting.LinterManager.ActiveLinter
The LinterDescriptor that is currently set as active

Dynamo.Linting.LinterManager.SetActiveLinter(Dynamo.Linting.LinterExtensionDescriptor,System.Boolean)
The LinterDescriptor setter that can be fully or partially activated

Dynamo.Linting.LinterManager.IsExtensionActive(System.String)
Checks if the uniqueId equals the id of the Active linter descriptor
uniqueId:
Returns: