Dynamo.Updates.IUpdateManager
An interface which describes properties and methods for
updating the application.

Dynamo.Updates.IUpdateManager.ProductVersion
Returns current product version.

Dynamo.Updates.IUpdateManager.AvailableVersion
Returns available product version.

Dynamo.Updates.IUpdateManager.UpdateInfo
Returns information, where version can be updated.

Dynamo.Updates.IUpdateManager.IsUpdateAvailable
Bool value indicates if new version is available.

Dynamo.Updates.IUpdateManager.UpdateDownloaded
Event is fired when an update is downloaded.

Dynamo.Updates.IUpdateManager.ShutdownRequested
Event is fired when Dynamo needs to be restarted.

Dynamo.Updates.IUpdateManager.CheckForProductUpdate(Dynamo.Updates.IAsynchronousRequest)
Checks for product updates in background thread.
request: Asynchronous web request for update data

Dynamo.Updates.IUpdateManager.QuitAndInstallUpdate
Quits and installs new version.

Dynamo.Updates.IUpdateManager.HostApplicationBeginQuit
This function is called when a Dynamo Model is shutting down.

Dynamo.Updates.IUpdateManager.UpdateDataAvailable(Dynamo.Updates.IAsynchronousRequest)
Reads the request's data, and parses for available versions.
If a more recent version is available, the UpdateInfo object
will be set.
request: Asynchronous request

Dynamo.Updates.IUpdateManager.CheckNewerDailyBuilds
This flag is available via the debug menu to
allow the update manager to check for newer daily builds.

Dynamo.Updates.IUpdateManager.ForceUpdate
Specifies whether to force update.

Dynamo.Updates.IUpdateManager.Configuration
Returns a reference to Update Manager Configuration settings.

Dynamo.Updates.IUpdateManager.Log
Event fires, when something should be logged.

Dynamo.Updates.IUpdateManager.OnLog(Dynamo.Logging.LogEventArgs)
This function logs a message.
args: LogEventArgs

Dynamo.Updates.IUpdateManager.RegisterExternalApplicationProcessId(System.Int32)
Sets application process id. It's used for logging.
id: int

Dynamo.Updates.IUpdateManager.HostVersion
Get the current version of the Host

Dynamo.Updates.IUpdateManager.HostName
Get the current name of the Host