Dynamo.Search.SearchCategoryUtil
Utility methods for categorizing search elements.

Dynamo.Search.SearchCategoryUtil.CategorizeSearchEntries``1(System.Collections.Generic.IEnumerable{``0},System.Func{``0,System.Collections.Generic.ICollection{System.String}})
Categorizes a sequence search entries.
entries:
categorySelector:
Returns:

Dynamo.Search.SearchCategoryUtil.GetAllCategoryNames``1(Dynamo.Search.ISearchCategory{``0})
Returns all nested categories from a sequence of search entries.
category:
Returns: