Dynamo.Graph.Nodes.CodeBlockNodeModel
Represents codeblock node's functionality.

Dynamo.Graph.Nodes.CodeBlockNodeModel.NodeType
The NodeType property provides a name which maps to the
server type for the node. This property should only be
used for serialization.

Dynamo.Graph.Nodes.CodeBlockNodeModel.ShouldFocus
Indicates whether code block should not be in focus upon undo/redo actions on node

Dynamo.Graph.Nodes.CodeBlockNodeModel.ElementResolver
Returns Dynamo.Graph.Nodes.CodeBlockNodeModel.ElementResolver for CodeBlock node

Dynamo.Graph.Nodes.CodeBlockNodeModel.IsInputNode
Indicates whether node is input node.
Used to bind visibility of UI for user selection.

Dynamo.Graph.Nodes.CodeBlockNodeModel.IsOutputNode
Indicates whether node is an output node.
Used to bind visibility of UI for user selection.

Dynamo.Graph.Nodes.CodeBlockNodeModel.#ctor(Dynamo.Engine.LibraryServices)
Initilizes a new instance of the Dynamo.Graph.Nodes.CodeBlockNodeModel class
libraryServices: Dynamo.Engine.LibraryServices object to manage
builtin libraries as well as imported libraries

Dynamo.Graph.Nodes.CodeBlockNodeModel.#ctor(System.String,System.Double,System.Double,Dynamo.Engine.LibraryServices,ProtoCore.Namespace.ElementResolver)
Initializes a new instance of the Dynamo.Graph.Nodes.CodeBlockNodeModel class
code: Code block content
x: X coordinate of the code block
y: Y coordinate of the code block
libraryServices: Dynamo.Engine.LibraryServices object to manage
builtin libraries as well as imported libraries
resolver: Responsible for resolving
a partial class name to its fully resolved name

Dynamo.Graph.Nodes.CodeBlockNodeModel.#ctor(System.String,System.Guid,System.Double,System.Double,Dynamo.Engine.LibraryServices,ProtoCore.Namespace.ElementResolver)
Initializes a new instance of the Dynamo.Graph.Nodes.CodeBlockNodeModel class.
Call this constructor only when a first pass compilation of a CBN is needed
without factoring in other CBN function definitions.
userCode: Code block content
guid: Identifier of the code block
xPos: X coordinate of the code block
yPos: Y coordinate of the code block
libraryServices: Dynamo.Engine.LibraryServices object to manage
builtin libraries as well as imported libraries
resolver: Responsible for resolving
a partial class name to its fully resolved name

Dynamo.Graph.Nodes.CodeBlockNodeModel.ProcessError
It removes all the in ports and out ports so that the user knows there is an error.

Dynamo.Graph.Nodes.CodeBlockNodeModel.GetDefinedVariableNames
Returns the names of all the variables defined in this code block.
Returns: List containing all the names

Dynamo.Graph.Nodes.CodeBlockNodeModel.GetInportIndex(Dynamo.Graph.Nodes.CodeBlockNodeModel,System.String)
Returns the index of the port corresponding to the variable name given
cbn:
variableName:  Name of the variable corresponding to an input port
Returns:  Index of the required port in the InPorts collection

Dynamo.Graph.Nodes.CodeBlockNodeModel.IsConvertible
If this node is allowed to be converted to AST node in nodes to code conversion.

Dynamo.Graph.Nodes.CodeBlockNodeModel.AstIdentifierBase
Code block node displays the value
of the left hand side variable of last statement.

Dynamo.Graph.Nodes.CodeBlockNodeModel.Code
Returns string content of CodeBlock node.

Dynamo.Graph.Nodes.CodeBlockNodeModel.SetCodeContent(System.String,ProtoCore.Namespace.ElementResolver)
Sets string content of CodeBlock node.
newCode: New content of the code block
workspaceElementResolver: Dynamo.Graph.Nodes.CodeBlockNodeModel.ElementResolver object

Dynamo.Graph.Nodes.CodeBlockNodeModel.CodeStatements
Code statement of CBN

Dynamo.Graph.Nodes.CodeBlockNodeModel.SetNodeStateBasedOnConnectionAndDefaults
If a CBN is in Error state, it will have no code but will have output ports
from the last successful compilation if any.
In this case it should continue to be in Error state.

Dynamo.Graph.Nodes.CodeBlockNodeModel.GetAstIdentifierForOutputIndexInternal(System.Int32,System.Boolean)
For code block nodes, each output identifier of an output port is mapped.
For an example, "p = 1" would have its internal identifier renamed to
"pXXXX", where "XXXX" is the GUID of the code block node. This mapping is
done to ensure the uniqueness of the output variable name.
portIndex: Output port index
forRawName: Set this parameter to true to retrieve the
original identifier name "p". If this parameter is false, the mapped
identifer name "pXXXX" is returned instead.
Returns:

Dynamo.Graph.Nodes.CodeBlockNodeModel.GetAstIdentifierForOutputIndex(System.Int32)
Fetches the ProtoAST Identifier for a given output index.
outputIndex: Index of the output port.
Returns: Identifier corresponding to the given output port.

Dynamo.Graph.Nodes.CodeBlockNodeModel.GetRawAstIdentifierForOutputIndex(System.Int32)
Fetches the raw ProtoAST Identifier for a given index.
portIndex: Index of the port.
Returns: Identifier corresponding to the given port

Dynamo.Graph.Nodes.CodeBlockNodeModel.GetTypeHintForOutput(System.Int32)
Returns possible type of the output at specified output port.
index: Index of the port
Returns: The type

Dynamo.Graph.Nodes.CodeBlockNodeModel.UndefineFunctionDefinitions
Undefine a function definition in a code block node if it has any.

Dynamo.Graph.Nodes.CodeBlockNodeModel.RecompileCodeBlockAST(System.String@,System.String@)
This method skips parsing and only recompiles a CBN in a second pass after all other function definitions
have been compiled. It re-uses the ParseParam (ASTs etc.) of the CBN compiled from the first pass.
errorMessage:
warningMessage:

Dynamo.Graph.Nodes.CodeBlockNodeModel.CreateInputOutputPorts
Creates the inport and outport data based on
the statements generated from the user code.

Dynamo.Graph.Nodes.CodeBlockNodeModel.SaveAndDeleteConnectors(System.Collections.IDictionary,System.Collections.IDictionary,System.Collections.IDictionary,System.Collections.IDictionary)
Deletes all the connections and saves their data (the start and end port)
so that they can be recreated if needed.
InportPins correspond to all connectorPins belonging to INports.
OutportPins correspond to all connectorpins belonging to OUTports.
inportConnections: A list of connections that will be destroyed
outportConnections:

Dynamo.Graph.Nodes.CodeBlockNodeModel.LoadAndCreateConnectors(System.Collections.Specialized.OrderedDictionary,System.Collections.Specialized.OrderedDictionary,System.Collections.Specialized.OrderedDictionary,System.Collections.Specialized.OrderedDictionary,Dynamo.Graph.SaveContext)
Now that the portData has been set for the new ports, we recreate the connections we
so mercilessly destroyed, restoring peace and balance to the world once again.
InportPins correspond to all connectorPins belonging to INports.
OutportPins correspond to all connectorpins belonging to OUTports.
inportConnections:
outportConnections:  List of the connections that were killed
context: context this operation is being performed in

Dynamo.Graph.Nodes.CodeBlockNodeModel.AddConnectorPinsToConnectors(System.Collections.Generic.List{System.Collections.Generic.List{Dynamo.Graph.ConnectorPinModel}})
Adds a collection of connectorPins to their corresponding connector.
connectorPinList: