Dynamo.Graph.Workspaces.WorkspaceReadConverter
The WorkspaceConverter is used to serialize and deserialize WorkspaceModels.
Construction of a WorkspaceModel requires things like an EngineController,
a NodeFactory, and a Scheduler. These must be supplied at the time of
construction and should not be serialized.