Dynamo.Models.DynamoModel.RunCompletedHandler
Represents the method that will handle the Dynamo.Models.DynamoModel.RunCompleted event of the Dynamo.Models.DynamoModel class.
sender: The object which caused the event
success: Indicates if run completed successfully