Dynamo.Extensions.ExtensionManager
This class handles registration, lookup, and disposal of extensions.

Dynamo.Extensions.ExtensionManager.#ctor
Creates ExtensionManager.

Dynamo.Extensions.ExtensionManager.#ctor(System.Collections.Generic.IEnumerable{System.String})
Creates ExtensionManager with directories which require package certificate verification.

Dynamo.Extensions.ExtensionManager.Add(Dynamo.Extensions.IExtension)
Adds an extension to the current session.
extension: Extension

Dynamo.Extensions.ExtensionManager.Remove(Dynamo.Extensions.IExtension)
Removes an extension from the current session.
extension: Extension

Dynamo.Extensions.ExtensionManager.Extensions
Returns the collection of registered extensions

Dynamo.Extensions.ExtensionManager.StorageAccessExtensions
Returns the collection of registered extensions implementing IExtensionStorageAccess

Dynamo.Extensions.ExtensionManager.ExtensionAdded
This event is fired when a new extension is added.

Dynamo.Extensions.ExtensionManager.ExtensionRemoved
This event is fired when a new extension is removed,

Dynamo.Extensions.ExtensionManager.ExtensionLoader
This loader loads extensions in Dynamo.

Dynamo.Extensions.ExtensionManager.Dispose
Disposes all the loaded extensions.

Dynamo.Extensions.ExtensionManager.MessageLogged
This event is fired when a message is logged.

Dynamo.Extensions.ExtensionManager.RegisterService``1(``0)
Allows extension applications to register some specific service by its type.
Only one service of a given type can be registered.
Type of the service
service: The service object to register
Returns: A key for the registered service if registeration is
successful else null.

Dynamo.Extensions.ExtensionManager.UnregisterService``1(System.String)
Unregisters a service of given type registered with given key.
Type of the service
serviceKey: The service key to ensure that only authorized
client is unregistering this service type.
Returns:

Dynamo.Extensions.ExtensionManager.Service``1
Gets the service object of the specified type.
Type of the service
Returns: The service object if registered else null

Dynamo.Extensions.ExtensionManager.GetService(System.Type)
Gets the service object of the specified type.
serviceType: Type of the service
Returns: The service object if registered else null