Dynamo.Scheduler.ISchedulerThread
Interface provides method for DynamoSchedulerThread.

Dynamo.Scheduler.ISchedulerThread.Initialize(Dynamo.Scheduler.IScheduler)
DynamoScheduler calls this method to initialize and start this
instance of scheduler thread. This call marks the point from which
it is safe to call into DynamoScheduler.
owningScheduler: A reference to the DynamoScheduler
object which owns this instance of scheduler thread.

Dynamo.Scheduler.ISchedulerThread.Shutdown
DynamoScheduler calls this method to shutdown the scheduler thread.