Dynamo.Graph.Connectors.ConnectorType
Returns the Type of connector.

Dynamo.Graph.Connectors.ConnectorType.BEZIER
Displays connectors as bezier curves

Dynamo.Graph.Connectors.ConnectorType.POLYLINE
Displays connectors as set of connected straight lines