Dynamo.Graph.Nodes.NodeInputData
Represents a node which acts as a UI input for the graph
- may also hold a value for that input

Dynamo.Graph.Nodes.NodeInputData.Id
The id of the node.

Dynamo.Graph.Nodes.NodeInputData.Name
Display name of the input node.

Dynamo.Graph.Nodes.NodeInputData.Type
The type of input this node is.

Dynamo.Graph.Nodes.NodeInputData.Value
The value of the input when the graph was saved.
This should always be a string for all types.

Dynamo.Graph.Nodes.NodeInputData.Choices
If this input is a dropdownSelection type a list of choices a user can select.

Dynamo.Graph.Nodes.NodeInputData.MaximumValue
if this input is a Number, the max value of that number.

Dynamo.Graph.Nodes.NodeInputData.MinimumValue
if this input is a Number, the min value of that number.

Dynamo.Graph.Nodes.NodeInputData.StepValue
if this input is a Number, the step value of that number when it acts as a slider.

Dynamo.Graph.Nodes.NodeInputData.NumberType
if this input is a Number, the number type Double or Integer that the number returns.

Dynamo.Graph.Nodes.NodeInputData.Description
Description displayed to user of this input node.

Dynamo.Graph.Nodes.NodeInputData.SelectedIndex
The index of the selected item.