Dynamo.Models.DynamoModel.DynamoModelState
Based on the DynamoModelState a dependent component can take certain
decisions regarding its UI and functionality.
In order to be able to run a specified graph , DynamoModel needs to be
at least in StartedUIless state.