Dynamo.Extensions.IExtensionManager
This class handles registration, lookup, and disposal of extensions.  There should only
be one of these per application instance.

Dynamo.Extensions.IExtensionManager.Add(Dynamo.Extensions.IExtension)
Add an extension to the current application session.

Dynamo.Extensions.IExtensionManager.Remove(Dynamo.Extensions.IExtension)
Remove an extension from the current application session.

Dynamo.Extensions.IExtensionManager.Extensions
The collection of currently registered extensions

Dynamo.Extensions.IExtensionManager.ExtensionAdded
Event raised when an extension is added

Dynamo.Extensions.IExtensionManager.ExtensionRemoved
Event raised when an extension is removed

Dynamo.Extensions.IExtensionManager.ExtensionLoader
Returns Extension loader.