Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Returns points spaced on the curve at given chord length starting from the given point
point:  The reference point from where to measure
chordLength:  Chord length
Returns:  List of points on curve

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Get the parameter at a given point along the curve. If the point is not on the curve gets the closest parameter. If the input Curve is a PolyCurve this function will return a valid parameter only if the Point lies on the PolyCurve. For other Curve types this function will return the parameter along the Curve which lies at the closest Point to the input Point.
point:  A point along or near the curve
Returns:  The parameter on the curve for PolyCurves or the closest parameter along the curve for other curve types.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Removes several segments of the Curve, discarding 2nd, 4th, 6th ... segments if the bool is true
parameters:  A list of parameters at which to split the curve
discardEvenSegments:  Toggle to discard even segments
Returns:  An Array of curves disgarding 2nd, 4th, 6th ... segments if the bool is true
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projects an input curve along a given projection direction onto a specified base geometry. Geometry to project ontoVectorList of geometries projected into base geometry
baseGeometry:
projectionDirection:
Returns: