Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Get the intersection of two BoundingBoxes
other:  Other bounding box to intersect
Returns:  Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determine whether two BoundingBoxes intersect
other:  Other bounding box
Returns:  Do bounding boxes intersect
get overlap