Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Fillet polycurve in its plane.
radius:  Radius of fillet
rightSide:  True to fillet on the right side relative the start of polycurve, false to fillet on the left side
Returns:  Filleted polyCurve
round,smooth,radius