Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Create a Surface by sweeping a cross section Curve along a path.
profile:  Curve to sweep
path:  Path curve used to sweep along
Returns:  Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Trim the surface with a collection of one or more loops within the input surface.  One of the loops needs to be the boundary loop of the input surface.  In addition, one or more inner loops need to be added for holes.
loops:
Returns:
trim multiple,removeloops,cutloops